{
  "S10nagsu_pu:0": "Reconstructed text of the Nagaropamasūtra according to one of the MS traditions,",
  "S10nagsu_pu:1": "namely the Pelliot/",
  "S10nagsu_pu:2": "Stein manuscript",
  "S10nagsu_pu:3": "I. Canonical Text",
  "S10nagsu_pu:4": "NagSū I.1 evaṃ mayā śrutam ekasmin samaye bhagavāñ śrāvastyāṃ viharati sma jetavane 'nāthapiṇḍadasyārāme ─",
  "S10nagsu_pu:5": "SHT 154 (beginning of MS)",
  "S10nagsu_pu:6": "opens here as follows:",
  "S10nagsu_pu:7": "śrāvastyāṃ nidānaṃ pūrvvaṃ me bhikṣavaḥ saṃbodhim.",
  "S10nagsu_pu:8_0": "NagSū I.2 tatra bhagavān bhikṣūn āmantrayati sma ─ pūrvaṃ me bhikṣavo anuttarāṃ samyaksaṃbodhim",
  "S10nagsu_pu:8_1": "anabhisaṃbuddhasyaikākino rahasigatasya pratisaṃlīnasyaivaṃ cetasi cetaḥparivitarka udapādi",
  "S10nagsu_pu:9_0": "NagSū I.3 kṛcchraṃ batāyaṃ loka āpanno yad uta jāyate 'pi jīryate 'pi mriyate 'pi",
  "S10nagsu_pu:9_1": "cyavate 'py upapadyate 'pi atha ca punar ime satvā jarāmaraṇasyottare niḥsaraṇaṃ",
  "S10nagsu_pu:9_2": "yathābhūtaṃ na prajānanti ─",
  "S10nagsu_pu:10": "NagSū I.4 tasya mamaitad abhavat ─ kasmin nu sati jarāmaraṇaṃ bhavati kiṃpratyayaṃ ca punar jarāmaraṇaṃ tasya mama yoniśo manasikurvata evaṃ yathābhūtasyābhisamaya udapādi ─",
  "S10nagsu_pu:11": "jātyāṃ satyāṃ jarāmaraṇaṃ bhavati ─ jātipratyayañ ca punar jarāmaraṇam ─",
  "S10nagsu_pu:12_0": "NagSū I.5 tasya mamaitad abhavat ─ kasmiṃ nu sati jātir bhavati ─ kiṃpratyayā ca",
  "S10nagsu_pu:12_1": "punar jātiḥ ─ tasya mama yoniśo manasikurvata evaṃ yathābhūtasyābhisamaya udapādi",
  "S10nagsu_pu:12_2": "─ bhave sati jātir bhavati bhavapratyayā ca punar jātiḥ",
  "S10nagsu_pu:13": "We should note that our reconstructed text here (from end of 119v6 to beginning of 120r1)",
  "S10nagsu_pu:14": "has many more akṣaras than the gap would allow for. Because our reconstructed text almost certainly must represent something close to the original text,",
  "S10nagsu_pu:15_0": "we have supposed that the scribe's eye in all likelihood skipped from the first yathābhūtasyābhi-",
  "S10nagsu_pu:15_1": "which would have concluded 119v6 down to -samaya udapādi which would have begun 120r1.",
  "S10nagsu_pu:15_2": "The reconstructed text is based upon Hoernle no.149.x.33 [= Or.15009 /670] v1 4 and SHT 154.",
  "S10nagsu_pu:16_0": "NagSū I.6 tasya mamaitad abhavat kasmiṃ nu sati bhavo bhavati ─ kiṃpratyayaś ca punar",
  "S10nagsu_pu:16_1": "bhavaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ upādāne",
  "S10nagsu_pu:16_2": "sati bhavo bhavati upādānapratyayaś ca punar bhavaḥ",
  "S10nagsu_pu:17_0": "NagSū I.7 tasya mamaitad abhavat kasmiṃ nu sati upādānaṃ bhavati kiṃpratyayaṃ ca",
  "S10nagsu_pu:17_1": "punar upādānaṃ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi",
  "S10nagsu_pu:17_2": "─ tṛṣṇāyāṃ satyāṃ upādānaṃ bhavati tṛṣṇāpratyayañ ca punar upādānaṃ",
  "S10nagsu_pu:18_0": "NagSū I.8 tasya mamaitad abhavat kasmiṃ nu sati tṛṣṇā bhavati kiṃpratyayā ca punas",
  "S10nagsu_pu:18_1": "tṛṣṇā tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ vedanāyāṃ",
  "S10nagsu_pu:18_2": "satyāṃ tṛṣṇā bhavati vedanāpratyayā ca punas tṛṣṇā ─",
  "S10nagsu_pu:19_0": "NagSū I.9 tasya mamaitad abhavat kasmiṃ nu sati vedanā bhavati kiṃpratyayā ca punar",
  "S10nagsu_pu:19_1": "vedanā tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ sparśe",
  "S10nagsu_pu:19_2": "sati vedanā bhavati ─ sparśapratyayā ca punar vedanā ─",
  "S10nagsu_pu:20_0": "NagSū I.10 tasya mamaitad abhavat kasmiṃ nu sati sparśo bhavati kiṃpratyayaś ca punaḥ",
  "S10nagsu_pu:20_1": "sparśaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ ṣaḍāyatane",
  "S10nagsu_pu:20_2": "sati sparśo bhavati ṣaḍāyatanapratyayaś ca punaḥ sparśaḥ",
  "S10nagsu_pu:21": "NagSū I.11 tasya mamaitad abhavat kasmiṃ nu sati ṣaḍāyatanaṃ bhavati kiṃpratyayaṃ ca punaḥ ṣaḍāyatanaṃ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
  "S10nagsu_pu:22": "nāmarūpe sati ṣaḍāyatanaṃ bhavati nāmarūpapratyayañ ca punaḥ ṣaḍāyatanaṃ",
  "S10nagsu_pu:23_0": "NagSū I.12 tasya mamaitad abhavat kasmiṃ nu sati nāmarūpaṃ bhavati kiṃpratyayañ ca",
  "S10nagsu_pu:23_1": "punar nāmarūpaṃ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi",
  "S10nagsu_pu:23_2": "─ vijñāne sati nāmarūpaṃ bhavati vijñānapratyayañ ca punar nāmarūpaṃ",
  "S10nagsu_pu:24_0": "tasya mamaitad abhavat kasmiṃ nu sati vijñānaṃ bhavati kiṃpratyayaṃ ca punar vijñānaṃ",
  "S10nagsu_pu:24_1": "tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ nāmarūpe sati",
  "S10nagsu_pu:24_2": "vijñānaṃ bhavati nāmarūpapratyayaṃ ca punar vijñānaṃ",
  "S10nagsu_pu:25": "tasya mama vijñānāt pratyudāvartate mānasaṃ nātaḥ parato vyativartate",
  "S10nagsu_pu:26": "NagSū I.13 14 The reason for skipping numbers 13 and 14 is that in following Tripāṭhī's paragraphing,",
  "S10nagsu_pu:27": "we have not adopted his reconstruction of the pratītyasamutpāda formula here to twelve aṅgas. See Introduction section IV.C for further discussion.",
  "S10nagsu_pu:28_0": "NagSū I.15 yad uta nāmarūpapratyayaṃ vijñānaṃ vijñānapratyayaṃ nāmarūpaṃ nāmarūpapratyayaṃ",
  "S10nagsu_pu:28_1": "ṣaḍāyatanaṃ ṣaḍāyatanapratyayaḥ sparśaḥ sparśapratyayā vedanā vedanāpratyayā tṛṣṇā",
  "S10nagsu_pu:28_2": "tṛṣṇāpratyayam upādānam upādānapratyayo bhava bhavapratyayā jātir jātipratyayaṃ jarāmaraṇaṃ",
  "S10nagsu_pu:28_3": "śokaparidevaduḥkhadaurmanasyopāyāsāḥ saṃbhavaṃty evam asya kevalasya mahato duḥkhaskandhasya",
  "S10nagsu_pu:28_4": "samudayo bhavati ─ //",
  "S10nagsu_pu:29_0": "NagSū I.16 tasya mamaitad abhavat kasmin nv asati jarāmaraṇaṃ na bhavati ─ kasya",
  "S10nagsu_pu:29_1": "nirodhāj jarāmaraṇanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya",
  "S10nagsu_pu:29_2": "udapādi jātyām asatyāṃ jarāmaraṇaṃ na bhavati jātinirodhāj jarāmaraṇanirodhaḥ",
  "S10nagsu_pu:30_0": "NagSū I.17 tasya mamaitad abhavat kasmin nv asati jātir na bhavati ─ kasya nirodhāj",
  "S10nagsu_pu:30_1": "jātinirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi",
  "S10nagsu_pu:30_2": "─ bhave asati jātir na bhavati bhavanirodhāj jātinirodhaḥ",
  "S10nagsu_pu:31_0": "NagSū I.18 tasya mamaitad abhavat kasmin nv asati bhavo na bhavati ─ kasya nirodhād",
  "S10nagsu_pu:31_1": "bhavanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi",
  "S10nagsu_pu:31_2": "─ upādāne asati bhavo na bhavati upādānanirodhād bhavanirodhaḥ",
  "S10nagsu_pu:32_0": "NagSū I.19 tasya mamaitad abhavat kasmin nv asati upādānaṃ na bhavati kasya nirodhād",
  "S10nagsu_pu:32_1": "upādānanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi",
  "S10nagsu_pu:32_2": "tṛṣṇāyām asatyām upādānaṃ na bhavati tṛṣṇānirodhād upādānanirodhaḥ",
  "S10nagsu_pu:33": "NagSū I.20 tasya mamaitad abhavat kasmin nv asati tṛṣṇā na bhavati kasya nirodhāt tṛṣṇānirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
  "S10nagsu_pu:34": "vedanāyām asatyāṃ tṛṣṇā na bhavati vedanānirodhāt tṛṣṇānirodhaḥ",
  "S10nagsu_pu:35": "NagSū I.21 tasya mamaitad abhavat kasmin nv asati vedanā na bhavati kasya nirodhād vedanānirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
  "S10nagsu_pu:36": "sparśe asati vedanā na bhavati sparśanirodhād vedanānirodhaḥ",
  "S10nagsu_pu:37": "NagSū I.22 tasya mamaitad abhavat kasmin nv asati sparśo na bhavati kasya nirodhāt sparśanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
  "S10nagsu_pu:38": "ṣaḍāyatane asati sparśo na bhavati ṣaḍāyatananirodhāt sparśanirodhaḥ",
  "S10nagsu_pu:39_0": "NagSū I.23 tasya mamaitad abhavat kasmin nv asati ṣaḍāyatanaṃ na bhavati kasya nirodhāt",
  "S10nagsu_pu:39_1": "ṣaḍāyatananirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi",
  "S10nagsu_pu:39_2": "─ nāmarūpe asati ṣaḍāyatanaṃ na bhavati nāmarūpanirodhāt ṣaḍāyatananirodhaḥ",
  "S10nagsu_pu:40_0": "NagSū I.24 tasya mamaitad abhavat kasmin nv asati nāmarūpaṃ na bhavati kasya nirodhān",
  "S10nagsu_pu:40_1": "nāmarūpanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi",
  "S10nagsu_pu:40_2": "─ vijñāne asati nāmarūpaṃ na bhavati vijñānanirodhān nāmarūpanirodhaḥ",
  "S10nagsu_pu:41": "NagSū I.25 tasya mamaitad abhavat kasmin nv asati vijñānaṃ na bhavati kasya nirodhād vijñānanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
  "S10nagsu_pu:42": "saṃskāreṣv asatsu vijñānaṃ na bhavati saṃskāranirodhād vijñānanirodhaḥ",
  "S10nagsu_pu:43": "NagSū I.26 tasya mamaitad abhavat kasmin nv asati saṃskārā na bhavanti kasya nirodhāt saṃskāranirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
  "S10nagsu_pu:44": "avidyāyām asatyāṃ saṃskārā na bhavaṃti avidyānirodhāt saṃskāranirodhaḥ",
  "S10nagsu_pu:45": "P.S. Bleu 67(1)v2 and SHT 420, folio 7r3 (NidSa,",
  "S10nagsu_pu:46": "transliteration no. 109)",
  "S10nagsu_pu:47": "have following phrase:",
  "S10nagsu_pu:48": "ity avidyānirodhāt saṃskāranirodhaḥ).",
  "S10nagsu_pu:49_0": "NagSū I.27 saṃskāranirodhād vijñānanirodhaḥ vijñānanirodhān nāmarūpanirodhaḥ nāmarūpanirodhāt",
  "S10nagsu_pu:49_1": "ṣaḍāyatananirodhaḥ ṣaḍāyatananirodhāt sparśanirodhaḥ sparśanirodhād vedanānirodhaḥ",
  "S10nagsu_pu:49_2": "vedanānirodhāt tṛṣṇānirodhaḥ tṛṣṇānirodhād upādānanirodhaḥ upādānanirodhād bhavanirodhaḥ",
  "S10nagsu_pu:49_3": "bhavanirodhāj jātinirodhaḥ jātinirodhāj jarāmaraṇanirodhaḥ śokaparidevaduḥkhadaurmanasyopāyāsā",
  "S10nagsu_pu:49_4": "nirudhyaṃty evam asya kevalasya mahato duḥkhaskandhasya nirodho bhavati //",
  "S10nagsu_pu:50": "NagSū I.28 tasya mamaitad abhavad adhigato me paurāṇo mārgaḥ paurāṇo vartma paurāṇī puṭā pūrvakairṣibhir yātānuyātā",
  "S10nagsu_pu:51": "The classical Sanskrit form,",
  "S10nagsu_pu:52": "which we have used throughout the reconstructed portions of our text,",
  "S10nagsu_pu:53": "would of course be -kair ṛṣi-. However the MS does not allow space for that many akṣaras,",
  "S10nagsu_pu:54": "so we have adopted the form used elsewhere in the Pelliot/",
  "S10nagsu_pu:55": "Stein MS. See note 9 of the translation for further remarks.",
  "S10nagsu_pu:56_0": "NagSū I.29 tadyathā puruṣaḥ araṇye pravaṇe anvāhiṇḍaṃ adhigacchet paurāṇaṃ mārgaṃ",
  "S10nagsu_pu:56_1": "paurāṇaṃ vartmaṃ paurāṇīṃ puṭāṃ pūrvakair manuṣyair yātānuyātā ─ sa tam anugacchet",
  "S10nagsu_pu:56_2": "sa tam anugacchaṃ sa tatra paśyet paurāṇaṃ mārgaṃ paurāṇaṃ nagaraṃ paurāṇīṃ rājadhānīm",
  "S10nagsu_pu:56_3": "ārāmasaṃpannāṃ vanasaṃpannāṃ puṣkariṇīsaṃpannāṃ śubhāṃ dāpavatīṃ ramaṇīyāṃ",
  "S10nagsu_pu:57": "paśyet paurāṇaṃ mārgaṃ:",
  "S10nagsu_pu:58": "omit paurāṇaṃ mārgaṃ,",
  "S10nagsu_pu:59": "cf. next paragraph.",
  "S10nagsu_pu:60_0": "NagSū I.30 tasyaivaṃ syād yan nv ahaṃ gatvā rājñe ārocayeyaṃ atha sa puruṣo rājñe",
  "S10nagsu_pu:60_1": "gatvā ārocayed yat khalu deva jānīyāḥ ihāham adrākṣam araṇye pravaṇe anvāhiṇḍaṃ paurāṇaṃ",
  "S10nagsu_pu:60_2": "mārgaṃ paurāṇaṃ vartma paurāṇīṃ puṭāṃ pūrvakair manuṣyair yātānuyātāṃ so 'haṃ tam",
  "S10nagsu_pu:60_3": "anugatavāṃ so 'haṃ tam anugacchann adrākṣaṃ paurāṇaṃ nagaraṃ paurāṇīṃ rājadhānīm",
  "S10nagsu_pu:60_4": "ārāmasaṃpannāṃ vanasaṃpannāṃ puṣkariṇīsaṃpannāṃ śubhāṃ dāpavatīṃ ramaṇīyāṃ tāṃ devo nagarīṃ māpayatu",
  "S10nagsu_pu:61": "NagSū I.31 atha sa rājā tāṃ nagarīṃ māpayet sā ca syād apareṇa samayena rājadhānī ṛddhā ca sphītā ca kṣemā ca subhīkṣā cākīrṇabahujanamanuṣyā ca ─",
  "S10nagsu_pu:62": "NagSū I.32 evam evā bhikṣava adhigato me paurāṇo mārgaḥ paurāṇaṃ vartma paurāṇī puṭā pūrvakairṣibhir yātānuyātā",
  "S10nagsu_pu:63": "evam evā: read evam eva",
  "S10nagsu_pu:64": "NagSū I.33 katamo 'sau paurāṇo mārgaḥ paurāṇaṃ vartmaḥ paurāṇī puṭā pūrvakairṣibhir yātānuyātā :",
  "S10nagsu_pu:65": "NagSū I.34 yad utāryāṣṭāṅgo mārgaḥ tadyathā samyagdṛṣṭiḥ samyaksaṃkalpaḥ samyagvāk samyakkarmāntaḥ samyagājīvaḥ samyagvyāyāmaḥ samyaksmṛtiḥ samyaksamādhir evāṣṭamaḥ",
  "S10nagsu_pu:66": "NagSū I.35 At least one MS (SHT 787 = NidSa transliteration no. 127.2)",
  "S10nagsu_pu:67": "inserts the following sentence after evāṣṭamaḥ:",
  "S10nagsu_pu:68": "ayam asau bhikṣavaḥ paurāṇo mārgaḥ paurāṇaṃ vartma paurāṇī pūṭā pūrvakai ṛṣibhir yātānuyātā;",
  "S10nagsu_pu:69": "cf. also the Mūlasarvāstivāda-vinaya citation [V. Näther,",
  "S10nagsu_pu:70": "C. Vogel,",
  "S10nagsu_pu:71": "and K. Wille,",
  "S10nagsu_pu:72": "“The Final Leaves of the Pravrajyāvastu Portion of the Vinayavastu Manuscript Found Near Gilgit,",
  "S10nagsu_pu:73": "Part 1,",
  "S10nagsu_pu:74": "Saṃgharakṣitāvadāna“,",
  "S10nagsu_pu:75": "in: Sanskrit-Texte aus dem buddhistischen Kanon:",
  "S10nagsu_pu:76": "Neuentdeckungen und Neueditionen III,",
  "S10nagsu_pu:77": "Göttingen 1996 (Sanskrit-Wörterbuch der buddhistischen Texte aus den Turfan-Funden, Beiheft 6)",
  "S10nagsu_pu:78": ", p. 260]. This sentence constitutes par. 35 in Tripāṭhī's edition,",
  "S10nagsu_pu:79": "but since it is missing in the Pelliot/",
  "S10nagsu_pu:80": "Stein MS, we have likewise omitted this paragraph here.",
  "S10nagsu_pu:81": "NagSū I.36 so 'haṃ tam anugatavāṃ so 'haṃ tam anugacchaṃ jarāmaraṇam adrākṣaṃ jarāmaraṇasamudayaṃ jarāmaraṇanirodhaṃ jarāmaraṇanirodhagāminīṃ pratipadam adrākṣam",
  "S10nagsu_pu:82": "NagSū I.37 evaṃ jātibhavopādānatṛṣṇāvedanāsparśaṣaḍāyatananāmarūpavijñānaṃ saṃskārān adrākṣaṃ saṃskārasamudayaṃ saṃskāranirodhaṃ saṃskāranirodhagāminīṃ pratipadam adrākṣaṃ",
  "S10nagsu_pu:83": "P.S. Bleu 67(3)r4ff. preserves a fully elaborated text instead of this more truncated passage:",
  "S10nagsu_pu:84": "jātim adrākṣaṃ jātisamudayaṃ jātinirodhaṃ jātinirodhagāminīṃ pratipadam adrākṣaṃ ─",
  "S10nagsu_pu:85": "bhavam adrākṣaṃ bhavasamuda(5)",
  "S10nagsu_pu:86": "yaṃ bhavanirodhaṃ bhavanirodhagāminīṃ pratipadam adrākṣaṃ ─ upādānam adrākṣaṃ upādānasamudayaṃ upādānanirodham upādāna(3v1)",
  "S10nagsu_pu:87": "nirodhagāminīṃ pratipadam adrākṣaṃ ─ tṛṣṇām adrākṣaṃ tṛṣṇāsamudayaṃ tṛṣṇānirodhaṃ tṛṣṇānirodhagāminīṃ pratipadam adrākṣaṃ ─ sparśa(2)",
  "S10nagsu_pu:88": "m adrākṣaṃ sparśasamudayaṃ sparśanirodhaṃ sparśanirodhagāminīṃ pratipadam adrākṣaṃ ─ ṣaḍāyatanam adrākṣaṃ ṣaḍāyatana(3)",
  "S10nagsu_pu:89": "samudayaṃ ṣaḍāyatananirodhaṃ ṣaḍāyatananirodhagāminīṃ pratipadam adrākṣaṃ ─ nāmarūpam adrākṣaṃ nāmarūpasa(4)",
  "S10nagsu_pu:90": "mudayaṃ nāmarūpanirodhaṃ nāmarūpanirodhagāminīṃ pratipadam adrākṣaṃ ─ vijñānam adrākṣaṃ vijñānasamudayaṃ vijñānaniro(5)",
  "S10nagsu_pu:91": "dhaṃ vijñānanirodhagāminīṃ pratipadam adrākṣaṃ ─ saṃskāram adrakṣaṃ saṃskārasamudayaṃ . . . ; cf. P.S. Bleu 77v3 6,",
  "S10nagsu_pu:92": "78v3 5,",
  "S10nagsu_pu:93": "276vx z,",
  "S10nagsu_pu:94": "Petits frags. 693, 1295,",
  "S10nagsu_pu:96": "and 1297; SHT 157,",
  "S10nagsu_pu:97": "fragment br1 2 and 787r4 v4.",
  "S10nagsu_pu:98": "NagSū I.38 so 'ham imāṃ dharmāṃ svayam abhijñāyābhisaṃbuddhyā bhikṣūṇām ārocayāmi bhikṣūṇīnām upāsakānām upāsikānāṃ nānātīrthyaśramaṇabrāhmaṇacarakaparivrājakānāṃ",
  "S10nagsu_pu:99_0": "NagSū I.39 tatra bhikṣur api samyakpratipadyamānaḥ ārādhako bhavati ārādhayati nyāyaṃ",
  "S10nagsu_pu:99_1": "dharmaṃ kuśalaṃ bhikṣuṇy apy upāsako 'py upāsikāpi samyakpratipadyamānā ārādhikā",
  "S10nagsu_pu:99_2": "bhavati ─ ārādhayati nyāyaṃ dharmaṃ kuśalam ─",
  "S10nagsu_pu:100": "NagSū I.40 evam idaṃ brahmacaryaṃ vaistārikaṃ bhavati bahujanyaṃ pṛthubhūtaṃ yāvad devamanuṣyebhyaḥ samyaksuprakāśitam //",
  "S10nagsu_pu:101": "Krot. 9(2)r1 2 continues:",
  "S10nagsu_pu:102": "idam avocat bhagavāṃ āptamanasas te bhikṣavo bhagavato bhāṣitam abhyanandam //",
  "S10nagsu_pu:103": "nagaropamasūtraṃ samāpta // //",
  "S10nagsu_pu:105": "; line 3 contains a colophon for which see Transliteration,",
  "S10nagsu_pu:106": "Canonical Text,",
  "S10nagsu_pu:107": "V. Cf. also SHT 152,",
  "S10nagsu_pu:108": "fragment ev2 3. The end of the canonical text is missing from the Pelliot/",
  "S10nagsu_pu:109": "Stein MS. We have reconstructed this section on the basis of Pet 1v5 2r1,",
  "S10nagsu_pu:110": "SHT 157,",
  "S10nagsu_pu:111": "fragment br4 5,",
  "S10nagsu_pu:112": "167r6 v2,",
  "S10nagsu_pu:113": "179r5 v2,",
  "S10nagsu_pu:114": "and 616v3 4; cf. also the Mūlasarvāstivāda-vinayacitation [V. Näther,",
  "S10nagsu_pu:115": "C. Vogel,",
  "S10nagsu_pu:116": "and K. Wille,",
  "S10nagsu_pu:117": "“The Final Leaves of the Pravrajyāvastu Portion of the Vinayavastu Manuscript Found Near Gilgit,",
  "S10nagsu_pu:118": "Part 1,",
  "S10nagsu_pu:119": "Saṃgharakṣitāvadāna“,",
  "S10nagsu_pu:120": "in: Sanskrit-Texte aus dem buddhistischen Kanon:",
  "S10nagsu_pu:121": "Neuentdeckungen und Neueditionen III,",
  "S10nagsu_pu:122": "Göttingen 1996 (Sanskrit-Wörterbuch der buddhistischen Texte aus den Turfan-Funden, Beiheft 6), p. 261].",
  "S10nagsu_pu:123": "II. Appendix",
  "S10nagsu_pu:124": "The first part of the appendix has been adapted from the Petrovsky MS which is the only extant MS that preserves,",
  "S10nagsu_pu:125": "almost entirely,",
  "S10nagsu_pu:126": "that part of the appendix not found in the Pelliot/",
  "S10nagsu_pu:127": "Stein MS. Because our reconstruction of the canonical text and appendix is intended to represent a single MS tradition (as reunited from the London and Paris collections)",
  "S10nagsu_pu:128": ", the section of the Petrovsky MS that has been used to reconstruct the appendix has been given in bold. The paragraphing is more or less arbitrary.",
  "S10nagsu_pu:129_0": "NagSū II.1 pratyupasthitasya punar nagaropamasya vyākaraṇasya brahmā sanatkumāro",
  "S10nagsu_pu:129_1": "'tikrāntavarṇaḥ atikrāntāyāṃ rātryāṃ yena bhagavāṃs tenopagāma upetya bhagavatpād",
  "S10nagsu_pu:129_2": "au śirasā vanditvā ekānte asthād ekāntasthitaḥ brahmā sanatkumāro bhagavataḥ purataḥ gāthāṃ babhāṣe //",
  "S10nagsu_pu:130": "aho vidyā mahāvidyā kleśaviṣapraghātanī",
  "S10nagsu_pu:131": "bhāṣitaṃ te mahāvīra bhūteṣu hy anukampakaḥ",
  "S10nagsu_pu:132": "pratyupasthitasya:",
  "S10nagsu_pu:133": "This reconstruction is tentative since we have no way to determine the akṣara(s)",
  "S10nagsu_pu:134": "immediately preceding upasthitasya in Pet. 2r2. In the beginning of this line about seven more akṣaras are missing,",
  "S10nagsu_pu:135": "but at least the first six almost certainly belong to the end of the canonical text. SHT 179 gives a different transition between the canonical text and the appendix:",
  "S10nagsu_pu:136": "... samyaksuprakāśitam samanantaraparyāvasitasya vyakaraṇasya nagaropamam ity adhivacanam // //",
  "S10nagsu_pu:138": "atha brahma sanatkumāro ...",
  "S10nagsu_pu:139_0": "NagSū II.2 asti māriṣa purastimāyāṃ diśi dve mahārākṣasi prativasataś candraprabhā",
  "S10nagsu_pu:139_1": "nāma sūryaprabhā ca .. sahasraparivāre te mānuṣikāṃ prajāṃ rakṣāṃ guptiṃ balaṃ phāṣaṃ",
  "S10nagsu_pu:139_2": "sukhasparśavihāratāyai paripālayataḥ pathagatā apy utpathagatā api ārāmagatā api",
  "S10nagsu_pu:139_3": "śunyāgāragatā api catasraḥ pariṣado bhikṣur bhikṣuṇī upāsakā upāsikās tadanyāṃś ca",
  "S10nagsu_pu:139_4": "manuṣyāṃs tatreme mantrapadā bhavanti yena teṣām ākarṣaṇaṃ bhavati tadyathā",
  "S10nagsu_pu:140": "vaḍa : saraḍa :",
  "S10nagsu_pu:141": "cappuṣa : śaraṅgulī",
  "S10nagsu_pu:142": "phāṣaṃ sukhasparśavihāratāyai: SHT 176,",
  "S10nagsu_pu:143_0": "fol. 20v3 21r2 reads phāṣasukhasparśavihāratāyāṃ paripālayaṃti pathagatenāpi utpathagatenāpi",
  "S10nagsu_pu:143_1": "ārāmagatenāpi śuṇyāgāragatenāpi caturṇāṃ pariṣadāṃ bhikṣuṇāṃ bhikṣuṇīnām upāsakānām",
  "S10nagsu_pu:143_2": "upāsikānāṃ tadanyeṣāṃ ca manuṣyāṇāṃ. cappuṣa: SHT 176,",
  "S10nagsu_pu:144": "fol.21r4 reads capuṭa.",
  "S10nagsu_pu:145": "NagSū II.3 kariṣye māriṣa imasya nagaropamasya vyākaraṇasya siddhiṃ rakṣaṃ bandhaṃ parigraham ─ tadyathā",
  "S10nagsu_pu:146": "purime ─ kapphe ─ parumele ─ rimele ─ parāpare ─ purāpure ─ kukumati kṣīramati ─",
  "S10nagsu_pu:147_0": "kururu ─ mururu ─ kurarā ─ murarā ─ kānti oṣṭrāpāli ─ ghori gandhāri ─ sopakke ─",
  "S10nagsu_pu:147_1": "capaphari + + + + + purāpuri ─ eṇe ─ meṇe ─ dapphe ─ daḍapphe ─ alasāpati ─ padumāpati kumudāpati svāha //",
  "S10nagsu_pu:148": "capaphari: It is unclear how many akṣaras are missing at this point. SHT 176,",
  "S10nagsu_pu:149": "fol. 21v2 5 reads these mantrapadas as follows:",
  "S10nagsu_pu:150_0": "purime ─ kappe ─ parumele ─ rimele ─ parāpure purāpure ─ kukūmati ─ kṣīramati ─ kururu",
  "S10nagsu_pu:150_1": "─ mururu ─ kururā mururā ─ kānti ─ oṣṭraṣāli ─ ghori gandhāri cori caṇḍāli ─ saupakke ─ capaphari ─ ;",
  "S10nagsu_pu:151": "P.S. Bleu 129ry adds an interlinear insertion below ghori:",
  "S10nagsu_pu:152": "cori caṇḍali mā de .. ..;",
  "S10nagsu_pu:153": "cf. also Āṭānāṭikasūtra (Hoffmann ed.,",
  "S10nagsu_pu:154": "Bruchstücke des Āṭānāṭikasūtra aus dem zentralasiatischen Sanskritkanon der Buddhisten,",
  "S10nagsu_pu:155": "Leipzig 1939; repr. with supplement by L. Sander, Stuttgart 1987)",
  "S10nagsu_pu:156": ", 33ff. and the Bhadrakarātriyasūtra,",
  "S10nagsu_pu:157": "frag. 3b5 in S.F. Oldenburg,",
  "S10nagsu_pu:158": "“Otryvki kashgarskikh sanskritskikh rukopisey iz sobraniya N.F. Petrovskogo, III,” ZVOIRAO XV (1902 1903): 0116.",
  "S10nagsu_pu:159": "NagSū II.4 āgamiṣyati māriṣa māraḥ pāpīyāṃs tasya purata ime mantrapadā bhāṣitavyaḥ",
  "S10nagsu_pu:160": "buddha śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭhas tathāgatāt",
  "S10nagsu_pu:161": "buddho hi śreṣṭho lokasya dharmarājo hy anuttaraḥ ─",
  "S10nagsu_pu:162": "dharma śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭho 'tra dharmataḥ",
  "S10nagsu_pu:163": "dharmo hi śreṣṭho lokasya virāgopaśamaḥ sukham ─",
  "S10nagsu_pu:164": "saṃgha śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭho 'tra saṃghataḥ",
  "S10nagsu_pu:165": "saṃgho hi śreṣṭho lokasya puṇyakṣetro hy anuttaraḥ //",
  "S10nagsu_pu:166_0": "NagSū II.5 atha punar māriṣa nagaropamaṃ vyākaraṇam vipaśyinaḥ tathāgatasyārhataḥ",
  "S10nagsu_pu:166_1": "samyaksaṃbuddhasya dharmadvāro nāma vyākaraṇaṃ babhūva ─ kanakamunes tathāgatasyārhataḥ",
  "S10nagsu_pu:166_2": "samyaksaṃbuddhasya api dharmadvāro nāma vyākaraṇaṃ babhūva ─ kāśyapasya tathāgatasyārhataḥ",
  "S10nagsu_pu:166_3": "samyaksaṃbuddhasya api dharmadvāro nāma vyākaraṇaṃ babhūva ─",
  "S10nagsu_pu:167_0": "NagSū II.6 bhagavataḥ punar etarhi śākyamunes tathāgatasyārhataḥ samyaksaṃbuddhasya",
  "S10nagsu_pu:167_1": "jarāmaraṇajñāne yathābhūtam abhisaṃbodhāt jarāmaraṇasamudayajñāne jarāmaraṇanirodhajñāne",
  "S10nagsu_pu:167_2": "jarāmaraṇanirodhagāminīpratipajjñāne yathābhūtam abhisaṃbodhāt evaṃ jātir bhavam",
  "S10nagsu_pu:167_3": "upādānaṃ tṛṣṇā vedanā sparśaḥ ṣaḍāyatanaṃ nāmarūpaṃ vijñānaṃ saṃskārajñāne yathābhūtam",
  "S10nagsu_pu:167_4": "abhisaṃbodhāt saṃskārasamudayajñāne saṃskāranirodhajñāne saṃskāranirodhagāminīpratipajjñāne",
  "S10nagsu_pu:167_5": "yathābhūtam abhisaṃbodhāt .. .. .. .. p. .. rmā .i .. .. .. + + + + + + + + + + +",
  "S10nagsu_pu:167_6": "..t nagaropamaṃ vyākaraṇaṃ",
  "S10nagsu_pu:168": "pratipajjñāne: SHT 154,",
  "S10nagsu_pu:169": "fragm. ev1 reads -pratipadajñāne (for -pratipadājñāne)",
  "S10nagsu_pu:170": ". evaṃ jātir bhavam: SHT 154,",
  "S10nagsu_pu:171": "frags. d and e preserve a fully elaborated version of this passage,",
  "S10nagsu_pu:172": "repeating the complete formula for each member of the pratītyasamutpāda.",
  "S10nagsu_pu:173": "NagSū II.7 tasmād asya vyākaraṇasya + + + + + + + + + + .. dharmasaṃbodho nagaropamam ity adhivacanam",
  "S10nagsu_pu:174_0": "NagSū II.8 asmiṃ khalu nagaropame vyākaraṇe bhāṣyamāṇe ayaṃ trisahasramahāsahasro",
  "S10nagsu_pu:174_1": "lokadhātus tṛkṛtvā kampitaḥ saṃkampitaḥ saṃprakaṃpitaḥ kṣubhitaḥ saṃkṣubhitaḥ saṃprakṣubhitaḥ",
  "S10nagsu_pu:174_2": "vyathitas saṃvyathitaḥ saṃpravyathitaḥ calitaḥ saṃcalitaḥ saṃpracalitaḥ",
  "S10nagsu_pu:175": "Pet. 5v4 5 reads in a somewhat different order:",
  "S10nagsu_pu:176": "saṃkampitaḥ saṃprakampitaḥ calitaḥ saṃcalitaḥ saṃpracalitaḥ vyathitaḥ saṃvyathitaḥ (5v5)",
  "S10nagsu_pu:177": "saṃpravyathitaḥ kṣubhitaḥ saṃkṣubhitaḥ saṃprakṣubhitaḥ.",
  "S10nagsu_pu:178_0": "NagSū II.9 tasmāt tarhi māriṣa idaṃ nagaropamaṃ vyākaraṇaṃ bhikṣūṇāṃ śāstāram evānumantavyaṃ",
  "S10nagsu_pu:178_1": "satkarttavyaṃ gurukartavyaṃ mānayitavyaṃ pūjayitavyaṃ upaniḥśṛtya vihartavyaṃ bhikṣūṇāṃ",
  "S10nagsu_pu:178_2": "bhikṣuṇīnām upāsakānām upāsikānāṃ devānāṃ nāgānāṃ yakṣāṇāṃ rākṣasānāṃ pretānāṃ kumbhāṇḍānāṃ",
  "S10nagsu_pu:178_3": "piśācānāṃ idaṃ vyākaraṇaṃ śāstāram evānumantavyaṃ satkartavyaṃ gurukartavyaṃ mānayitavyaṃ",
  "S10nagsu_pu:178_4": "pūjayitavyaṃ upaniḥśṛtya vihartavyam",
  "S10nagsu_pu:179_0": "NagSū II.10 idaṃ ca punar māriṣa nagaropamaṃ vyākaraṇaṃ kāmāvacarair devaiḥ koṭinayutaśatasahasrair",
  "S10nagsu_pu:179_1": "bhāṣitaṃ cābhyanumoditaṃ cāṣṭāviṃśatibhir yakṣasenāpatibhir bhāṣitaṃ cābhyanumoditaṃ",
  "S10nagsu_pu:179_2": "ca caturbhiś ca mahārājābhir bhāṣitaṃ cābhyanumoditaṃ ca śakreṇa devendreṇa bhāṣitaṃ",
  "S10nagsu_pu:179_3": "cābhyanumoditaṃ ca brāhmaṇaḥ-sabhāpatinā bhāṣitaṃ cābhyanumoditaṃ ca śuddhāvasair",
  "S10nagsu_pu:179_4": "devaiḥ koṭinayutaśatasahasrair bhāṣitaṃ cābhyanumoditaṃ ca atītaiś ca nadīgaṅgavālukāprākhyais",
  "S10nagsu_pu:179_5": "tathāgatair arahadbhiḥ samyaksaṃbuddhair bhāṣitaṃ anāgatā api nadīgaṅgavālukāprākhyās",
  "S10nagsu_pu:179_6": "tathāgatā arhaṃtaḥ samyaksaṃbuddhā bhāṣiṣyanti bhagavān apy etarhi pratyutpanne dhvani",
  "S10nagsu_pu:179_7": "tathāgato 'rhaṃ samyaksaṃbuddho bhāṣitavān",
  "S10nagsu_pu:180": "brāhmaṇaḥ-sabhāpatinā: SHT 176,",
  "S10nagsu_pu:181": "fol. 30r3 reads brahmā sabhāpatinā. śuddhāvasair: Pet. 4v3 and SHT 176,",
  "S10nagsu_pu:182": "fol. 30r4 read śuddhāvasaiś ca. nadīgaṅgavālukāprākhyais: SHT 176,",
  "S10nagsu_pu:183": "fol. 30v1 reads -vālika-.",
  "S10nagsu_pu:184_0": "NagSū II.11 yaḥ kaścin māriṣa idaṃ vyākaraṇaṃ uddekṣyati dhārayiṣyati grāhayiṣyati",
  "S10nagsu_pu:184_1": "vācayiṣyati svādhyāyiṣyati paryavāpsyati manasikariṣyati saḥ ahinā na daṃkṣyati viṣaṃ",
  "S10nagsu_pu:184_2": "kāye na tariṣyati śastraṃ na kramiṣyati nodakena kālaṃ kariṣyati agninā na daṅkṣyati",
  "S10nagsu_pu:184_3": "rājāno 'pi na prasahīṣyaṃti corā na muṣiṣyaṃti rājakulamadhyagato 'pi svastinottariṣyati",
  "S10nagsu_pu:184_4": "gāḍhabandhanabaddho 'pi mokṣyati āsannāsamāgato 'pi abhyavakāśagato bhaviṣyati sarve",
  "S10nagsu_pu:184_5": "ca kṛtyakākhordamantravetāḍa prativigamiṣyaṃti sarve ca bhūtagaṇā na viheṭhayiṣyaṃti",
  "S10nagsu_pu:184_6": "anyatra pūrvakeṇa karmaṇā idaṃ viditvā brahmā sanatkumāro bhagavatpādau śirasā vanditvā",
  "S10nagsu_pu:184_7": "bhagavantaṃ tṛpradakṣiṇīkṛtvā tatraivāntarhitaḥ //",
  "S10nagsu_pu:185": "daṃkṣyati: SHT 1275r5 reads daśyiṣyati;",
  "S10nagsu_pu:186": "cf. also SHT 906, frag. c (fol. 21)",
  "S10nagsu_pu:187": "r6: daśiṣyati. daṅkṣyati:",
  "S10nagsu_pu:188": "Pet. 6r3 reads dhaṃkṣyati. viditvā:",
  "S10nagsu_pu:189": "Pet. 6v1 reads vaditvā which must be the correct reading.",
  "S10nagsu_pu:190_0": "NagSū II.12 atha catvāro mahārājānaḥ atikrāntavarṇā abhikrāntāyāṃ rātryāṃ yena bhagavāṃs",
  "S10nagsu_pu:190_1": "tenopajagmur upetya bhagavatpādau śirasā vanditvā yathā svakasvakāṃ diśaṃ niḥśṛtya",
  "S10nagsu_pu:190_2": "ekānte tasthūr ekāntasthitaḥ",
  "S10nagsu_pu:191": "tasthūr: read tasthur",
  "S10nagsu_pu:192": "NagSū II.13 atha purastimāyāṃ diśaṃ niḥśṛtya dhṛtirāṣṭro mahārājā yena bhagavāṃs tenāṃjaliṃ praṇamya bhagavantaṃ gāthayā abhyabhāṣat",
  "S10nagsu_pu:193": "aho vidyā mahāvidyā kleśaviṣapraghātanī",
  "S10nagsu_pu:194": "bhāṣitā te mahāvīra nirjvarā jvaranāśanī ─",
  "S10nagsu_pu:195": "diśaṃ: SHT 875r3 reads purastimāṃ diśi. jvaranāśanī:",
  "S10nagsu_pu:196": "SHT 875v2 3 reads jvaraśāminī :.",
  "S10nagsu_pu:197_0": "NagSū II.14 asti māriṣā purastimāyāṃ diśāyāṃ dve mahārākṣasi prativasataḥ sugriṇī",
  "S10nagsu_pu:197_1": "nāma vasugriṇī ca paṃcasahasraparivāre te mānuṣikāṃ prajāṃ rakṣāṃ guptiṃ balaṃ phāṣaṃ",
  "S10nagsu_pu:197_2": "sukhasparśavihāratāyai paripālayataḥ pathagatā api utpathagatā api ārāmagatā api",
  "S10nagsu_pu:197_3": "śuṇyāgāragatā api catasraḥ pariṣado bhikṣūṇāṃ bhikṣuṇīnāṃ upāsakānāṃ upāsikānāṃs",
  "S10nagsu_pu:197_4": "tadanyaṃś ca manuṣyāṇāṃ tatreme maṃtrapadā bhavanti yena teṣām ākarṣaṇaṃ bhavati tadyathā",
  "S10nagsu_pu:198": "vijini vijini ─ saṃskṛni ─ vijñini vijñini ─ kṣīramati kulamati //",
  "S10nagsu_pu:199": "phala + + .. .. .. .e .. rāpure ─ ene mene ─ dapphe daḍapphe ─ alasāpati ─ padumāpati kumudāpati svāhā ─ //",
  "S10nagsu_pu:200": "diśāyāṃ: Cf. SHT 875v4 and elsewhere in P.S. Bleu 434 (fol. 129r6, 129v4, etc.)",
  "S10nagsu_pu:201": "; P.S. Petits frags. 340+606rw reads diśi.",
  "S10nagsu_pu:202": "NagSū II.15 āgamiṣyati māriṣa māraḥ pāpīyāṃs tasya purataḥ ime mantrapadā bhāṣitavyaḥ",
  "S10nagsu_pu:203": "buddha śreṣṭho na śreṣṭhas tvaṃ pūrvavat vistareṇa trayaḥ ślokaḥ 3",
  "S10nagsu_pu:204": "NagSū II.16 yaḥ kaścin māriṣa idaṃ nagaropamaṃ vyākaraṇaṃ uddekṣyati dhārayiṣyati pūrvavad yāvad anyatra pūrvakena karmaṇā //",
  "S10nagsu_pu:205": "NagSū II.17 atha dakṣiṇān diśaṃ niḥśṛtya virūḍhako mahārājā yena bhagavāṃs tenāṃjaliṃ praṇamya bhagavaṃtaṃ gāthayā abhyabhāṣat",
  "S10nagsu_pu:206": "aho vidyā mahāvidyā kleśaviṣapraghātanī",
  "S10nagsu_pu:207": "bhāṣitā te mahāvīra nirjvarā jvaranāśanī ─",
  "S10nagsu_pu:208": "virūḍhako: P.S. Petits frag. 1365vb starts here. At 1365vb we find kumbh.ṇḍ. cf. Ārya-Mahā-Māyūrī Vidyā-Rājñī (Shūyo Takubo ed.)",
  "S10nagsu_pu:209": ", 16.6: dakṣiṇāyām Ānanda diśāyāṃ Virūḍhako nāma kumbhāṇḍamahārājā prativasati sma.",
  "S10nagsu_pu:210_0": "NagSū II.18 asti māriṣā dakṣiṇāyāṃ diśāyāṃ dve mahārākṣasi prativasataḥ caṇḍinī nāma",
  "S10nagsu_pu:210_1": "upacaṇḍinī ca paṃcasahasraparivāre te mānuṣikāṃ prajāṃ pūrvavad yāvat tatreme mantrapadā",
  "S10nagsu_pu:210_2": "bhavanti yena teṣām ākarṣaṇaṃ bhavati tadyathā",
  "S10nagsu_pu:211": "nāmini ─ nāmini ─ ṣaḍini ṣaḍini ─ sparśini sparśini svāhā //",
  "S10nagsu_pu:212": "svāhā //: Mac. 1.5 continues with what was surely part of this formulaic text:",
  "S10nagsu_pu:213": "āgamiṣyati māriṣa māraḥ pāpīyāṃ(1.6)",
  "S10nagsu_pu:214": "s tasya purata ime mantrapadā bhāṣitavyāḥ buddhaḥ śreṣṭho na śreṣṭhas tvaṃ pūrvavad yāvad anyatra pūrva(2.1)",
  "S10nagsu_pu:215": "keṇa karmaṇā //",
  "S10nagsu_pu:216": ". SHT 906, frag. c (fol. 21) and SHT 909,",
  "S10nagsu_pu:217": "frag. b both appear to include not only the text as represented in the Mac. MS,",
  "S10nagsu_pu:218": "but a fully elaborated version thereof (i.e. without the abbreviation pūrvavad yāvad).",
  "S10nagsu_pu:219": "NagSū II.19 atha paścimāyāṃ diśaṃ niḥśṛtya virūpākṣo mahārājā yena bhagavāṃs tenāṃjaliṃ praṇamya bhagavantaṃ gāthayā abhyabhāṣat //",
  "S10nagsu_pu:220": "aho vidyā mahāvidyā kleśaviṣapraghātanī",
  "S10nagsu_pu:221": "bhāṣitā te mahāvīra nirjvarā jvaranāśanī ─",
  "S10nagsu_pu:222_0": "NagSū II.20 asti māriṣa paścimāyāṃ diśāyāṃ dve mahārākṣasi prativasataḥ dṛśyā nāma",
  "S10nagsu_pu:222_1": "mahādṛśyā ca paṃcasahasraparivāre te mānuṣikāṃ prajāṃ rakṣāṃ guptiṃ balaṃ phāṣaṃ",
  "S10nagsu_pu:222_2": "sukhasparśavihāratayai pūrvavad yāvat tatreme mantrapadā bhavanti yena teṣām ākarṣaṇaṃ bhavati tadyathā",
  "S10nagsu_pu:223": "vedini ─ vedini ─ tṛṣṇini ─ tṛṣṇini ─ upādini ─ svāhā //",
  "S10nagsu_pu:224": "diśāyāṃ: Mac. 2.3 reads diśi. vedini: SHT 905, frag. a (fol. 28)",
  "S10nagsu_pu:225": "r.1 2 appears to have two more mantrapadas preceding this one:",
  "S10nagsu_pu:226": "1 svāha ─ kuśi ─ kuśikesari ///",
  "S10nagsu_pu:227": "; 2 la mālinī svāha ─ tadya + / / /",
  "S10nagsu_pu:230": ". upādini: SHT 905, frag. a (fol. 28)",
  "S10nagsu_pu:231": "r3 reads upādānini.",
  "S10nagsu_pu:232": "NagSū II.21 āgamiṣyati māriṣa māraḥ pāpīyāṃs tasya purata ime maṃtrapadā bhāṣitavyaḥ",
  "S10nagsu_pu:233": "buddha śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭhas tathāgataḥ pūrvavad yāvad anyatra pūrvakeṇa karmaṇā //",
  "S10nagsu_pu:234": "pūrvavad yāvad: SHT 905, frag. a (fol. 28)",
  "S10nagsu_pu:235": "r4ff. preserves a fully elaborated text (i.e. without the abbreviation).",
  "S10nagsu_pu:236": "NagSū II.22 athottarāyāṃ diśi niḥśṛtya vaiśravaṇo mahārājā :",
  "S10nagsu_pu:237": "yena bhagavāṃs tenāṃjaliṃ praṇamya bhagavantaṃ gāthayā abhyabhāṣat",
  "S10nagsu_pu:238": "aho vidyā mahāvidyā kleśaviṣapraghātanī",
  "S10nagsu_pu:239": "bhāṣitā te mahāvīra nirjvarā jvaranāśanī",
  "S10nagsu_pu:240": "athottarāyāṃ:",
  "S10nagsu_pu:241": "Mac. 3.2 reads athottarān.",
  "S10nagsu_pu:242_0": "NagSū II.23 santi māriṣa uttarāyān diśi bhaumā yakṣāḥ anekayakṣasahasrāḥ parivāra",
  "S10nagsu_pu:242_1": "prativasaṃti te mānuṣikāṃ prajāṃ rakṣāṃ guptiṃ balaṃ phāṣaṃ sukhasparśavihāratāyai",
  "S10nagsu_pu:242_2": "paripālayanti ─ pathagatā api utpathagatā api ārāmagatā api śunyāgāragatā api catasraḥ",
  "S10nagsu_pu:242_3": "pariṣado bhikṣūṇāṃ bhikṣuṇīnāṃ upāsakānāṃ upāsikānāṃs tadanyāṃś ca manuṣyāṇāṃ tatreme",
  "S10nagsu_pu:242_4": "maṃtrapadā bhavaṃti yena teṣām ākarṣaṇaṃ bhavati tadyathā",
  "S10nagsu_pu:243": "bhāvini bhāvini ─ jātini ─ jātini ─ maraṇi ─ maraṇi ─ svāhā //",
  "S10nagsu_pu:244": "anekayakṣasahasrāḥ:",
  "S10nagsu_pu:245": "Mac. 3.5 reads anekasahasrāḥ. manuṣyāṇāṃ:",
  "S10nagsu_pu:246": "Mac. 4.2 reads bhikṣuṇī upāsakā upāsikās tadanyāś ca manuṣyāṃ. tatreme: SHT 909, frag. a (fol. 61)",
  "S10nagsu_pu:247": "r1 starts here and reads rakṣāṃ bhavatu paritraṃ parigrahaṃ paripālanam tatreme. bhāvini: SHT 905, frag. b (fol. 30)",
  "S10nagsu_pu:248": "v1 2 has some mantrapadas preceding:",
  "S10nagsu_pu:249": "1 tadyathā ha + + + ///",
  "S10nagsu_pu:250": "; 2 ri ─ riraṃsav. + + / //.",
  "S10nagsu_pu:252": "NagSū II.24 āgamiṣyati māriṣa māraḥ pāpīyāṃs tasya purata ime mantrapadā bhāṣitavyaḥ",
  "S10nagsu_pu:253": "buddha śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭhas tathāgatāt",
  "S10nagsu_pu:254": "buddho hi śreṣṭho lokasya dharmarājo hy anuttaraḥ ─",
  "S10nagsu_pu:255": "dharma śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭho 'tra dharmataḥ",
  "S10nagsu_pu:256": "dharmo hi śreṣṭho lokasya virāgopaśamaḥ sukham",
  "S10nagsu_pu:257": "saṃgha śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭho 'tra saṃghataḥ",
  "S10nagsu_pu:258": "saṃgho hi śreṣṭho lokasya puṇyakṣetro hy anuttara 3",
  "S10nagsu_pu:259": "ime mantrapadā: SHT 909, frag. a (fol. 61)",
  "S10nagsu_pu:260": "r3 reads mantrā. tathāgatāt:",
  "S10nagsu_pu:261": "Mac. 4.5 reads nāsti buddhena śreṣṭhataḥ; SHT 909, frag. a (fol. 61)",
  "S10nagsu_pu:262": "r3 5 reads nāsti buddhen.;",
  "S10nagsu_pu:263": "cf. SHT 905, frag. a (fol. 28)",
  "S10nagsu_pu:264": "r5; 906, frag. c (fol. 21)",
  "S10nagsu_pu:265": "r2. dharmataḥ: SHT 909, frag. a (fol. 61)",
  "S10nagsu_pu:266": "r4 reads nāsti dharmeṇa śreṣṭhata ─. virāgopaśamaḥ:",
  "S10nagsu_pu:267": "Mac. 5.1 and SHT 909, frag. a (fol. 61)",
  "S10nagsu_pu:268": "r5 read virāgopaśamaṃ. saṃghataḥ: SHT 909, frag. a (fol. 61)",
  "S10nagsu_pu:269": "r5 reads nāsti saṅghena śreṣṭhat..",
  "S10nagsu_pu:270_0": "NagSū II.25 yaḥ kaścin māriṣa idaṃ nagaropamaṃ vyākaraṇaṃ uddekṣyati dhārayiṣyati",
  "S10nagsu_pu:270_1": "grāhayiṣyati vācayiṣyati svādhyāyiṣyati paryavāpsyati manasikariṣyati sa ahinā na",
  "S10nagsu_pu:270_2": "daṃkṣyati viṣaṃ kāye na tariṣyati ─ śastraṃ na kramiṣyati ─ nodakena kālaṃ kariṣyati",
  "S10nagsu_pu:270_3": "agninā na dhakṣyati rājāno 'pi na prasahiṣyaṃti corā na muṣiṣyaṃti ─ rājakulamadhyagato",
  "S10nagsu_pu:270_4": "'pi svastinottariṣyati ─ gāḍhabandhanabaddho 'pi mucciṣyati āsannasamāgato 'pi ─",
  "S10nagsu_pu:270_5": "abhyavakāśagato bhaviṣyati :",
  "S10nagsu_pu:271": "sarve ca kṛtyakākhordamantravetāḍa prativigamiṣyaṃti sarve ca bhūtagaṇā na viheṭhayiṣyaṃti anyatra pūrvakeṇa karmaṇā //",
  "S10nagsu_pu:272": "sa ahinā: SHT 909, frag. a (fol. 61)",
  "S10nagsu_pu:273": "v2 reads tasyāhinā. mucciṣyati:",
  "S10nagsu_pu:274": "Mac. 6.1 reads mokṣyati. kṛtyakākhordamantravetāḍa:",
  "S10nagsu_pu:275": "Mac. 6.2 reads k.kkhorda-; SHT 909, frag. a (fol. 61)",
  "S10nagsu_pu:276": "v5 reads kakkhor.;",
  "S10nagsu_pu:277": "SHT 1675r3 reads kākkhorda-.",
  "S10nagsu_pu:278": "NagSū II.26 atha catvāro mahārājānaḥ yena bhagavāṃs tenāṃjaliṃ praṇamya bhagavantam idam avocat",
  "S10nagsu_pu:279": "aho subhāṣitā vidyā śākyasiṃhena dhīmatā ─",
  "S10nagsu_pu:280": "dvādaśāṅgasamāyuktā sarvabhūtanivāraṇī",
  "S10nagsu_pu:281": "sarve devā nāgā yakṣā pretā kuṃbhāṇḍā kāḍapūtanā",
  "S10nagsu_pu:282": "yo ime atikramen maṃtrāṃ mahārājñā mukhanirgatām",
  "S10nagsu_pu:283": "saptadhāsya sphalen mūrdhā daśadhā hṛdayaṃ sphalet",
  "S10nagsu_pu:284": "idam avocat:",
  "S10nagsu_pu:285": "Although the MS clearly reads avocat,",
  "S10nagsu_pu:286": "we would expect an aor.pl. here:",
  "S10nagsu_pu:287": "avocan. kāḍapūtanā:",
  "S10nagsu_pu:288": "Mac. 6.6 reads kādapūtanā;",
  "S10nagsu_pu:289": "SHT 971v2 reads kaṭapuṭaḥ. yo ime:",
  "S10nagsu_pu:290": "unmetrical/",
  "S10nagsu_pu:291": "Mac. 6.6 reads: me [dativus ethicus]. mukhanirgatām:",
  "S10nagsu_pu:292": "SHT 1675v1 reads mahārājamukhanirgatām. sphalet:",
  "S10nagsu_pu:293": "SHT 971v3 reads saptadhāsya phalen murddhna dāśata hṛtayaṃ // /",
  "S10nagsu_pu:295": "; Mac. 7.1 reads hṛdayaṃ phalet and in SHT 1675v2 is preserved yaṃ phale.",
  "S10nagsu_pu:296": "NagSū II.27 idaṃ vaditvā catvāro mahārājāno bhagavatpādau śirasā vanditvā bhagavantaṃ tṛpradakṣiṇīkṛtvā tatraivāntarhita",
  "S10nagsu_pu:297_0": "NagSū II.28 atha bhagavāṃs tasyā eva rātryā atyayāt purastād bhikṣusaṃghasya prajñapta",
  "S10nagsu_pu:297_1": "evāsane nyaṣīdat niṣadya bhagavāṃ bhikṣūn āmantrayati ─ yathādya bhikṣavo brahmā",
  "S10nagsu_pu:297_2": "sanatkumāro 'tikrāntavarṇaḥ abhikrāntāyāṃ rātryāṃ yenāhaṃ tenopasaṃkrantaḥ upetya",
  "S10nagsu_pu:297_3": "mama pādau śirasā vanditvā ekānte asthād ekāntasthitaḥ brahmā sanatkumāro mama purato gāthāṃ babhāṣe",
  "S10nagsu_pu:298": "aho vidyā mahāvidyā pūrvavad yāvad",
  "S10nagsu_pu:299": "NagSū II.29 idaṃ vaditvā brahmā sanatkumāro mama pādau śirasā vanditvā māṃ tṛḥ pradakṣiṇīṃ kṛtvā tatraivāntarhitaḥ",
  "S10nagsu_pu:300_0": "NagSū II.30 atha catvāro mahārājāno 'tikrāntavarṇā abhikrāntāyāṃ rātryāṃ yenāhaṃ",
  "S10nagsu_pu:300_1": "tenopasaṃkrānta upetya mama pādau śirasā vanditvā yathā svakāṃ niḥśṛtya ekānte tasthur",
  "S10nagsu_pu:300_2": "ekāntasthita pūrvavad yāvad",
  "S10nagsu_pu:301": "tenopasaṃkrānta:",
  "S10nagsu_pu:302": "read -krāntā. yathā svakāṃ:",
  "S10nagsu_pu:303": "Mac 8.4 reads svakasva .. .. śiṃ; cf. NagSū II.12:",
  "S10nagsu_pu:304": "yathā svakasvakāṃ diśaṃ niśṛtya. ekāntasthita:",
  "S10nagsu_pu:305": "read -sthitā.",
  "S10nagsu_pu:306_0": "NagSū II.31 idaṃ vaditvā catvāro mahārājāno mama pādau śirasā vanditvā māṃ tṛḥ pradakṣiṇīkṛtvā",
  "S10nagsu_pu:306_1": "tatraivāntarhitāḥ udgṛhṇata bhikṣavo nagaropamaṃ vyākaraṇaṃ dhārayata grāhayata vācayata",
  "S10nagsu_pu:306_2": "paryavāpnuta manasikuruta tat kasmād dheto arthopasaṃhitaṃ nagaropamaṃ vyākaraṇaṃ",
  "S10nagsu_pu:306_3": "dharmopasaṃhitaṃ ādibrahmacaryasyābhijñāyai saṃbodhaye nirvāṇāya saṃvartate ─",
  "S10nagsu_pu:307": "vācayata: Mac. 9.1 reads svadhyāyata.",
  "S10nagsu_pu:308_0": "NagSū II.32 atha ca punaḥ kulaputreṇa śraddhāpravrajitena śraddhayā agārād anagārikaṃ",
  "S10nagsu_pu:308_1": "pravrajitvā nagaropamaṃ vyākaraṇaṃ sādhu ca suṣṭhu ca udgṛhṇitavyaṃ dhārayitavyaṃ",
  "S10nagsu_pu:308_2": "grāhayitavyaṃ vācayitavyaṃ svādhyāyitavyaṃ paryavāptavyaṃ manasīkartavyaṃ idam avocat //",
  "S10nagsu_pu:309": "avocat: The text in the Stein MS ends here but Mac. 9.6 gives the standard closing:",
  "S10nagsu_pu:310": "bhagavāṃ aptamanās (for āptamanasas)",
  "S10nagsu_pu:311": "te bhikṣavo bhagavato bhāṣitam abhyanandan.",
  "S10nagsu_pu:312": "nagaropamaṃ sūtraṃ samāptaḥ rakṣaṃ bhavatu pṛṣtagautamāya : //",
  "S10nagsu_pu:313": "pṛṣtagautamāya : //",
  "S10nagsu_pu:314": ": Mac. 10.1 has a colophon in Tocharian B:",
  "S10nagsu_pu:315": "nagaropam āra po solme paikāmai [End of Nagaropama(sūtra)",
  "S10nagsu_pu:316": ". I have written everything completely]. The authors would like to thank Dr. K.T. Schmidt (Saarbrücken)",
  "S10nagsu_pu:317": "for this restoration and translation."
}