{
    "sf238:0": "",
    "sf238:1": "",
    "sf238:2": "Pratītyasamutpādādivibhaṅganirdeśasūtram",
    "sf238:3": "",
    "sf238:4": "Evaṁ mayā śrutam: ekasmin samaye Bhagavān-Śrāvastyāṁ viharati sma, Jetavane Anāthapiṇḍadasyārāme, mahatā bhikṣusaṁghena sārdhamardhatrayodaśabhirbhikṣuśataiḥ.",
    "sf238:5": "Tatra Bhagavān-āmantrayate sma: “Pratītyasamutpādasya vo bhikṣavaḥ ādiṁ vo deśayiṣyāmi vibhaṅgaṁ ca, tac-chṛṇuta sādhu ca suṣṭhu ca manasikuruta, bhāṣiṣye.",
    "sf238:6": "“Pratītyasamutpādasya ādiḥ katamaḥ?",
    "sf238:7": "“Yad-uta asmin sati idaṁ bhavati, asyotpādādidam-utpadyate, yad-uta: avidyāpratyayāḥ saṁskārāḥ, saṁskārapratyayaṁ vijñānam, vijñānapratyayaṁ nāmarūpam, nāmarūpapratyayaṁ ṣaḍāyatanam, ṣaḍāyatanapratyayaḥ sparśaḥ, sparśapratyayā vedanā, vedanāpratyayā tṛṣṇā, tṛṣṇāpratyayam-upādānam, upādānapratyayo bhavaḥ, bhavapratyayā jātiḥ, jātipratyayā jarāmaraṇaśokaparidevaduḥkhadaurmanasyopāyāsāḥ saṁbhavanti, evam-asya kevalasya mahato duḥkhaskandhasya samudayo bhavati.",
    "sf238:8": "“Ayam-ucyate pratītyasamutpādasyādiḥ.",
    "sf238:9": "“Vibhaṅgaḥ katamaḥ?",
    "sf238:10": "“‘Avidyāpratyayāḥ saṁskārāḥ’ ityavidyā katamā? Yat pūrvānte ’jñānam, aparānte ’jñānam, pūrvāntāparānte ’jñānam, adhyātmam-ajñānam, bahirdhājñānam, adhyātmabahirdhājñānam, karmaṇyajñānam, vipāke ’jñānam, karmavipāke ’jñānam, Buddhe ’jñānam, Dharme ’jñānam, Saṁghe ’jñānam, duḥkhe ’jñānam, samudaye ’jñānam, nirodhe ’jñānam, mārge ’jñānam, hetāvajñānam, hetusamutpanneṣu dharmeṣvajñānam, kuśalākuśaleṣu sāvadyānavadyeṣu sevitavyāsevitavyeṣu, hīnapraṇītakṛṣṇaśuklasapratibhāgapratītyasamutpanneṣu dharmeṣvajñānam, ṣaṭsu vā punaḥ sparśāyataneṣu yathābhūtasaṁprativedhaḥ iti, yad-atra tatra yathābhūtasyājñānam, adarśanam, anabhisamayaḥ, tamaḥ, saṁmohaḥ, avidyāndhakāram. Iyam-ucyate ’vidyā.",
    "sf238:11": "“Saṁskārāḥ katame? Trayaḥ saṁskārāḥ: kāyasaṁskārāḥ vāksaṁskārāḥ manaḥsaṁskārā iti.",
    "sf238:12": "“‘Saṁskārapratyayaṁ vijñānam-iti’, vijñānaṁ katamat? Ṣaḍ vijñānakāyāḥ: cakṣurvijñānaṁ śrotraghrāṇajihvākāyamanovijñānam.",
    "sf238:13": "“‘Vijñānapratyayaṁ nāmarūpam-iti’, nāma katamat? Catvāra arūpiṇaḥ skandhāḥ. Katame catvāraḥ? Vedanāskandhaḥ saṁjñāskandhaḥ saṁskāraskandhaḥ vijñānaskandhaḥ. Rūpaṁ katamat? Yat kiṁcid-rūpam, sarvaṁ tat catvāri mahābhūtāni. Catvāri ca mahābhūtānyupādāya itīdaṁ ca rūpam. Tadaikadhyamabhisaṁkṣipya nāmarūpam-ityucyate.",
    "sf238:14": "“‘Nāmarūpapratyayaṁ ṣaḍāyatanam-iti’, ṣaḍāyatanaṁ katamat? Ṣaḍādhyātmikānyāyatanāni: cakṣurādhyātmikamāyatanaṁ, śrotaghrāṇajihvākāyamanaādhyātmikamāyatanam.",
    "sf238:15": "“‘Ṣaḍāyatanapratyayaḥ sparśa iti’ sparśaḥ katamaḥ? Ṣaṭ sparśakāyāḥ: cakṣuḥsaṁsparśaḥ, śrotraghrāṇajihvākāyamanaḥsaṁsparśaḥ.",
    "sf238:16": "“‘Sparśapratyayā vedaneti’ vedanā katamā? Tisro vedanāḥ: sukhā duḥkhā aduḥkhāsukhā ca.",
    "sf238:17": "“‘Vedanāpratyayā tṛṣṇeti’, tṛṣṇā katamā? Tisrastṛṣṇāḥ: kāmatṛṣṇā rūpatṛṣṇā arūpyatṛṣṇā ca.",
    "sf238:18": "“‘Tṛṣṇāpratyayamupādānamiti’ upādānaṁ katamat? Catvāryupādānāni: kāmopādānaṁ dṛṣṭyupādānaṁ, śīlavratopādānamātmavādopādānam.",
    "sf238:19": "“‘Upādānapratyayo bhava iti’ bhavaḥ katamaḥ? Trayo bhavāḥ: kāmabhavaḥ rūpabhavaḥ arūpyabhavaḥ.",
    "sf238:20": "“‘Bhavapratyayā jātir-iti’ jātiḥ katamā? Yā teṣāṁ teṣāṁ sattvānāṁ tasmiṁs-tasmin sattvanikāye jātiḥ saṁjātiravakrāntirabhinirvṛttiḥ prādurbhāvaḥ, skandhapratilambho dhātupratilambhaḥ, āyatanapratilambhaḥ skandhānām-abhinirvṛttiḥ jīvitendriyasya prādurbhāvaḥ.",
    "sf238:21": "“‘Jātipratyayaṁ jarāmaraṇam-iti’ jarā katamā? Yat-tat khālatyaṁ pālityaṁ valīpracuratā jīrṇatā bhugnatā, kubja-gopānasī-vaṅkatā tilakāla-kācita-gātratā, khulakhulapraśvāsakāyatā purataḥ prāgbhārakāyatā, daṇḍaviṣkambhaṇatā dhandhatvaṁ mandatvaḥ, hāniḥ parihāṇiḥ indriyāṇāṁ paripākaḥ, paribhedaḥ saṁskārāṇāṁ purāṇībhāvaḥ jarjarībhāvaḥ. Iyam-ucyate jarā. Maraṇaṁ katamat? Yā teṣāṁ teṣāṁ sattvānāṁ tasmāt-tasmāt sattvanikāyāt, cyutiḥ cyavanato bhedaḥ antarahāṇiḥ āyuṣo hāṇiḥ, uṣmaṇo hāṇiḥ jīvitendriyasya nirodhaḥ, skandhānāṁ nikṣepaḥ maraṇaṁ kālakriyā. Idam-ucyate maraṇam-iti. Idaṁ ca maraṇa pūrvikā ca jarā, tadubhayamaikadhyamabhisaṁkṣipya jarāmaraṇamityucyate.",
    "sf238:22": "“Ayam-ucyate pratītyasamutpādasya vibhaṅgaḥ.",
    "sf238:23": "“‘Pratītyasamutpādasyādiṁ vo deśayiṣyāmi iti vibhaṅgaṁ ca iti’ vo yad-uktam, tad-etat pratyuktam.”",
    "sf238:24": "IdamavocadBhagavān, āttamanasas-te bhikṣavo Bhagavato bhāṣitam-abhyanandan.",
    "sf238:25": "Pratītyasamutpādādivibhaṅganirdeśasūtraṁ Samāptam"
}