{
  "S01msudarsu:0": "MSuAv [1] (GBM 1451.8) // punar api mahārāja yan mayā anuttarāṃ samyaksaṃbodhiṃ prārthayatā satvahitaṃ (GBM 1550.1)",
  "S01msudarsu:1": "kṛtaṃ tac chrūyatāṃ.",
  "S01msudarsu:2": "MSuAv [2] bhūtapūrvaṃ mahārāja rājā babhūva mahāsudarśano nāma saptabhi ratnaiḥ samanvāgataḥ catasṛbhiś ca mānuṣikābhi riddhibhiḥ. katamaiḥ saptabhi ratnaiḥ, tadyathā (GBM 1550.2)",
  "S01msudarsu:3": "cakraratnena hastiratnenāśvaratnena maṇiratnena strīratnena gṛhapatiratnena pariṇāyakaratnena saptamena. katamābhiś catasṛbhiḥ mānuṣikābhi riddhibhiḥ samanvāgata, rājā (GBM 1550.3)",
  "S01msudarsu:4": "mahārāja mahāsudarśano dīrghāyur abhūc cirasthitikaḥ. sa caturaśītiṃ varṣasahasrāṇi kumārakrīḍāyāṃ krīḍitavāṃ,",
  "S01msudarsu:5": "caturaśītiṃ varṣasahasrāṇi yauvarājyaṃ kāritavāṃ, (GBM 1550.4)",
  "S01msudarsu:6": "caturaśītiṃ varṣasahasrāṇi mahārājyaṃ kāritavāṃ,",
  "S01msudarsu:7": "caturaśītiṃ varṣasahasrāṇi rājarṣibrahmacaryam acārṣīd. yan mahārāja rājā mahāsudarśano (GBM 1550.5)",
  "S01msudarsu:8": "dīrghāyur abhūc cirasthitikaś caturaśītiṃ varṣasahasrāṇi yāvad rājarṣibrahmacaryam acārṣī,",
  "S01msudarsu:9": "iyaṃ rājño mahāsudarśanasya riddhir ity ucyate.",
  "S01msudarsu:10": "MSuAv [3] punar aparaṃ mahārāja (GBM 1550.6)",
  "S01msudarsu:11_0": "rājā mahāsudarśano 'bhirūpo 'bhūd darśanīyaḥ prāsādikaḥ atikrāntaś ca mānuṣaṃ varṇam",
  "S01msudarsu:11_1": "asaṃprāptaś ca divyaṃ varṇaṃ. yan mahārāja rājā mahāsudarśano 'bhirūpo 'bhūd darśanīyaḥ (GBM 1550.7)",
  "S01msudarsu:12": "prāsādikaḥ atikrāntaś ca mānuṣaṃ varṇam asaṃprāptaś ca divyaṃ varṇaṃ,",
  "S01msudarsu:13": "iyaṃ rājño mahāsudarśanasya riddhir ity ucyate. //",
  "S01msudarsu:14": "MSuAv [4] punar aparaṃ mahārāja rājā mahāsudarśano 'lpābādho (GBM 1550.8)",
  "S01msudarsu:15": "'bhūd arogajātīyaḥ samapācanyā grahaṇyā samanvāgato nātyuṣṇayā nātiśītayā avyābādhayā ṛtusukhayā yayāsyāśitapītakhāditāsvāditāni samyak sukhena (GBM 1551.1)",
  "S01msudarsu:16": "paripākaṃ gacchanti yan mahārāja rājā mahāsudarśano 'lpābādho 'bhūd arogajātīyaḥ pūrvavad,",
  "S01msudarsu:17": "iyaṃ rājño mahāsudarśanasya riddhir ity ucyate. //",
  "S01msudarsu:18": "MSuAv [5] punar aparaṃ mahārāja rājā mahāsudarśano naigamajānapadānāṃ priyaś cābhūn",
  "S01msudarsu:19_0": "manāpaś ca (GBM 1551.2) tadyathā putrāṇāṃ pitā. rājño 'pi mahāsudarśanasya naigamajānapadā",
  "S01msudarsu:19_1": "priyaś cābhūvan manaāpaś ca tadyathā pituḥ putrāḥ. eko 'yaṃ mahārāja samayo rājā",
  "S01msudarsu:19_2": "mahāsudarśana (GBM 1551.3)",
  "S01msudarsu:20": "udyānabhūmiṃ niryān sārathim āmantrayate. śanais tāvat sārathe mandamandaṃ rathaṃ preraya yāvad ahaṃ ciracirā",
  "S01msudarsu:21": "naigamajānapadāṃ drakṣyāmi (sic;",
  "S01msudarsu:22": "Matsumura prakṣyāmi)",
  "S01msudarsu:23": ". naigamajānapadā api sārathim (GBM 1551.4)",
  "S01msudarsu:24": "āmantrayante. śanais tāvat sārathe mandamandaṃ rathaṃ preraya yāvad vayaṃ ciracirā devaṃ drakṣyāmaḥ (sic;",
  "S01msudarsu:25": "Matsumura prakṣyāmaḥ)",
  "S01msudarsu:26": ". yan mahārāja rājā mahāsudarśano naigamajānapadānāṃ priyaś (GBM 1551.5)",
  "S01msudarsu:27": "cābhūn manāpaś ca tadyathā putrāṇāṃ pitā rājño 'pi mahāsudarśanasya naigamajānapadāḥ priyaś cābhūvan manāpaś ca tadyathā pituḥ (sic;",
  "S01msudarsu:28": "Matsumura om.)",
  "S01msudarsu:29": "putrā, iyaṃ rajño mahāsudarśanasya (GBM 1551.6)",
  "S01msudarsu:30": "riddhir ity ucyate.",
  "S01msudarsu:31": "MSuAv [6] athāpareṇa samayena naigamajānapadāḥ prabhūtaṃ hiraṇyasuvarṇam ādāya maṇiratnaṃ kaṃbalaratnaṃ ca,",
  "S01msudarsu:32": "yena rājā mahāsudarśanas tenopasaṃkrāntā (GBM 1551.7)",
  "S01msudarsu:33": "upasaṃkramya rājānaṃ mahāsudarśanam idam avocan. idam asmābhir devam uddiśya prabhūtaṃ hiraṇyasuvarṇaṃ maṇiratnam ānītaṃ kaṃbalaratnaṃ ca. tad devaḥ pratigṛhṇātv (GBM 1551.8)",
  "S01msudarsu:34": "anukaṃpām upādāya. alaṃ grāmaṇyaḥ saṃvidyante me idam evaṃrūpaṃ",
  "S01msudarsu:35": "dhanajātam ity uktvā nādhivāsayati. dvir api trir api naigamajānapadā rājānaṃ mahāsudarśanam (GBM 1552.1)",
  "S01msudarsu:36_0": "idam avocan. idam asmābhir devam uddiśya prabhūtaṃ hiraṇyasuvarṇam ānītaṃ maṇiratnaṃ",
  "S01msudarsu:36_1": "kaṃbalaratnaṃ ca. tad devaḥ pratigṛhṇātv anukaṃpām upādāya. dvir api trir api rājā",
  "S01msudarsu:36_2": "mahāsudarśano naigamajānapadān idam avocat. (GBM 1552.4)",
  "S01msudarsu:37": "alaṃ grāmaṇyaḥ saṃvidyante me idam evaṃrūpaṃ dhanajātam ity uktvā nādhivāsayati. atha naigamajānapadānām etad abhavan. nāsmākaṃ pratirūpaṃ syād yad asmābhir (GBM 1552.5)",
  "S01msudarsu:38": "devam uddiśya prabhūtaṃ hiraṇyasuvarṇam ānītaṃ maṇiratnaṃ kaṃbalaratnaṃ ca,",
  "S01msudarsu:39": "yad vayaṃ punar apy ādāya svakasvakāni niveśanāni prakrāmema,",
  "S01msudarsu:40": "yan nu vayaṃ (GBM 1552.6)",
  "S01msudarsu:41": "rājño mahāsudarśanasya purastān mahāntaṃ hiraṇyasuvarṇasya rāśim ākīrya maṇiratnaṃ kaṃbalaratnaṃ caikānte upanikṣipya etat te deva dhanajātam ity uktvā nirapekṣāḥ (GBM 1552.7)",
  "S01msudarsu:42": "prakrāmema. iti naigamajānapadā rājño mahāsudarśanasya purastān mahāntaṃ hiraṇyasuvarṇasya rāśim ākīrya maṇiratnaṃ kaṃbalaratnaṃ caikānte upanikṣipya etat te (GBM 1552.8)",
  "S01msudarsu:43": "deva dhanajātam ity uktvā nirapekṣāḥ prakrāntāḥ.",
  "S01msudarsu:44": "MSuAv [7] atha rājño mahāsudarśanasyaitad abhavat*. saṃpannaṃ me dhanajātaṃ dharmeṇa nādharmeṇa. yanv ahaṃ dharmyaṃ prāsādaṃ (GBM 1553.1)",
  "S01msudarsu:45": "māpayeyam. aśrauṣuś caturaśīti koṭṭarājasahasrāṇi rājā mahāsudarśana udyukto dharmyaṃ prāsādaṃ māpayitum. iti śrutvā ca punar yena rājā mahāsudarśanaḥ tenopasaṃkrāntā. (GBM 1553.2)",
  "S01msudarsu:46": "upasaṃkramya rājānaṃ mahāsudarśanam idam avocaṃ. alpotsuko devo bhavatu dharmyāt prāsādād. vayaṃ devasya dharmyaṃ prāsādaṃ māpayiṣyāmo. 'laṃ (sic;",
  "S01msudarsu:47": "Matsumura lpaṃ)",
  "S01msudarsu:48": "grāmaṇyaḥ (GBM 1553.3)",
  "S01msudarsu:49": "saṃvidyante me idam evaṃrūpaṃ dhanajātaṃ ity uktvā nādhivāsayati. dvir api trir api caturaśītiṃ koṭṭarājasahasrāṇi rājānaṃ mahāsudarśanam idam avocaṃ. alpotsuko (GBM 1553.4)",
  "S01msudarsu:50": "devo bhavatu dharmyāt prāsādād. vayaṃ devasya dharmyaṃ prāsādaṃ māpayiṣyāmo. dvir api trir api rājā mahāsudarśanaś caturaśītiṃ koṭṭarājasahasrāṇi-m-idam (GBM 1553.5)",
  "S01msudarsu:51": "avocat. alaṃ grāmaṇyaḥ saṃvidyante me idam evaṃrūpaṃ dhanajātam ity uktvā nādhivāsayati.",
  "S01msudarsu:52": "MSuAv [8] atha tad eke koṭṭarājānāṃ rājño mahāsudarśanasya pādayor nipatya, (GBM 1553.6)",
  "S01msudarsu:53": "eke bāhū pragṛhya,",
  "S01msudarsu:54": "eke cīvarakarṇake pragṛhya,",
  "S01msudarsu:55": "eke yena rājā mahāsudarśanas tenāṃjaliṃ praṇamayya rājānaṃ mahāsudarśanam idam avocan*. alpotsuko devo bhavatu (GBM 1553.7)",
  "S01msudarsu:56": "dharmyāt prāsādād. vayaṃ devasya dharmyaṃ prāsādaṃ māpayiṣyāmo. 'dhivāsayati rājā mahāsudarśanaś caturaśīti koṭṭarājasahasrāṇāṃ tūṣṇīṃbhāvena.",
  "S01msudarsu:57": "MSuAv [9] atha caturaśīti (GBM 1553.8)",
  "S01msudarsu:58": "koṭṭarājasahasrāṇi rājño mahāsudarśanasya tūṣṇīṃbhāvenādhivāsanāṃ viditvā svakasvakāni vijitāni gatvā prabhūtaṃ hiraṇyasuvarṇam ādāya ekaikaṃ (GBM 1554.1)",
  "S01msudarsu:59": "ca ratnastaṃbhaṃ yena rājā mahāsudarśanas tenopasaṃkrāntā,",
  "S01msudarsu:60": "upasaṃkramya rājānaṃ mahāsudarśanam idam avocan*. kutra vayaṃ devasya dharmyaṃ prāsādaṃ māpayiṣyāmaḥ (GBM 1554.2)",
  "S01msudarsu:61": "kiyantaṃ vā. tena hi yūyaṃ grāmaṇyaḥ pūrveṇa kuśāvatyāṃ dharmyaṃ prāsādaṃ māpayataḥ yojanam āyāmena yojanaṃ vistāreṇa. evaṃ deveti caturaśīti koṭṭarājasahasrāṇi (GBM 1554.3)",
  "S01msudarsu:62": "rājño mahāsudarśanasya pratiśrutya pūrveṇa kuśāvatyāṃ dharmyaṃ prāsādaṃ māpayanti yojanam āyāmena yojanaṃ vistāreṇa.",
  "S01msudarsu:63": "MSuAv [10.1] dharmye mahārāja prāsāde (GBM 1554.4)",
  "S01msudarsu:64": "caturvidhāḥ prācīnā māpitā abhūvaṃ suvarṇamayā rupyamayā vaiḍūryamayā sphaṭikamayāḥ.",
  "S01msudarsu:65": "MSuAv [10.2] dharmye prāsāde caturvidhā nyāsā nyastā (sic;",
  "S01msudarsu:66": "Matsumura nyaktā)",
  "S01msudarsu:67": "abhūvaṃ suvarṇamayā (GBM 1554.5)",
  "S01msudarsu:68": "rupyamayā vaiḍūryamayā sphaṭikamayāḥ.",
  "S01msudarsu:69": "MSuAv [10.3] dharmye prāsāde caturvidhā staṃbhā ucchṛtā abhūvaṃ suvarṇamayā rupyamayā vaiḍūryamayā sphaṭikamayāḥ. suvarṇamayasya (GBM 1554.6)",
  "S01msudarsu:70": "staṃbhasya rupyamayaḥ kuṃbhakaḥ tṛkaṭakaḥ śīrṣako gosārako māpito 'bhūd. rupyamayasya suvarṇamayo. vaiḍūryamayasya sphaṭikamayaḥ. sphaṭikamayasya (GBM 1554.7)",
  "S01msudarsu:71": "staṃbhasya vaiḍūryamayaḥ kuṃbhakaḥ tṛkaṭakaḥ śīrṣako gosārako māpito 'bhūd.",
  "S01msudarsu:72": "MSuAv [10.4] dharmye prāsāde caturvidhā avasaṃgā māpitā abhūvan* sauvarṇamayā rupyamayā (GBM 1554.8)",
  "S01msudarsu:73": "vaiḍūryamayā sphaṭikamayā.",
  "S01msudarsu:74": "MSuAv [1O.5] dharmye prāsāde caturvidhā annāgrā māpitā abhūvaṃ suvarṇamayā rupyamayā vaiḍūryamayā sphaṭikamayā.",
  "S01msudarsu:75": "MSuAv [10.6] dharmye prāsāde (GBM 1555.1)",
  "S01msudarsu:76": "caturvidhā baladharaṇyā māpitā abhūvaṃ suvarṇamayyo rupyamayyaḥ vaiḍūryamayyo sphaṭikamayyaḥ.",
  "S01msudarsu:77": "MSuAv [lO.7] dharmye prāsāde caturvidhā niryūhā māpitā abhūvan* suvarṇamayāni (GBM 1555.2)",
  "S01msudarsu:78": "rupyamayāni vaiḍūryamayāṇi sphaṭikamayāni.",
  "S01msudarsu:79": "MSuAv [10.8] dharmyaḥ prāsādaś caturvidhaiḥ phalakaiḥ cchanno 'bhūt* suvarṇamayai rupyamayaiḥ vaiḍūryamayaiḥ sphaṭikamayaiḥ.",
  "S01msudarsu:80": "MSuAv [10.9] dharmye prāsāde (GBM 1555.3)",
  "S01msudarsu:81": "caturvidhāni sopānāni māpitāny abhūvan* suvarṇamayāni rupyamayāni vaiḍūryamayāni sphaṭikamayāni.",
  "S01msudarsu:82": "MSuAv [10.10] dharmyaḥ prāsādaḥ caturvidhābhir vedikābhiḥ parikṣipto 'bhūt (GBM 1555.4)",
  "S01msudarsu:83": "suvarṇamayībhi rupyamayībhi vaiḍūryamayībhi sphaṭikamayībhiḥ. suvarṇamayyā vedikāyāḥ rupyamayaḥ ālaṃbanam adhiṣṭhānaṃ sūcako māpito 'bhūt*. rupyamayyā (GBM 1555.5)",
  "S01msudarsu:84": "suvarṇamayaḥ,",
  "S01msudarsu:85": "vaiḍūryamayyā sphaṭikamayaḥ,",
  "S01msudarsu:86": "sphaṭikamayyā vaiḍūryamaya-m-ālaṃbanam adhiṣṭhānaṃ sūcako māpito 'bhūt*.",
  "S01msudarsu:87": "MSuAv [10.11] dharmye prāsāde caturvidhāni (GBM 1555.6)",
  "S01msudarsu:88": "kūṭāgārāṇi māpitāni abhūvan* suvarṇamayāni rupyamayāni vaiḍūryamayāni sphaṭikamayāni. suvarṇamaye kūṭāgāre rupyamayaḥ paryaṃka sthāpito 'bhūt* (GBM 1555.7)",
  "S01msudarsu:89": "paṭṭikāstṛto goṇikāstṛtas tūlikāstṛtaḥ citṛkāstṛto vyahatikāstṛtaḥ palalikāstṛtaḥ kāliṃgaprāvārapratyāstaraṇaḥ sottarocchadapaṭaḥ ubhayatopahitalohitopadhānaḥ. (GBM 1555.8)",
  "S01msudarsu:90": "rupyamaye suvarṇamayaḥ,",
  "S01msudarsu:91": "vaiḍūryamaye sphaṭikamayaḥ,",
  "S01msudarsu:92": "sphaṭikamaye mahārāja kūṭāgāre vaiḍūryamayaḥ paryaṅkaḥ sthāpito 'bhūt paṭṭikāstṛto (GBM 1556.1)",
  "S01msudarsu:93": "goṇikāstṛtas tūlikāstṛtaḥ citrikāstṛtaḥ vyahatikāstṛto palalikāstṛtaḥ kāliṃgaprāvārapratyāstaraṇaḥ sottarocchadapaṭa ubhayatopahitalohitopadhānaḥ. (GBM 1556.2)",
  "S01msudarsu:94": "MSuAv [10.12] suvarṇamayasya kūṭāgārasya purastād rupyamayas tālo māpito 'bhūt suvarṇamayena patreṇa puṣpeṇa phalena. rupyamayasya suvarṇamayo, (GBM 1556.3)",
  "S01msudarsu:95": "vaiḍūryamayasya sphaṭikamayaḥ,",
  "S01msudarsu:96": "sphaṭikamayasya kūṭāgārasya purastād vaiḍūryamayaḥ tālo māpito 'bhūt sphaṭikamayena patreṇa puṣpeṇa phalena.",
  "S01msudarsu:97": "MSuAv [10.13] teṣāṃ khalu (GBM 1556.4)",
  "S01msudarsu:98": "tālānāṃ vāyunā īryamāṇānāṃ ayam evaṃrūpo manojñaḥ śabdo niścarati. tadyathā paṃcāṃgikasya tūryasya kuśalena puruṣeṇa samyaksupravāditasya. (GBM 1556.5)",
  "S01msudarsu:99": "MSuAv [10.14] dharmyaḥ prāsādaḥ kanakavālukāstṛto 'bhūc candanavāripariṣikto hemajālāvanaddho suvarṇakaṅkaṇikāvṛtaḥ.",
  "S01msudarsu:100": "MSuAv [11] atha caturaśītiḥ koṭṭarājasahasrāṇi (GBM 1556.6)",
  "S01msudarsu:101": "sarvajātakṛtaniṣṭhitaṃ dharmyaṃ prasādaṃ viditvā dharmyasya prāsādasya purastād dharmyāṃ puṣkariṇīṃ māpayanti yojanam āyāmena yojanaṃ vistāreṇa. dharmyā (GBM 1556.7)",
  "S01msudarsu:102": "puṣkariṇī caturvidhābhir iṣṭakābhiś citābhūt suvarṇamayībhiḥ rupyamayībhi vaiḍūryamayībhiḥ sphaṭikamayībhiḥ. dharmyāyaṃ puṣkariṇyāṃ caturvidhāni sopānāni (GBM 1556.8)",
  "S01msudarsu:103": "māpitāny abhūvan suvarṇamayāni rupyamayāni vaiḍūryamayāni sphaṭikamayāni. dharmyā puṣkariṇīś caturvidhābhir vedikābhiḥ parikṣiptābhūt* suvarṇamayībhi (GBM 1557.1)",
  "S01msudarsu:104": "rupyamayībhi vaiḍūryamayībhiḥ sphaṭikamayībhiḥ. suvarṇamayyā mahārāja vedikāyā rupyamayam ālaṃbanam adhiṣṭhānaṃ sūcako māpito 'bhūt*. rupyamayyāḥ suvarṇamayaṃ, (GBM 1557.2)",
  "S01msudarsu:105": "vaiḍūryamayyāḥ sphaṭikamayaṃ,",
  "S01msudarsu:106": "sphaṭikamayyāḥ vaiḍūryamayam ālaṃbanam adhiṣṭhānaṃ sūcako māpito 'bhūt*. dharmyāṃ puṣkariṇyāṃ vividhāni jalajāni mālyāni ropitāny (GBM 1557.3)",
  "S01msudarsu:107": "abhūvan tadyathotpalaṃ padmaṃ kumudaṃ puṇḍarīkaṃ saugandhikaṃ mṛdugandhikaṃ sarvartukaṃ sarvakālikaṃ anāvṛtaṃ sarvajanasya. dharmyāyā mahārāja puṣkariṇyā ubhayatīre (GBM 1557.4)",
  "S01msudarsu:108": "vividhāni sthalajāni mālyāni ropitāny abhūvan* tadyathā atimuktaś caṃpaka pāṭalā vārṣikā mallikā navamālikā sumanā yūthikā dhānuṣkārī sarvartukaṃ (GBM 1557.5)",
  "S01msudarsu:109": "sarvakālikam anāvṛtaṃ sarvajanasya. dharmyā puṣkariṇī kanakavālukāstṛtābhūc candanavāriṣiktā hemajālāvanatā suvarṇakaṃkaṇikāvṛtā.",
  "S01msudarsu:110": "MSuAv [12] atha caturaśīti (GBM 1557.6)",
  "S01msudarsu:111": "koṭṭarājasahasrāṇi sarvajātakṛtaniṣṭhitāṃ dharmyāṃ puṣkariṇīṃ viditvā dharmyāyāḥ puṣkariṇyā purastād dharmyaṃ tālavanaṃ māpayanti yojanam āyāmena (GBM 1557.7)",
  "S01msudarsu:112": "yojanaṃ vistāreṇa. dharmye mahārāja tālavane caturvidhās tālā māpitā abhūvan* suvarṇamayā rupyamayā vaiḍūryamayā sphaṭikamayā. suvarṇamayasya (GBM 1557.8)",
  "S01msudarsu:113": "tālasya rupyamayaṃ patraṃ puṣpaṃ phalaṃ māpitam abhūd. rupyamayasya suvarṇamayaṃ,",
  "S01msudarsu:114": "vaiḍūryamayasya sphaṭikamayaṃ,",
  "S01msudarsu:115": "sphaṭikamayasya vaiḍūryamayaṃ patraṃ puṣpaṃ phalaṃ (GBM 1558.1)",
  "S01msudarsu:116": "māpitam abhūt. teṣāṃ khalu tālānāṃ vāyunā īryamanānām ayaṃ evaṃrūpo manojñaḥ śabdo niścarati. tadyathā paṃcāṃgikasya tūryasya kuśalena puruṣeṇa (GBM 1558.2)",
  "S01msudarsu:117": "samyaksupravāditasya. dharmyaṃ tālavanaṃ caturvidhābhir vedikābhiḥ parikṣiptam abhūt suvarṇamayībhi rupyamayībhiḥ vaiḍūryamayībhiḥ sphaṭikamayībhiḥ. suvarṇamayyā (GBM 1558.3)",
  "S01msudarsu:118": "vedikāyā rupyamayam ālaṃbanam adhiṣṭhānaṃ sūcako māpito 'bhūt*. rupyamayyā suvarṇamayaṃ,",
  "S01msudarsu:119": "vaiḍūryamayyā sphaṭikamayaṃ,",
  "S01msudarsu:120": "sphaṭikamayyā vaiḍūryamayam ālaṃbanam (GBM 1558.4)",
  "S01msudarsu:121": "adhiṣṭhānaṃ sūcako māpito 'bhūt*. dharmyaṃ tālavanaṃ kanakavālukāstṛtam abhūc candanavāripariṣiktaṃ hemajālāvanataṃ suvarṇakaṃkaṇikāvṛtam. (GBM 1558.5)",
  "S01msudarsu:122": "MSuAv [13.1] atha caturaśīti koṭṭarājasahasrāṇi sarvajātakṛtaniṣṭhitaṃ dharmyaṃ prāsādaṃ dharmyāṃ puṣkariṇīṃ dharmyaṃ tālavanaṃ viditvā yena rājā mahāsudarśanas (GBM 1558.6)",
  "S01msudarsu:123": "tenopasaṃkrāntāny. upasaṃkramya rājānaṃ mahāsudarśanam idam avocan*. sarvajātakṛtaniṣṭhito devasya dharmyaḥ prāsādo dharmyā puṣkariṇī (GBM 1558.7)",
  "S01msudarsu:124_0": "dharmyaṃ tālavanaṃ. yasyedānīṃ devaḥ kālaṃ manyate. atha rājño mahāsudarśanasyaitad",
  "S01msudarsu:124_1": "abhavan. na mama pratirūpaṃ syād yad aham evam eva tatprathamato dharmyaṃ prāsādam",
  "S01msudarsu:124_2": "adhinivaseyaṃ. (GBM 1558.8)",
  "S01msudarsu:125": "yanv ahaṃ ye me vijite sādhurūpasaṃmatāḥ śramaṇabrāhmaṇāḥ prativasanti te tāṃ dharmye prāsāde bhojayitvā pratyekapratyekaṃ navena duṣyayugenācchadayeyam. (GBM 1559.1)",
  "S01msudarsu:126": "MSuAv [13.2] atha rājā mahāsudarśano ye 'sya vijite sādhurūpasaṃmatāḥ śrāmaṇabrāhmaṇāḥ prativasanti tāṃ dharmye prāsāde bhojayitvā pratyekapratyekaṃ (GBM 1559.2)",
  "S01msudarsu:127": "navena duṣyayugenācchādayati. atha rājño mahāsudarśanasyaitad abhavan. na mama pratirūpaṃ syād yad ahaṃ dharmye prāsāde paṃcabhiḥ kāmaguṇais samarpitaḥ (GBM 1559.3)",
  "S01msudarsu:128": "samanvaṃgībhūtaḥ krīḍeyaṃ rameyaṃ paricārayeyaṃ. yanv ahaṃ dharmyaṃ prāsādaṃ abhiruhy';",
  "S01msudarsu:129": "ekena puruṣeṇopasthāyakena rājarṣibrahmacaryaṃ careyaṃ. (GBM 1559.4)",
  "S01msudarsu:130": "atha rājā mahāsudarśano dharmyaṃ prāsādam abhiruhy';",
  "S01msudarsu:131": "ekena puruṣeṇopasthāyakena rājarṣibrahmacaryam acārṣīd.",
  "S01msudarsu:132": "MSuAv [14] atha rājā mahāsudarśanaḥ suvarṇamayaṃ (GBM 1559.5)",
  "S01msudarsu:133": "kūṭāgāraṃ praviśya rupyamaye paryaṃke paryaṃkena niṣadya viviktaṃ kāmair viviktaṃ pāpakair akuśalair dharmaiḥ savitarkaṃ savicāraṃ vivekajaṃ (GBM 1559.6)",
  "S01msudarsu:134": "prītisukhaṃ prathamaṃ dhyānam upasaṃpadya viharati. rupyamayā paryaṃkād avatīrya suvarṇamayāt kūṭāgārān niṣkramya rupyamayaṃ kūṭāgāraṃ praviśya suvarṇamaye (GBM 1559.7)",
  "S01msudarsu:135": "paryaṃke paryaṃkena niṣadya viviktaṃ kāmair yāvat prathamaṃ dhyānam upasaṃpadya viharati. suvarṇamayāt paryaṃkād avatīrya rupyamayāt kūṭāgārān niṣkramya vaiḍūryamayaṃ (GBM 1559.8)",
  "S01msudarsu:136": "kūṭāgāraṃ praviśya sphaṭikamaye paryaṃke paryaṃkena niṣadya viviktaṃ kāmair yāvat prathamaṃ dhyānam upasaṃpadya viharati. sphaṭikamayāt paryaṃkād avatīrya (GBM 1560.1)",
  "S01msudarsu:137_0": "vaiḍūryamayāt kūṭāgāran niṣkramya sphaṭikamayaṃ kūṭāgāraṃ praviśya vaiḍūryamaye paryaṃke",
  "S01msudarsu:137_1": "paryaṃkena niṣadya viviktaṃ kāmair yāvat prathamaṃ dhyānam upasaṃpadya (GBM 1560.2) viharati.",
  "S01msudarsu:138": "MSuAv [15] atha caturaśīti strīsahasrāṇi yena strīratnaṃ tenopasaṃkrāntā upasaṃkramya strīratnam idam avocan*. yat khalu devi jānīthā,",
  "S01msudarsu:139": "ciradṛṣṭo 'smābhir (GBM 1560.3)",
  "S01msudarsu:140": "devaḥ, paritṛṣitāḥ smo devasya darśanena,",
  "S01msudarsu:141": "icchāmo vayaṃ devaṃ draṣṭuṃ. tena hi yūyaṃ bhaginyaḥ āgamayata yāvad ahaṃ pariṇāyakaratnam avalokayāmi. atha (GBM 1560.4)",
  "S01msudarsu:142": "strīratnaṃ pariṇāyakaratnaṃ dūtena prakrośyedam avocat*. yat khalu senāpate jānīyāc,",
  "S01msudarsu:143": "ciradṛṣṭo 'smābhir deva,",
  "S01msudarsu:144": "paritṛṣitā smo devasya darśanena, (GBM 1560.5)",
  "S01msudarsu:145": "icchāmo vayaṃ devaṃ draṣṭuṃ. tena hi yūyaṃ bhaginyaḥ sarvā pītālaṃkārā bhavata pītavastrā pītamālyābharaṇānulepanā pītaparivārā. yāvad (GBM 1560.6)",
  "S01msudarsu:146": "ahaṃ caturaśītiṃ koṭṭarājasahasrāṇi sannipātayāmi,",
  "S01msudarsu:147": "caturaśītiṃ nāgasahasrāṇy upoṣadhanāgarājapramukhāni,",
  "S01msudarsu:148": "caturaśītim aśvasahasrāṇi (GBM 1560.7)",
  "S01msudarsu:149": "vālāhāśvarājapramukhāni,",
  "S01msudarsu:150": "caturaśīti rathasahasrāṇi nandīghoṣarathapramukhāni. tathā bhavatv iti tāḥ śriyaḥ pratiśrutya (GBM 1560.8)",
  "S01msudarsu:151": "striyaḥ sarvāḥ pītālaṃkārābhūvaṃ pītavastrāḥ pītamālyābharaṇānulepanāḥ pītaparivārāḥ. atha pariṇāyakaratnaṃ caturaśītiṃ koṭṭarājasahasrāṇi (GBM 1561.1)",
  "S01msudarsu:152": "sannipātya,",
  "S01msudarsu:153": "caturaśīti nāgasahasrāṇi poṣadhanāgarājapramukhāni,",
  "S01msudarsu:154": "caturaśītiṃ aśvasahasrāṇi vālāhāśvarājapramukhāni,",
  "S01msudarsu:155": "caturaśītiṃ rathasahasrāṇi (GBM 1561.2)",
  "S01msudarsu:156": "nandīghoṣarathapramukhāni sannipātya,",
  "S01msudarsu:157": "strīratnaṃ nandīghoṣarathe āropya,",
  "S01msudarsu:158": "avaśiṣṭā striyaḥ pratyekapratyekaratheṣv āropya,",
  "S01msudarsu:159": "kuśāvatyā niṣkramya, (GBM 1561.3)",
  "S01msudarsu:160": "yena dharmyaḥ prāsādas tenopasaṃkrāntāḥ. tena khalu samayena dharmyasya prāsādasyādhastād uccaśabdamahāśabdo mahājanakāyasya ca nirghoṣo 'bhud.",
  "S01msudarsu:161": "MSuAv [16] aśrauṣīd (GBM 1561.4)",
  "S01msudarsu:162": "rājā mahāsudarśano dharmyasya prāsādasyādhastād uccaśabdamahāśabdo mahājanakāyasya ca nirghoṣo 'bhūc. chrutva ca punar upasthāyakaṃ puruṣam āmantrayate. (GBM 1561.5)",
  "S01msudarsu:163": "kim etad bhoḥ puruṣa dharmyasya prāsādasyādhastād uccaśabdamahāśabdo mahājanakāyasya ca nirghoṣaḥ. etāni deva caturaśītiṃ strīsahasrāṇi (GBM 1561.6)",
  "S01msudarsu:164": "strīratnapramukhāni dharmyasya prāsādasyādhastāt tiṣṭhanti devaṃ draṣṭukāmāni,",
  "S01msudarsu:165": "caturaśītiḥ koṭṭarājasahasrāṇi pariṇāyakaratnapramukhāni, (GBM 1561.7)",
  "S01msudarsu:166": "caturaśīti nāgasahasrāṇy upoṣadhanāgarājapramukhāni,",
  "S01msudarsu:167": "caturaśītim aśvasahasrāṇi vālāhāśvarājapramukhāni,",
  "S01msudarsu:168": "caturaśītiṃ rathasahasrāṇi (GBM 1561.8)",
  "S01msudarsu:169": "nandīghoṣarathapramukhāni dharmyasya prāsādasyādhastāt tiṣṭhanti. atha rājā mahāsudarśana upasthāyakaṃ puruṣam āmantrayate. tena hi tvaṃ bhoḥ (GBM 1562.1)",
  "S01msudarsu:170": "puruṣa dharmyasya prāsādasyādhastāt sauvarṇaṃ bhadrāsanaṃ prajñapaya,",
  "S01msudarsu:171": "yatrāhaṃ niṣadya mahājanakāyam apekṣyāmy. evaṃ devety upasthāyakaḥ puruṣo rājño mahāsudarśanasya (GBM 1562.2)",
  "S01msudarsu:172": "pratiśrutya dharmyasya prāsādasyādhastāt sauvarṇaṃ bhadrāsanaṃ prajñapya yena rājā mahāsudarśanas tenopasaṃkrāntaḥ. upasaṃkramya rājānaṃ mahāsudarśanam (GBM 1562.3)",
  "S01msudarsu:173": "idam avocat. prajñaptaṃ devasya dharmyasya prāsādasyādhastāt sauvarṇaṃ bhadrāsanaṃ. yasyedānīṃ devaḥ kālaṃ manyate.",
  "S01msudarsu:174": "MSuAv [17] adrākṣīd rājā mahāsudarśano dharmyāt (GBM 1562.4)",
  "S01msudarsu:175": "prāsādād avatāran* (sic; Matsumura:",
  "S01msudarsu:176": "dha(rmasya prāsādasyādhastā)",
  "S01msudarsu:177": "t)",
  "S01msudarsu:178": "sarvās tāḥ striyaḥ pītālaṃkārāḥ pītavastrāḥ pītamālyābharaṇānulepanāḥ pītaparivārāḥ. dṛṣṭvā ca punar asyaitad (GBM 1562.5)",
  "S01msudarsu:179": "abhavat. atirañjanīyo batāyaṃ mātṛgrāma iti viditvā indriyāṇy utkṣipaty. adrākṣī strīratnaṃ rājānaṃ mahāsudarśanam indriyāṇy utkṣipantaṃ (GBM 1562.6)",
  "S01msudarsu:180": "dṛṣṭvā punar asyā etad abhavad. yathā khalu devo 'smākaṃ dṛṣṭvā indriyāṇy utkṣipati. mā haiva devo 'smābhir anarthiko bhaviṣyatīti. atha rājā mahāsudarśano (GBM 1562.7)",
  "S01msudarsu:181": "dharmyāt prāsādād avatīrya sauvarṇe bhadrāsane niṣaṇṇo. 'tha strīratnaṃ yena rajā mahāsudarśanas tenopasaṃkrāntam. upasaṃkramya rājño (GBM 1562.8)",
  "S01msudarsu:182": "mahāsudarśanasya pādayor nipatya rājānaṃ mahāsudarśanam idam avocat*. etāni devasya caturaśītiḥ strīsahasrāṇi,",
  "S01msudarsu:183": "yatra devac chandaṃ janayatv apekṣāṃ karotu devo (GBM 1563.1)",
  "S01msudarsu:184": "jīvite. caturaśīti koṭṭarājasahasrāṇi pariṇāyakaratnapramukhāni,",
  "S01msudarsu:185": "caturaśīti nāgasahasrāṇy upoṣadhanāgarājapramukhāni,",
  "S01msudarsu:186": "caturaśītim (GBM 1563.2)",
  "S01msudarsu:187": "aśvasahasrāṇi vālāhāśvarājapramukhāni,",
  "S01msudarsu:188": "caturaśītiṃ rathasahasrāṇi nandīghoṣarathapramukhāni,",
  "S01msudarsu:189": "caturaśītin nagarasahasrāṇi kuśāvatīrājadhānīpramukhāni, (GBM 1563.3)",
  "S01msudarsu:190": "atra devac chandaṃ janayatv apekṣāṃ karotu devo jīvite. pūrve ca tvaṃ māṃ bhagini mitravattayā samudācarasi sā tvam etarhi sapatnavattayā. (GBM 1563.4)",
  "S01msudarsu:191": "MSuAv [18] atha strīratnaṃ rājñā mahāsudarśanena bhaginivādena samudācaritaṃ prārodīd,",
  "S01msudarsu:192": "aśrūṇi pravartayaty,",
  "S01msudarsu:193": "evaṃ cāha. yathā khalu devo 'smākaṃ (GBM 1563.5)",
  "S01msudarsu:194": "bhaginivādena samudācarati na cirā devāsmākaṃ devena sārdhaṃ nānābhāvo bhaviṣyati vinābhāvo viprayogo visaṃyogaḥ. atha strīratnaṃ cīvareṇāśrūṇi (GBM 1563.6)",
  "S01msudarsu:195": "pramṛjya [O. von Hinüber,",
  "S01msudarsu:196": "\"Die Bestimmung der Schulzugehörigkeit buddhistischer Texte nach sprachlichen Kriterien\",",
  "S01msudarsu:197": "Zur Schulzugehörigkeit von Werken der Hīnayāna-Literatur (Symposium zur Buddhismusforschung, III,1)",
  "S01msudarsu:198": ", ed. H. Bechert, Göttingen 1985 (AAWG, 149)",
  "S01msudarsu:199": ", Erster Teil, pp. 73,",
  "S01msudarsu:200": "Anm. 46: puṃjya] rājño mahāsudarśanasya pādayor nipatya rājānaṃ mahāsudarśanam idam avocat*. yathā kathaṃ pūrve vayaṃ devaṃ mitravattayā samudācarāmas (GBM 1563.7)",
  "S01msudarsu:201": "tathā vayam etarhi samudācarāmo na sapatnavattayā. ehi tvaṃ bhaginy,",
  "S01msudarsu:202": "evaṃ vada. alpakaṃ deva jīvitaṃ manuṣyāṇāṃ. gamanīyaḥ saṃparāyaḥ, kartavyaṃ (GBM 1563.8)",
  "S01msudarsu:203": "kuśalaṃ, caritavyaṃ brahmacaryaṃ. nāsti jātasyāmaraṇaṃ. so 'pi deva kṣaṇalavamuhūrto na prajñāyate yatra devasya sarveṇa sarvaṃ śarīranikṣepo bhaviṣyati. (GBM 1564.1)",
  "S01msudarsu:204": "yo devasya caturaśītiṣu strīsahasreṣu cchando vā rāgo vā sneho vā prema vā ālayo vā niyantir adhyavasānaṃ vā taṃ devaḥ prajahātu nirapekṣo (GBM 1564.2)",
  "S01msudarsu:205": "devo bhavatu jīvite. yo devasya caturaśītiṣu koṭṭarājasahasreṣu pariṇāyakaratnapramukheṣu,",
  "S01msudarsu:206": "caturaśītiṣu nāgasahasreṣūpoṣadhanāgarājapramukheṣu, (GBM 1564.3)",
  "S01msudarsu:207": "caturaśītiṣu-r-aśvasahasreṣu vālāhāśvarājapramukheṣu,",
  "S01msudarsu:208": "caturaśītiṣu rathasahasreṣu nandīghoṣarathapramukheṣu,",
  "S01msudarsu:209": "caturaśītiṣu (GBM 1564.4)",
  "S01msudarsu:210": "nagarasahasreṣu kuśāvatīrājadhānīpramukheṣu cchando vā rāgo vā sneho vā prema vā ālayo vā niyantir adhyavasānaṃ (GBM 1564.5)",
  "S01msudarsu:211": "vā taṃ devaḥ parijahātu nirapekṣo devo bhavatu jīvite. evaṃ hi tvaṃ bhagini mitravattayā samudācara mā sapatnavattayā.",
  "S01msudarsu:212": "MSuAv [19] idānīṃ vayaṃ devaṃ (GBM 1564.6)",
  "S01msudarsu:213": "mitravattayā samudacarāmo,",
  "S01msudarsu:214": "na sapatnavattayā. alpakaṃ deva jīvitaṃ manuṣyāṇāṃ gamanīyaḥ sāṃparāyaḥ,",
  "S01msudarsu:215": "kartavyaṃ kuśalaṃ,",
  "S01msudarsu:216": "caritavyaṃ brahmacaryaṃ. (GBM 1564.7)",
  "S01msudarsu:217": "nāsti jātasyāmaraṇaṃ so 'pi deva kṣaṇalavamuhūrto na prajñāyate yatra devasya sarveṇa sarvaṃ śarīranikṣepo bhaviṣyati. yo devasya caturaśītiṣu (GBM 1564.8)",
  "S01msudarsu:218": "strīsahasreṣu cchando vā rāgo vā sneho vā prema vā ālayo vā niyantir adhyavasānaṃ vā taṃ devaḥ prajahātu nirapekṣo devo bhavatu jīvite. (GBM 1565.1)",
  "S01msudarsu:219": "yo devasya caturaśītiṣu koṭṭarājasahasreṣu pariṇāyakaratnapramukheṣu,",
  "S01msudarsu:220": "caturaśītiṣu nāgasahasreṣu upoṣadhanāgarājapramukheṣu,",
  "S01msudarsu:221": "caturaśītiṣv (GBM 1565.2)",
  "S01msudarsu:222": "aśvasahasreṣu vālāhāśvarājapramukheṣu,",
  "S01msudarsu:223": "caturaśītiṣu rathasahasreṣu nandīghoṣarathapramukheṣu,",
  "S01msudarsu:224": "caturaśītiṣu nagarasahasreṣu kuśāvatīrājadhānīpramukheṣu (GBM 1565.3)",
  "S01msudarsu:225": "cchando va rāgo vā sneho vā prema vā ālayo vā niyantir adhyavasānaṃ vā taṃ devaḥ prajahātu nirapekṣo devo bhavatu jīvite.",
  "S01msudarsu:226": "MSuAv [20] atha rājā mahāsudarśanaḥ (GBM 1565.4)",
  "S01msudarsu:227": "strīratnenānenāvavādena codito dharmyaṃ prāsādam abhiruhya suvarṇamayaṃ kūṭāgāraṃ praviśya rupyamaye paryaṃke paryaṃkena niṣadya maitrīsahagatena (GBM 1565.5)",
  "S01msudarsu:228": "cittenāvaireṇāsapatnenāvyābādhena vipulena mahadgatenāpramāṇena subhāvitenaikāṃ diśam adhimucya spharitvopasaṃpadya viharati. (GBM 1565.6)",
  "S01msudarsu:229": "tathā dvitīyāṃ tathā tṛtīyāṃ tathā caturthīm ity ūrdhvam adhas tiryak sarvaśas sarvam imaṃ lokaṃ maitrīsahagatena cittenāvaireṇāsapatnenāvyābādhena (GBM 1565.7)",
  "S01msudarsu:230": "vipulena mahadgatenāpramāṇena subhāvitenaikāṃ diśam adhimucya spharitvopasaṃpadya viharati. rupyamayāt paryaṃkād avatīrya suvarṇamayāt kūṭāgārān niṣkramya rupyamayaṃ (GBM 1565.8)",
  "S01msudarsu:231": "kūṭāgāraṃ praviśya suvarṇamaye paryaṃke paryaṃkena niṣadya karuṇāsahagatena cittenāvaireṇa yāvad adhimucya spharitvopasaṃpadya viharati. (GBM 1566.1)",
  "S01msudarsu:232": "suvarṇamayāt paryaṃkād avatīrya rupyamayāt kūṭāgārān niṣkramya vaiḍūryamayaṃ kūṭāgāraṃ praviśya sphaṭikamaye paryaṃke paryaṃkena niṣadya muditāsahagatena cittena (GBM 1566.2)",
  "S01msudarsu:233": "yāvad adhimucya spharitvopasaṃpadya viharati. sphaṭikamayāt paryaṃkād avatīrya vaiḍūryamayāt kūṭāgarān niṣkramya sphaṭikamayaṃ kūṭāgāraṃ praviśya vaiḍūryamaye (GBM 1566.3)",
  "S01msudarsu:234": "paryaṃke paryaṃkena niṣadyopekṣāsahagatena cittena yāvad adhimucya spharitvopasaṃpadya viharati.",
  "S01msudarsu:235": "MSuAv [21] atha rājā mahāsudarśanaś caturo brahmāṃ (GBM 1566.4)",
  "S01msudarsu:236": "vihārāṃ bhāvayitvā kāmeṣu kāmacchandaṃ prahāya tadbahulavihārī brahmalokasabhāgatāyām upapanno. rājño mahāsudarśanasyeyam (sic;",
  "S01msudarsu:237": "Matsumura -nasyenaṃ)",
  "S01msudarsu:238": "evaṃ (GBM 1566.5)",
  "S01msudarsu:239": "anubhūtā maraṇāntikī vedanā,",
  "S01msudarsu:240": "tadyathā balavataḥ puruṣasya subhojanaṃ bhuktavato muhūrtaṃ syād bhaktaklamaḥ.",
  "S01msudarsu:241": "MSuAv [22] yāvac ca mahārāja kuśinagarī, yāvac (GBM 1566.6)",
  "S01msudarsu:242": "ca nadī hiraṇyavatī,",
  "S01msudarsu:243": "yāvac ca yamakasālavanaṃ,",
  "S01msudarsu:244": "yāvac ca mallānāṃ mukuṭabandhanacaityam atrāntarā dvādaśa yojanāni sāmantakena yatra tathāgatasya ṣaṭkṛtvaḥ (GBM 1566.7)",
  "S01msudarsu:245": "śarīranikṣepo 'bhūt sa ca rājñaḥ kṣatriyasya mūrdhābhiṣiktasya iha saptamikāṃ vārāṃ. tac ca tathāgatasyārhataḥ samyaksaṃbuddhasya nāhaṃ mahārāja taṃ pṛthivīpradeśaṃ (GBM 1566.8)",
  "S01msudarsu:246": "samanupaśyāmi yadivā pūrvasyāṃ diśi yadivā dakṣiṇasyāṃ yadivā paścimasyāṃ yadivā uttarasyāṃ diśi yatra tathāgatasyāṣṭamaṃ vā śarīranikṣepo bhaviṣyati. tat kasya (GBM 1567.1) hetoḥ.",
  "S01msudarsu:247": "ucchinnā tathāgatasya mahārāja bhavanetrī /",
  "S01msudarsu:248": "(sic; Matsumura (samu)cchinnā)",
  "S01msudarsu:249": "vikṣīṇo jātisaṃsāro nāstīdānīṃ punarbhava // 1 // iti //",
  "S01msudarsu:250": "antaroddānaṃ",
  "S01msudarsu:251": "prācīnanyāsastaṃbhā avasaṃgā annāgrabaladharaṇyaniryūhā / (GBM 1567.2)",
  "S01msudarsu:252": "phalakasopānavedikā kūṭatālakanakāś ca // 2 // iti",
  "S01msudarsu:253": "MSuAv [23] atha rājā mahāsudarśano dharme prāsāde paṃca pratyekabuddhaśatāni bhojayitvā (GBM 1567.3)",
  "S01msudarsu:254": "pratyekapratyekaṃ duṣyayugenācchādayitvā gāthāṃ bhāsate.",
  "S01msudarsu:255": "labdhvā hi vipulaṃ cittaṃ na pramādyed vicakṣaṇaḥ /",
  "S01msudarsu:256": "dadyāt saṃpannaśīlebhyo yatra ridhyanti dakṣiṇā // 3 //",
  "S01msudarsu:257": "evaṃ datveha medhāvī (GBM 1567.4)",
  "S01msudarsu:258": "śrāddho muktena cetasā /",
  "S01msudarsu:259": "avyābādhasukhe loke upapadyeta paṇḍitaḥ // 4 // iti.",
  "S01msudarsu:260": "MSuAv [24] syāt khalu mahārājānyas sa tena kālena tena samayena mahāsudarśano (GBM 1567.5)",
  "S01msudarsu:261": "nāma rājā cakravartī caturdvīpeśvaraḥ saptabhi ratnaiḥ samanvāgataḥ catasṛbhi mānuṣikābhi riddhibhir iti,",
  "S01msudarsu:262": "na khalv evaṃ draṣṭavyaṃ. aham eva sa tena (GBM 1567.6)",
  "S01msudarsu:263": "kālena tena samayena mahārājābhūvan mahāsudarśano nāma rājā cakravartī caturdvīpeśvaraḥ saptabhi ratnaiḥ samanvāgataḥ catasṛbhi mānuṣikābhi riddhibhiḥ (GBM 1567.7)",
  "S01msudarsu:264": "iti. syāt khalu mahārāja tena mayā dānena vā dānasaṃvibhāgena vā anuttarā samyaksaṃbodhir adhigateti,",
  "S01msudarsu:265": "na khalv evaṃ draṣṭavyaṃ. api tu tad dānam anuttarāyās samyaksaṃbodheḥ (GBM 1567.8)",
  "S01msudarsu:266": "hetumātrakaṃ pratyayamātrakaṃ saṃbhāramātrakam iti.",
  "S01msudarsu:267": "mahāsudarśanāvadānaḥ samāpta."
}