{
    "/nagsu_tu:0": " Reconstructed text of the Nagaropamasūtra according to one of the MS traditions, namely the Pelliot/Stein manuscript",
    "/nagsu_tu:1": " I. Canonical Text",
    "/nagsu_tu:2": " NagSū I.1 evaṃ mayā śrutam ekasmin samaye bhagavāñ śrāvastyāṃ viharati sma",
    "/nagsu_tu:3": " jetavane 'nāthapiṇḍadasyārāme ─",
    "/nagsu_tu:4": " SHT 154 (beginning of MS) opens here as follows: (śrāva)styā(ṃ) nidānaṃ pūrvvaṃ me bhi[kṣavaḥ]",
    "/nagsu_tu:5": " NagSū I.2 tatra bhagavān bhikṣūn āmantrayati sma ─ pūrvaṃ me bhikṣavo",
    "/nagsu_tu:6": " anuttarāṃ samyaksaṃbodhim anabhisaṃbuddhasyaikākino rahasigatasya pratisaṃlīnasyaivaṃ cetasi cetaḥparivitarka udapādi NagSū I.3 kṛcchraṃ batāyaṃ loka āpanno yad uta jāyate 'pi jīryate 'pi",
    "/nagsu_tu:7": " mriyate 'pi cyavate 'py upapadyate 'pi atha ca punar ime satvā jarāmaraṇasyottare niḥsaraṇaṃ yathābhūtaṃ na prajānanti ─",
    "/nagsu_tu:8": " NagSū I.4 tasya mamaitad abhavat ─ kasmin nu sati jarāmaraṇaṃ bhavati kiṃpratyayaṃ ca punar jarāmaraṇaṃ tasya mama yoniśo manasikurvata evaṃ",
    "/nagsu_tu:9": " yathābhūtasyābhisamaya udapādi ─",
    "/nagsu_tu:10": " jātyāṃ satyāṃ jarāmaraṇaṃ bhavati ─ jātipratyayañ ca punar jarāmaraṇam ─",
    "/nagsu_tu:11": " NagSū I.5 tasya mamaitad abhavat ─ kasmiṃ nu sati jātir bhavati ─",
    "/nagsu_tu:12": " kiṃpratyayā ca punar jātiḥ ─ tasya mama yoniśo manasikurvata evaṃ yathābhūtasyābhisamaya udapādi ─ bhave sati jātir bhavati bhavapratyayā ca",
    "/nagsu_tu:13": " punar jātiḥ We should note that our reconstructed text here (from end of 119v6 to beginning of 120r1) has many more akṣaras than the gap would allow for.",
    "/nagsu_tu:14": " Because our reconstructed text almost certainly must represent something close to the original text, we have supposed that the scribe's eye in all",
    "/nagsu_tu:15": " likelihood skipped from the first yathābhūtasyābhi- which would have",
    "/nagsu_tu:16": " concluded 119v6 down to -samaya udapādi which would have begun 120r1. The reconstructed text is based upon Hoernle no.149.x.33 [= Or.15009/670] v1 4",
    "/nagsu_tu:17": " and SHT 154.",
    "/nagsu_tu:18": " NagSū I.6 tasya mamaitad abhavat kasmiṃ nu sati bhavo bhavati ─",
    "/nagsu_tu:19": " kiṃpratyayaś ca punar bhavaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ upādāne sati bhavo bhavati upādānapratyayaś ca punar bhavaḥ",
    "/nagsu_tu:20": " NagSū I.7 tasya mamaitad abhavat kasmiṃ nu sati upādānaṃ bhavati kiṃpratyayaṃ ca punar upādānaṃ tasya mama yoniśo manasikurvataḥ evaṃ",
    "/nagsu_tu:21": " yathābhūtasyābhisamaya udapādi ─ tṛṣṇāyāṃ satyāṃ upādānaṃ bhavati tṛṣṇāpratyayañ ca punar upādānaṃ",
    "/nagsu_tu:22": " NagSū I.8 tasya mamaitad abhavat kasmiṃ nu sati tṛṣṇā bhavati kiṃpratyayā",
    "/nagsu_tu:23": " ca punas tṛṣṇā tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ vedanāyāṃ satyāṃ tṛṣṇā bhavati vedanāpratyayā ca punas tṛṣṇā ─",
    "/nagsu_tu:24": " NagSū I.9 tasya mamaitad abhavat kasmiṃ nu sati vedanā bhavati kiṃpratyayā",
    "/nagsu_tu:25": " ca punar vedanā tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ sparśe sati vedanā bhavati ─",
    "/nagsu_tu:26": " sparśapratyayā ca punar vedanā ─",
    "/nagsu_tu:27": " NagSū I.10 tasya mamaitad abhavat kasmiṃ nu sati sparśo bhavati kiṃpratyayaś ca punaḥ sparśaḥ tasya mama yoniśo manasikurvataḥ evaṃ",
    "/nagsu_tu:28": " yathābhūtasyābhisamaya udapādi ─ ṣaḍāyatane sati sparśo bhavati ṣaḍāyatanapratyayaś ca punaḥ sparśaḥ",
    "/nagsu_tu:29": " NagSū I.11 tasya mamaitad abhavat kasmiṃ nu sati ṣaḍāyatanaṃ bhavati kiṃpratyayaṃ ca punaḥ ṣaḍāyatanaṃ tasya mama yoniśo manasikurvataḥ evaṃ",
    "/nagsu_tu:30": " yathābhūtasyābhisamaya udapādi ─",
    "/nagsu_tu:31": " nāmarūpe sati ṣaḍāyatanaṃ bhavati nāmarūpapratyayañ ca punaḥ ṣaḍāyatanaṃ NagSū I.12 tasya mamaitad abhavat kasmiṃ nu sati nāmarūpaṃ bhavati kiṃpratyayañ ca punar nāmarūpaṃ tasya mama yoniśo manasikurvataḥ evaṃ",
    "/nagsu_tu:32": " yathābhūtasyābhisamaya udapādi ─ vijñāne sati nāmarūpaṃ bhavati vijñānapratyayañ ca punar nāmarūpaṃ",
    "/nagsu_tu:33": " tasya mamaitad abhavat kasmiṃ nu sati vijñānaṃ bhavati kiṃpratyayaṃ ca punar vijñānaṃ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ nāmarūpe sati vijñānaṃ bhavati nāmarūpapratyayaṃ ca punar vijñānaṃ",
    "/nagsu_tu:34": " tasya mama vijñānāt pratyudāvartate mānasaṃ nātaḥ parato vyativartate NagSū I.13 14 The reason for skipping numbers 13 and 14 is that in",
    "/nagsu_tu:35": " following Tripāṭhī's paragraphing, we have not adopted his reconstruction",
    "/nagsu_tu:36": " of the pratītyasamutpāda formula here to twelve aṅgas. See Introduction section IV.C for further discussion.",
    "/nagsu_tu:37": " NagSū I.15 yad uta nāmarūpapratyayaṃ vijñānaṃ vijñānapratyayaṃ nāmarūpaṃ",
    "/nagsu_tu:38": " nāmarūpapratyayaṃ ṣaḍāyatanaṃ ṣaḍāyatanapratyayaḥ sparśaḥ sparśapratyayā vedanā vedanāpratyayā tṛṣṇā tṛṣṇāpratyayam upādānam upādānapratyayo bhava bhavapratyayā jātir jātipratyayaṃ jarāmaraṇaṃ śokaparidevaduḥkhadaurmanasyopāyāsāḥ saṃbhavaṃty evam asya kevalasya mahato duḥkhaskandhasya samudayo bhavati ─ //",
    "/nagsu_tu:39": " NagSū I.16 tasya mamaitad abhavat kasmin nv asati jarāmaraṇaṃ na bhavati ─",
    "/nagsu_tu:40": " kasya nirodhāj jarāmaraṇanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi jātyām asatyāṃ jarāmaraṇaṃ na bhavati jātinirodhāj jarāmaraṇanirodhaḥ NagSū I.17 tasya mamaitad abhavat kasmin nv asati jātir na bhavati ─ kasya nirodhāj jātinirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ bhave asati jātir na bhavati bhavanirodhāj jātinirodhaḥ",
    "/nagsu_tu:41": " NagSū I.18 tasya mamaitad abhavat kasmin nv asati bhavo na bhavati ─ kasya nirodhād bhavanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ upādāne asati bhavo na bhavati upādānanirodhād bhavanirodhaḥ",
    "/nagsu_tu:42": " NagSū I.19 tasya mamaitad abhavat kasmin nv asati upādānaṃ na bhavati",
    "/nagsu_tu:43": " kasya nirodhād upādānanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi tṛṣṇāyām asatyām upādānaṃ na bhavati tṛṣṇānirodhād upādānanirodhaḥ NagSū I.20 tasya mamaitad abhavat kasmin nv asati tṛṣṇā na bhavati kasya nirodhāt tṛṣṇānirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
    "/nagsu_tu:44": " vedanāyām asatyāṃ tṛṣṇā na bhavati vedanānirodhāt tṛṣṇānirodhaḥ NagSū I.21 tasya mamaitad abhavat kasmin nv asati vedanā na bhavati kasya nirodhād vedanānirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
    "/nagsu_tu:45": " sparśe asati vedanā na bhavati sparśanirodhād vedanānirodhaḥ NagSū I.22 tasya mamaitad abhavat kasmin nv asati sparśo na bhavati kasya nirodhāt sparśanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
    "/nagsu_tu:46": " ṣaḍāyatane asati sparśo na bhavati ṣaḍāyatananirodhāt sparśanirodhaḥ NagSū I.23 tasya mamaitad abhavat kasmin nv asati ṣaḍāyatanaṃ na bhavati",
    "/nagsu_tu:47": " kasya nirodhāt ṣaḍāyatananirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ nāmarūpe asati ṣaḍāyatanaṃ na bhavati nāmarūpanirodhāt ṣaḍāyatananirodhaḥ",
    "/nagsu_tu:48": " NagSū I.24 tasya mamaitad abhavat kasmin nv asati nāmarūpaṃ na bhavati",
    "/nagsu_tu:49": " kasya nirodhān nāmarūpanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─ vijñāne asati nāmarūpaṃ na bhavati vijñānanirodhān nāmarūpanirodhaḥ",
    "/nagsu_tu:50": " NagSū I.25 tasya mamaitad abhavat kasmin nv asati vijñānaṃ na bhavati",
    "/nagsu_tu:51": " kasya nirodhād vijñānanirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
    "/nagsu_tu:52": " saṃskāreṣv asatsu vijñānaṃ na bhavati saṃskāranirodhād vijñānanirodhaḥ NagSū I.26 tasya mamaitad abhavat kasmin nv asati saṃskārā na bhavanti",
    "/nagsu_tu:53": " kasya nirodhāt saṃskāranirodhaḥ tasya mama yoniśo manasikurvataḥ evaṃ yathābhūtasyābhisamaya udapādi ─",
    "/nagsu_tu:54": " avidyāyām asatyāṃ saṃskārā na bhavaṃti avidyānirodhāt saṃskāranirodhaḥ",
    "/nagsu_tu:55": " P.S. Bleu 67(1)v2 and SHT 420, folio 7r3 (NidSa, transliteration no. 109)",
    "/nagsu_tu:56": " have following phrase: ity avidyānirodhā(t saṃskāranirodhaḥ).",
    "/nagsu_tu:57": " NagSū I.27 saṃskāranirodhād vijñānanirodhaḥ vijñānanirodhān",
    "/nagsu_tu:58": " nāmarūpanirodhaḥ nāmarūpanirodhāt ṣaḍāyatananirodhaḥ ṣaḍāyatananirodhāt sparśanirodhaḥ sparśanirodhād vedanānirodhaḥ vedanānirodhāt tṛṣṇānirodhaḥ tṛṣṇānirodhād upādānanirodhaḥ upādānanirodhād bhavanirodhaḥ bhavanirodhāj jātinirodhaḥ jātinirodhāj jarāmaraṇanirodhaḥ śokaparidevaduḥkhadaurmanasyopāyāsā nirudhyaṃty evam asya kevalasya mahato duḥkhaskandhasya nirodho bhavati //",
    "/nagsu_tu:59": " NagSū I.28 tasya mamaitad abhavad adhigato me paurāṇo mārgaḥ paurāṇo vartma paurāṇī puṭā pūrvakairṣibhir yātānuyātā The classical Sanskrit form, which we have used throughout the",
    "/nagsu_tu:60": " reconstructed portions of our text, would of course be -kair ṛṣi-. However the MS does not allow space for that many akṣaras, so we have adopted the form used elsewhere in the Pelliot/Stein MS. See note 9 of the translation",
    "/nagsu_tu:61": " for further remarks.",
    "/nagsu_tu:62": " NagSū I.29 tadyathā puruṣaḥ araṇye pravaṇe anvāhiṇḍaṃ adhigacchet paurāṇaṃ mārgaṃ paurāṇaṃ vartmaṃ paurāṇīṃ puṭāṃ pūrvakair manuṣyair yātānuyātā ─ sa",
    "/nagsu_tu:63": " ta(m a)nugacchet sa tam anugacchaṃ sa tatra paśyet paurāṇaṃ mārgaṃ paurāṇaṃ nagaraṃ paurāṇīṃ rājadhānīm ārāmasaṃpannāṃ vanasaṃpannāṃ",
    "/nagsu_tu:64": " puṣkariṇīsaṃpannāṃ śubhāṃ dāpavatīṃ ramaṇīyāṃ paśyet paurāṇaṃ mārgaṃ: omit paurāṇaṃ mārgaṃ, cf. next paragraph.",
    "/nagsu_tu:65": " NagSū I.30 tasyaivaṃ syād yan nv ahaṃ gatvā rājñe ārocayeyaṃ atha sa puruṣo rājñe gatvā ārocayed yat khalu deva jānīyāḥ ihāham adrākṣam araṇye",
    "/nagsu_tu:66": " pravaṇe anvāhiṇḍaṃ paurāṇaṃ mārgaṃ paurāṇaṃ vartma paurāṇīṃ puṭāṃ pūrvakair manuṣyair yātānuyātāṃ so 'haṃ tam anugatavāṃ so 'haṃ tam anugacchann adrākṣaṃ paurāṇaṃ nagaraṃ paurāṇīṃ rājadhānīm ārāmasaṃpannāṃ vanasaṃpannāṃ puṣkariṇīsaṃpannāṃ śubhāṃ dāpavatīṃ ramaṇīyāṃ tāṃ devo nagarīṃ māpayatu",
    "/nagsu_tu:67": " NagSū I.31 atha sa rājā tāṃ nagarīṃ māpayet sā ca syād apareṇa samayena rājadhānī ṛddhā ca sphītā ca kṣemā ca subhīkṣā cākīrṇabahujanamanuṣyā ca ─",
    "/nagsu_tu:68": " NagSū I.32 evam evā bhikṣava adhigato me paurāṇo mārgaḥ paurāṇaṃ vartma",
    "/nagsu_tu:69": " paurāṇī puṭā pūrvakairṣibhir yātānuyātā evam evā: read evam eva",
    "/nagsu_tu:70": " NagSū I.33 katamo 'sau paurāṇo mārgaḥ paurāṇaṃ vartmaḥ paurāṇī puṭā",
    "/nagsu_tu:71": " pūrvakairṣibhir yātānuyātā :",
    "/nagsu_tu:72": " NagSū I.34 yad utāryāṣṭāṅgo mārgaḥ tadyathā samyagdṛṣṭiḥ samyaksaṃkalpaḥ",
    "/nagsu_tu:73": " samyagvāk samyakkarmāntaḥ samyagājīvaḥ samyagvyāyāmaḥ samyaksmṛtiḥ samyaksamādhir evāṣṭamaḥ",
    "/nagsu_tu:74": " NagSū I.35 At least one MS (SHT 787 = NidSa transliteration no. 127.2)",
    "/nagsu_tu:75": " inserts the following sentence after evāṣṭamaḥ: (ayam a)sau [bhi]kṣavaḥ",
    "/nagsu_tu:76": " paurāṇo mārgaḥ paur(āṇaṃ va)[rtma] paurāṇī pūṭā pūrvakai ṛṣibhir",
    "/nagsu_tu:77": " yātānuyā(tā); cf. also the Mūlasarvāstivāda-vinaya citation [V. Näther, C.",
    "/nagsu_tu:78": " Vogel, and K. Wille, \"The Final Leaves of the Pravrajyāvastu Portion of the Vinayavastu Manuscript Found Near Gilgit, Part 1,",
    "/nagsu_tu:79": " Saṃgharakṣitāvadāna\", in: Sanskrit-Texte aus dem buddhistischen Kanon:",
    "/nagsu_tu:80": " Neuentdeckungen und Neueditionen III, Göttingen 1996 (Sanskrit-Wörterbuch",
    "/nagsu_tu:81": " der buddhistischen Texte aus den Turfan-Funden, Beiheft 6), p. 260]. This sentence constitutes par. 35 in Tripāṭhī's edition, but since it is missing in the Pelliot/Stein MS, we have likewise omitted this paragraph",
    "/nagsu_tu:82": " here.",
    "/nagsu_tu:83": " NagSū I.36 so 'haṃ tam anugatavāṃ so 'haṃ tam anugacchaṃ jarāmaraṇam",
    "/nagsu_tu:84": " adrākṣaṃ jarāmaraṇasamudayaṃ jarāmaraṇanirodhaṃ jarāmaraṇanirodhagāminīṃ pratipadam adrākṣam NagSū I.37 evaṃ jātibhavopādānatṛṣṇāvedanāsparśaṣaḍāyatananāmarūpavijñānaṃ saṃskārān adrākṣaṃ saṃskārasamudayaṃ saṃskāranirodhaṃ saṃskāranirodhagāminīṃ pratipadam adrākṣaṃ",
    "/nagsu_tu:85": " P.S. Bleu 67(3)r4ff. preserves a fully elaborated text instead of this more truncated passage: jātim adrākṣaṃ jātisamu(daya)ṃ jā(t)i(n)i(ro)dhaṃ",
    "/nagsu_tu:86": " jātinirodhagāminī⟨ṃ⟩ pratipadam adrākṣa(ṃ) ─",
    "/nagsu_tu:87": " bhava(m adrākṣaṃ bhavasamuda)(5)yaṃ bhavanirodhaṃ bhavanirodhagāminī⟨ṃ⟩",
    "/nagsu_tu:88": " pr(atipadam adrākṣaṃ ─ u)pādānam adrākṣaṃ upādānasamudayaṃ u(p)ā(dānanirodham upādāna)(3v1)(ni)r(odha)gāminī⟨ṃ⟩ pratipadam adrākṣaṃ ─",
    "/nagsu_tu:89": " tṛ(ṣṇām adrākṣaṃ tṛṣṇāsam)ud(a)y(aṃ) tṛṣṇān(i)r(o)dha(ṃ)",
    "/nagsu_tu:90": " tṛ(ṣ)ṇ(ā)n(i)rodhagāminī⟨ṃ⟩ prat(ipadam adrākṣaṃ ─ sparśa)(2)(m a)drākṣaṃ",
    "/nagsu_tu:91": " sparśasamudayaṃ spa(r)ś(anirodhaṃ sparśani)rodhagāminīṃ pratipadam adrākṣaṃ ─ ṣaḍāyatanam a(drākṣaṃ ṣaḍāyatana)(3)(sa)mudayaṃ",
    "/nagsu_tu:92": " ṣaḍāyatananirodhaṃ ṣaḍāyatananirodhagāminīṃ pratipadam adrākṣaṃ ─",
    "/nagsu_tu:93": " n(ā)m(a)rūpam a(drākṣaṃ nāmarūpasa)(4)mudayaṃ nāmarūpanirodhaṃ",
    "/nagsu_tu:94": " nāmarūpanirodhagā(mi)nīṃ pratipadam adrākṣaṃ ─ vijñānam adrā(kṣa)ṃ",
    "/nagsu_tu:95": " vij(ñ)āna(samudayaṃ vijñānaniro)(5)(dha)ṃ vij(ñ)ānanirodhagāminī(ṃ)",
    "/nagsu_tu:96": " p(r)atipadam adrākṣaṃ ─ saṃ(skāra)m adrakṣaṃ saṃskārasamudayaṃ . . . ; cf.",
    "/nagsu_tu:97": " P.S. Bleu 77v3 6, 78v3 5, 276vx z, Petits frags. 693, 1295, and 1297; SHT",
    "/nagsu_tu:98": " 157, fragment br1 2 and 787r4 v4.",
    "/nagsu_tu:99": " NagSū I.38 so 'ham imāṃ dharmāṃ svayam abhijñāyābhisaṃbuddhyā bhikṣūṇām ārocayāmi bhikṣūṇīnām upāsakānām upāsikānāṃ nānātīrthyaśramaṇabrāhmaṇacarakaparivrājakānāṃ",
    "/nagsu_tu:100": " NagSū I.39 tatra bhikṣur api samyakpratipadyamānaḥ ārādhako bhavati",
    "/nagsu_tu:101": " ārādhayati nyāyaṃ dharmaṃ kuśalaṃ bhikṣuṇy apy upāsako 'py upāsikāpi samyakpratipadyamānā ārādhikā bhavati ─ ārādhayati nyāyaṃ dharmaṃ kuśalam*",
    "/nagsu_tu:102": " NagSū I.40 evam idaṃ brahmacaryaṃ vaistārikaṃ bhavati bahujanyaṃ",
    "/nagsu_tu:103": " pṛthubhūtaṃ yāvad devamanuṣyebhyaḥ samyaksuprakāśitam* //",
    "/nagsu_tu:104": " Krot. 9(2)r1 2 continues: idam avocat* bhagavāṃ āptamanasas te bhikṣavo bhagavato bhāṣitam abhyanandam* // nagaropamasūtraṃ samāpta // //; line 3",
    "/nagsu_tu:105": " contains a colophon for which see Transliteration, Canonical Text, V. Cf.",
    "/nagsu_tu:106": " also SHT 152, fragment ev2 3. The end of the canonical text is missing from the Pelliot/Stein MS. We have reconstructed this section on the basis of Pet 1v5 2r1, SHT 157, fragment br4 5, 167r6 v2, 179r5 v2, and 616v3 4;",
    "/nagsu_tu:107": " cf. also the Mūlasarvāstivāda-vinayacitation [V. Näther, C. Vogel, and K.",
    "/nagsu_tu:108": " Wille, \"The Final Leaves of the Pravrajyāvastu Portion of the Vinayavastu",
    "/nagsu_tu:109": " Manuscript Found Near Gilgit, Part 1, Saṃgharakṣitāvadāna\", in:",
    "/nagsu_tu:110": " Sanskrit-Texte aus dem buddhistischen Kanon: Neuentdeckungen und Neueditionen III, Göttingen 1996 (Sanskrit-Wörterbuch der buddhistischen Texte aus den Turfan-Funden, Beiheft 6), p. II. Appendix The first part of the appendix has been adapted from the Petrovsky MS which is the only extant MS that preserves, almost entirely, that part of",
    "/nagsu_tu:111": " the appendix not found in the Pelliot/Stein MS. Because our reconstruction",
    "/nagsu_tu:112": " of the canonical text and appendix is intended to represent a single MS tradition (as reunited from the London and Paris collections), the section of the Petrovsky MS that has been used to reconstruct the appendix has been given in bold. The paragraphing is more or less arbitrary.",
    "/nagsu_tu:113": " NagSū II.1 pratyupasthitasya punar nagaropamasya vyākaraṇasya brahmā sanatkumāro 'tikrāntavarṇaḥ atikrāntāyāṃ rātryāṃ yena bhagavāṃs tenopagāma upetya bhagavatpād au śirasā vanditvā ekānte asthād ekāntasthitaḥ brahmā",
    "/nagsu_tu:114": " sanatkumāro bhagavataḥ purataḥ gāthāṃ babhāṣe //",
    "/nagsu_tu:115": " aho vidyā mahāvidyā kleśaviṣapraghātanī bhāṣitaṃ te mahāvīra bhūteṣu hy anukampakaḥ",
    "/nagsu_tu:116": " pratyupasthitasya: This reconstruction is tentative since we have no way",
    "/nagsu_tu:117": " to determine the akṣara(s) immediately preceding upasthitasya in Pet. 2r2.",
    "/nagsu_tu:118": " In the beginning of this line about seven more akṣaras are missing, but at least the first six almost certainly belong to the end of the canonical",
    "/nagsu_tu:119": " text. SHT 179 gives a different transition between the canonical text and",
    "/nagsu_tu:120": " the appendix: ... samyaksuprakāśitam* samanantaraparyāvasitasya",
    "/nagsu_tu:121": " vyak(ara)ṇasya ⟨nagaropama⟩m ity adhivacanam* // // atha brahma sanatkumāro ...",
    "/nagsu_tu:122": " NagSū II.2 asti māriṣa purastimāyāṃ diśi dve mahārākṣasi prativasataś candraprabhā nāma sūryaprabhā ca .. sahasraparivāre te mānuṣikāṃ prajāṃ rakṣāṃ guptiṃ balaṃ phāṣaṃ sukhasparśavihāratāyai paripālayataḥ pathagatā apy utpathagatā api ārāmagatā api śunyāgāragatā api catasraḥ pariṣado",
    "/nagsu_tu:123": " bhikṣur bhikṣuṇī upāsakā upāsikās tadanyāṃś ca manuṣyāṃs tatreme mantrapadā bhavanti yena teṣām ākarṣaṇaṃ bhavati tadyathā vaḍa : saraḍa : cappuṣa : śaraṅgulī",
    "/nagsu_tu:124": " (phāṣaṃ s)ukhas(pa)rś(a)vihāratāyai: SHT 176, fol. 20v3 21r2 reads",
    "/nagsu_tu:125": " phāṣa(sukhaspa)r[śavi]hāratāyāṃ paripālayaṃti pathagate(nāpi",
    "/nagsu_tu:126": " u)tpathagatenāpi ārāmagatenāpi śuṇyāgāragatenāpi caturṇā[ṃ] pariṣadāṃ",
    "/nagsu_tu:127": " bhikṣu⟨ṇā⟩ṃ bhikṣuṇ[ī]nām upāsakānām upāsikānāṃ tadanyeṣāṃ ca manuṣyāṇāṃ.",
    "/nagsu_tu:128": " cappuṣa: SHT 176, fol.21r4 reads capuṭa.",
    "/nagsu_tu:129": " NagSū II.3 kariṣye māriṣa imasya nagaropamasya vyākaraṇasya siddhiṃ rakṣaṃ bandhaṃ parigraham ─ tadyathā purime ─ kapphe ─ parumele ─ rimele ─ parāpare ─ purāpure ─ kukumati kṣīramati kururu ─ mururu ─ kurarā ─ murarā ─ kānti oṣṭrāpāli ─ ghori gandhāri ─",
    "/nagsu_tu:130": " sopakke ─ capaphari + + + + + purāpuri ─ eṇe ─ meṇe ─ dapphe ─ daḍapphe ─",
    "/nagsu_tu:131": " alasāpati ─ padumāpati kumudāpati svāha //",
    "/nagsu_tu:132": " capaphari: It is unclear how many akṣaras are missing at this point. SHT",
    "/nagsu_tu:133": " 176, fol. 21v2 5 reads these mantrapadas as follows: purime ─ kappe ─",
    "/nagsu_tu:134": " parumele ─ rimele ─ parāpure purāpure ─ kukūmati ─ kṣīramati ─ kururu ─",
    "/nagsu_tu:135": " mururu ─ kururā mururā ─ kānti ─ oṣṭraṣāli ─ ghori gandhāri cori caṇḍāli ─",
    "/nagsu_tu:136": " saupakke ─ capaphari ─ ; P.S. Bleu 129ry adds an interlinear insertion below ghori: cori caṇḍali mā de .. ..; cf. also Āṭānāṭikasūtra (Hoffmann",
    "/nagsu_tu:137": " ed., Bruchstücke des Āṭānāṭikasūtra aus dem zentralasiatischen Sanskritkanon der Buddhisten, Leipzig 1939; repr. with supplement by L.",
    "/nagsu_tu:138": " Sander, Stuttgart 1987), 33ff. and the Bhadrakarātriyasūtra, frag. 3b5 in",
    "/nagsu_tu:139": " S.F. Oldenburg, \"Otryvki kashgarskikh sanskritskikh rukopisey iz sobraniya N.F. Petrovskogo, NagSū II.4 āgamiṣyati māriṣa māraḥ pāpīyāṃs tasya purata ime mantrapadā bhāṣitavyaḥ buddha śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭhas tathāgatāt*",
    "/nagsu_tu:140": " buddho hi śreṣṭho lokasya dharmarājo hy anuttaraḥ ─",
    "/nagsu_tu:141": " dharma śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭho 'tra dharmataḥ dharmo hi śreṣṭho lokasya virāgopaśamaḥ sukham* ─",
    "/nagsu_tu:142": " saṃgha śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭho 'tra saṃghataḥ saṃgho hi śreṣṭho lokasya puṇyakṣetro hy anuttaraḥ //",
    "/nagsu_tu:143": " NagSū II.5 atha punar māriṣa nagaropamaṃ vyākaraṇam vipaśyinaḥ",
    "/nagsu_tu:144": " tathāgatasyārhataḥ samyaksaṃbuddhasya dharmadvāro nāma vyākaraṇaṃ babhūva",
    "/nagsu_tu:145": " ─ kanakamunes tathāgatasyārhataḥ samyaksaṃbuddhasya api dharmadvāro nāma",
    "/nagsu_tu:146": " vyākaraṇaṃ babhūva ─ kāśyapasya tathāgatasyārhataḥ samyaksaṃbuddhasya api dharmadvāro nāma vyākaraṇaṃ babhūva /",
    "/nagsu_tu:147": " NagSū II.6 bhagavataḥ punar etarhi śākyamunes tathāgatasyārhataḥ samyaksaṃbuddhasya jarāmaraṇajñāne yathābhūtam abhisaṃbodhāt*",
    "/nagsu_tu:148": " jarāmaraṇasamudayajñāne jarāmaraṇanirodhajñāne jarāmaraṇanirodhagāminīpratipajjñāne yathābhūtam abhisaṃbodhāt* evaṃ jātir bhavam upādānaṃ tṛṣṇā vedanā sparśaḥ ṣaḍāyatanaṃ nāmarūpaṃ vijñānaṃ saṃskārajñāne yathābhūtam abhisaṃbodhāt* saṃskārasamudayajñāne saṃskāranirodhajñāne saṃskāranirodhagāminīpratipajjñāne yathābhūtam",
    "/nagsu_tu:149": " abhisaṃbodhāt* .. .. .. .. p. .. rmā .i .. .. .. + + + + + + + + + + +",
    "/nagsu_tu:150": " ..[t]* nagaropamaṃ vyākaraṇaṃ pratipajjñāne: SHT 154, fragm. ev1 reads -pratipadajñāne",
    "/nagsu_tu:151": " -pratipadājñāne). evaṃ jātir bhavam: SHT 154, frags. d and e preserve a fully elaborated version of this passage, repeating the complete formula for each member of the pratītyasamutpāda.",
    "/nagsu_tu:152": " NagSū II.7 tasmād asya vyākaraṇasya + + + + + + + + + + .. dharmasaṃbodho nagaropamam ity",
    "/nagsu_tu:153": " NagSū II.8 asmiṃ khalu nagaropame vyākaraṇe bhāṣyamāṇe ayaṃ",
    "/nagsu_tu:154": " trisahasramahāsahasro lokadhātus tṛkṛtvā kampitaḥ saṃkampitaḥ saṃprakaṃpitaḥ kṣubhitaḥ saṃkṣubhitaḥ saṃprakṣubhitaḥ vyathitas saṃvyathitaḥ saṃpravyathitaḥ calitaḥ saṃcalitaḥ saṃpracalitaḥ Pet. 5v4 5 reads in a somewhat different order: saṃkampitaḥ saṃprakampitaḥ calitaḥ saṃcalitaḥ saṃpra(calitaḥ vyathitaḥ saṃvyathitaḥ) (5v5)",
    "/nagsu_tu:155": " saṃpravyathitaḥ kṣubhitaḥ saṃkṣubhitaḥ saṃprakṣubhitaḥ.",
    "/nagsu_tu:156": " NagSū II.9 tasmāt tarhi māriṣa idaṃ nagaropamaṃ vyākaraṇaṃ bhikṣūṇāṃ śāstāram evānumantavyaṃ satkarttavyaṃ gurukartavyaṃ mānayitavyaṃ",
    "/nagsu_tu:157": " pūjayitavyaṃ upaniḥśṛtya vihartavyaṃ bhikṣūṇāṃ bhikṣuṇīnām upāsakānām upāsikānāṃ devānāṃ nāgānāṃ yakṣāṇāṃ rākṣasānāṃ pretānāṃ kumbhāṇḍānāṃ piśācānāṃ idaṃ vyākaraṇaṃ śāstāram evānumantavyaṃ satkartavyaṃ gurukartavyaṃ mānayitavyaṃ pūjayitavyaṃ upaniḥśṛtya vihartavyam*",
    "/nagsu_tu:158": " NagSū II.10 idaṃ ca punar māriṣa nagaropamaṃ vyākaraṇaṃ kāmāvacarair devaiḥ koṭinayutaśatasahasrair bhāṣitaṃ cābhyanumoditaṃ cāṣṭāviṃśatibhir",
    "/nagsu_tu:159": " yakṣasenāpatibhir bhāṣitaṃ cābhyanumoditaṃ ca caturbhiś ca mahārājābhir bhāṣitaṃ cābhyanumoditaṃ ca śakreṇa devendreṇa bhāṣitaṃ cābhyanumoditaṃ ca",
    "/nagsu_tu:160": " brāhmaṇaḥ-sabhāpatinā bhāṣitaṃ cābhyanumoditaṃ ca śuddhāvasair devaiḥ koṭinayutaśatasahasrair bhāṣitaṃ cābhyanumoditaṃ ca atītaiś ca",
    "/nagsu_tu:161": " nadīgaṅgavālukāprākhyais tathāgatair arahadbhiḥ samyaksaṃbuddhair bhāṣitaṃ anāgatā api nadīgaṅgavālukāprākhyās tathāgatā arhaṃtaḥ samyaksaṃbuddhā bhāṣiṣyanti bhagavān apy etarhi pratyutpanne dhvani tathāgato 'rhaṃ",
    "/nagsu_tu:162": " samyaksaṃbuddho bhāṣitavān*",
    "/nagsu_tu:163": " brāhmaṇaḥ-sabhāpatinā: SHT 176, fol. 30r3 reads brahmā sabhāpatinā.",
    "/nagsu_tu:164": " śuddhāvasair: Pet. 4v3 and SHT 176, fol. 30r4 read śuddhāvasaiś ca.",
    "/nagsu_tu:165": " nadīgaṅgavālukāprākhyais: SHT 176, fol. 30v1 reads -vālika-.",
    "/nagsu_tu:166": " NagSū II.11 yaḥ kaścin māriṣa idaṃ vyākaraṇaṃ uddekṣyati dhārayiṣyati grāhayiṣyati vācayiṣyati svādhyāyiṣyati paryavāpsyati manasikariṣyati saḥ ahinā na daṃkṣyati viṣaṃ kāye na tariṣyati śastraṃ na kramiṣyati nodakena",
    "/nagsu_tu:167": " kālaṃ kariṣyati agninā na daṅkṣyati rājāno 'pi na prasahīṣyaṃti corā na muṣiṣyaṃti rājakulamadhyagato 'pi svastinottariṣyati gāḍhabandhanabaddho 'pi mokṣyati āsannāsamāgato 'pi abhyavakāśagato bhaviṣyati sarve ca kṛtyakākhordamantravetāḍa prativigamiṣyaṃti sarve ca bhūtagaṇā na viheṭhayiṣyaṃti anyatra pūrvakeṇa karmaṇā idaṃ viditvā brahmā sanatkumāro",
    "/nagsu_tu:168": " bhagavatpādau śirasā vanditvā bhagavantaṃ tṛpradakṣiṇīkṛtvā tatraivāntarhitaḥ //",
    "/nagsu_tu:169": " daṃkṣya(ti): SHT 1275r5 reads daśyiṣyati; cf. also SHT 906, frag. c (fol.",
    "/nagsu_tu:170": " 21)r6: daśiṣyati. daṅkṣyati: Pet. 6r3 reads dhaṃkṣya(ti). viditvā: Pet.",
    "/nagsu_tu:171": " 6v1 reads vaditvā which must be the correct reading.",
    "/nagsu_tu:172": " NagSū II.12 atha catvāro mahārājānaḥ atikrāntavarṇā abhikrāntāyāṃ rātryāṃ",
    "/nagsu_tu:173": " yena bhagavāṃs tenopajagmur upetya bhagavatpādau śirasā vanditvā yathā svakasvakāṃ diśaṃ niḥśṛtya ekānte tasthūr ekāntasthitaḥ",
    "/nagsu_tu:174": " tasthūr: read tasthur",
    "/nagsu_tu:175": " NagSū II.13 atha purastimāyāṃ diśaṃ niḥśṛtya dhṛtirāṣṭro mahārājā yena bhagavāṃs tenāṃjaliṃ praṇamya bhagavantaṃ gāthayā abhyabhāṣat*",
    "/nagsu_tu:176": " aho vidyā mahāvidyā kleśaviṣapraghātanī bhāṣitā te mahāvīra nirjvarā jvaranāśanī ─",
    "/nagsu_tu:177": " diśaṃ: SHT 875r3 reads purastimāṃ diśi. jvaranāśanī: SHT 875v2 3 reads jvaraśāminī :.",
    "/nagsu_tu:178": " NagSū II.14 asti māriṣā purastimāyāṃ diśāyāṃ dve mahārākṣasi prativasataḥ sugriṇī nāma vasugriṇī ca paṃcasahasraparivāre te mānuṣikāṃ prajāṃ rakṣāṃ guptiṃ balaṃ phāṣaṃ sukhasparśavihāratāyai paripālayataḥ pathagatā api utpathagatā api ārāmagatā api śuṇyāgāragatā api catasraḥ pariṣado bhikṣūṇāṃ bhikṣuṇīnāṃ upāsakānāṃ upāsikānāṃs tadanyaṃś ca manuṣyāṇāṃ tatreme maṃtrapadā bhavanti yena teṣām ākarṣaṇaṃ bhavati tadyathā",
    "/nagsu_tu:179": " vijini vijini ─ saṃskṛni ─ vijñini vijñini ─ kṣīramati kulamati //",
    "/nagsu_tu:180": " phala + + .. .. .. .e .. rāpure ─ ene mene ─ dapphe daḍapphe ─ alasāpati ─",
    "/nagsu_tu:181": " padumāpati kumudāpati svāhā ─ //",
    "/nagsu_tu:182": " diśāyāṃ: Cf. SHT 875v4 and elsewhere in P.S. Bleu 434 (fol. 129r6, 129v4,",
    "/nagsu_tu:183": " etc.); P.S. Petits frags. 340+606rw reads [di]ś[i].",
    "/nagsu_tu:184": " NagSū II.15 āgamiṣyati māriṣa māraḥ pāpīyāṃs tasya purataḥ ime mantrapadā bhāṣitavyaḥ buddha śreṣṭho na śreṣṭhas tvaṃ pūrvavat* vistareṇa trayaḥ ślokaḥ 3",
    "/nagsu_tu:185": " NagSū II.16 yaḥ kaścin māriṣa idaṃ nagaropamaṃ vyākaraṇaṃ uddekṣyati dhārayiṣyati pūrvavad yāvad anyatra pūrvakena karmaṇā //",
    "/nagsu_tu:186": " NagSū II.17 atha dakṣiṇān diśaṃ niḥśṛtya virūḍhako mahārājā yena bhagavāṃs tenāṃjaliṃ praṇamya bhagavaṃtaṃ gāthayā abhyabhāṣat*",
    "/nagsu_tu:187": " aho vidyā mahāvidyā kleśaviṣapraghātanī bhāṣitā te mahāvīra nirjvarā jvaranāśanī ─",
    "/nagsu_tu:188": " virūḍhako: P.S. Petits frag. 1365vb starts here. At 1365vb we find [kumbh].[ṇḍ]. cf. Ārya-Mahā-Māyūrī Vidyā-Rājñī (Shūyo Takubo ed.), 16.6:",
    "/nagsu_tu:189": " dakṣiṇāyām Ānanda diśāyāṃ Virūḍhako nāma kumbhāṇḍamahārājā prativasati",
    "/nagsu_tu:190": " sma.",
    "/nagsu_tu:191": " NagSū II.18 asti māriṣā dakṣiṇāyāṃ diśāyāṃ dve mahārākṣasi prativasataḥ caṇḍinī nāma upacaṇḍinī ca paṃcasahasraparivāre te mānuṣikāṃ prajāṃ",
    "/nagsu_tu:192": " pūrvavad yāvat tatreme mantrapadā bhavanti yena teṣām ākarṣaṇaṃ bhavati tadyathā nāmini ─ nāmini ─ ṣaḍini ṣaḍini ─ sparśini sparśini svāhā //",
    "/nagsu_tu:193": " svāhā //: Mac. 1.5 continues with what was surely part of this formulaic",
    "/nagsu_tu:194": " text: āgamiṣyati māriṣa māraḥ pāpīyāṃ(1.6)(s tasya purata ime mantrapadā bhāṣitavyāḥ buddhaḥ śreṣṭho na śreṣṭhas tva)ṃ p(ūr)v(a)vad (y)āvad anyatra",
    "/nagsu_tu:195": " (pūrva)(2.1)(keṇa karmaṇā //). SHT 906, frag. c (fol. 21) and SHT 909,",
    "/nagsu_tu:196": " frag. b both appear to include not only the text as represented in the",
    "/nagsu_tu:197": " Mac. MS, but a fully elaborated version thereof (i.e. without the abbreviation pūrvavad",
    "/nagsu_tu:198": " NagSū II.19 atha paścimāyāṃ diśaṃ niḥśṛtya virūpākṣo mahārājā yena bhagavāṃs tenāṃjaliṃ praṇamya bhagavantaṃ gāthayā abhyabhāṣat* //",
    "/nagsu_tu:199": " aho vidyā mahāvidyā kleśaviṣapraghātanī bhāṣitā te mahāvīra nirjvarā jvaranāśanī /",
    "/nagsu_tu:200": " NagSū II.20 asti māriṣa paścimāyāṃ diśāyāṃ dve mahārākṣasi prativasataḥ dṛśyā nāma mahādṛśyā ca paṃcasahasraparivāre te mānuṣikāṃ prajāṃ rakṣāṃ guptiṃ balaṃ phāṣaṃ sukhasparśavihāratayai pūrvavad yāvat tatreme mantrapadā bhavanti yena teṣām ākarṣaṇaṃ bhavati tadyathā vedini ─ vedini ─ tṛṣṇini ─ tṛṣṇini ─ upādini ─ svāhā //",
    "/nagsu_tu:201": " diśāyāṃ: Mac. 2.3 reads diśi. vedini: SHT 905, frag. a (fol. 28)r.1 2",
    "/nagsu_tu:202": " appears to have two more mantrapadas preceding this one: 1 [s]v[ā]ha ─",
    "/nagsu_tu:203": " kuśi ─ kuśikesari ///; 2 la mālinī svāha ─ tadya + ///. upādini: SHT 905,",
    "/nagsu_tu:204": " frag. a (fol. 28)r3 reads upādānini.",
    "/nagsu_tu:205": " NagSū II.21 āgamiṣyati māriṣa māraḥ pāpīyāṃs tasya purata ime maṃtrapadā bhāṣitavyaḥ buddha śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭhas tathāgataḥ pūrvavad yāvad anyatra pūrvakeṇa karmaṇā pūrvavad yāvad: SHT 905, frag. a (fol. 28)r4ff. preserves a fully",
    "/nagsu_tu:206": " elaborated text (i.e. without the abbreviation).",
    "/nagsu_tu:207": " NagSū II.22 athottarāyāṃ diśi niḥśṛtya vaiśravaṇo mahārājā : yena bhagavāṃs tenāṃjaliṃ praṇamya bhagavantaṃ gāthayā abhyabhāṣat*",
    "/nagsu_tu:208": " aho vidyā mahāvidyā kleśaviṣapraghātanī bhāṣitā te mahāvīra nirjvarā jvaranāśanī",
    "/nagsu_tu:209": " athottarāyāṃ: Mac. 3.2 reads athottarān.",
    "/nagsu_tu:210": " NagSū II.23 santi māriṣa uttarāyān diśi bhaumā yakṣāḥ anekayakṣasahasrāḥ parivāra prativasaṃti te mānuṣikāṃ prajāṃ rakṣāṃ guptiṃ balaṃ phāṣaṃ sukhasparśavihāratāyai paripālayanti ─ pathagatā api utpathagatā api ārāmagatā api śunyāgāragatā api catasraḥ pariṣado bhikṣūṇāṃ bhikṣuṇīnāṃ",
    "/nagsu_tu:211": " upāsakānāṃ upāsikānāṃs tadanyāṃś ca manuṣyāṇāṃ tatreme maṃtrapadā bhavaṃti yena teṣām ākarṣaṇaṃ bhavati tadyathā bhāvini bhāvini ─ jātini ─ jātini ─ maraṇi ─ maraṇi ─ svāhā //",
    "/nagsu_tu:212": " anekayakṣasahasrāḥ: Mac. 3.5 reads anekasa(hasrāḥ). manuṣyāṇāṃ: Mac. 4.2",
    "/nagsu_tu:213": " reads (bhi)k(ṣu)ṇī (u)pāsakā upā(s)ik(ā)s tadanyāś ca manuṣyāṃ. tatreme:",
    "/nagsu_tu:214": " SHT 909, frag. a (fol. 61)r1 starts here and reads (ra)kṣāṃ bhavatu paritraṃ parigrahaṃ paripālanam* (ta)treme. bhāvini: SHT 905, frag. b",
    "/nagsu_tu:215": " (fol. 30)v1 2 has some mantrapadas preceding: 1 tadyathā ha + + + ///; 2",
    "/nagsu_tu:216": " ri ─ riraṃsa[v]. + + ///.",
    "/nagsu_tu:217": " NagSū II.24 āgamiṣyati māriṣa māraḥ pāpīyāṃs tasya purata ime mantrapadā bhāṣitavyaḥ buddha śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭhas tathāgatāt*",
    "/nagsu_tu:218": " buddho hi śreṣṭho lokasya dharmarājo hy anuttaraḥ ─",
    "/nagsu_tu:219": " dharma śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭho 'tra dharmataḥ dharmo hi śreṣṭho lokasya virāgopaśamaḥ",
    "/nagsu_tu:220": " saṃgha śreṣṭho na śreṣṭhas tvaṃ nāsti śreṣṭho 'tra saṃghataḥ saṃgho hi śreṣṭho lokasya puṇyakṣetro hy anuttara 3",
    "/nagsu_tu:221": " ime mantrapadā: SHT 909, frag. a (fol. 61)r3 reads mantrā. tathāgatāt*:",
    "/nagsu_tu:222": " Mac. 4.5 reads nāsti buddhena (śreṣṭhataḥ); SHT 909, frag. a (fol. 61)r3 5",
    "/nagsu_tu:223": " reads nāsti buddhe[n].; cf. SHT 905, frag. a (fol. 28)r5; 906, frag. c",
    "/nagsu_tu:224": " (fol. 21)r2. dharmataḥ: SHT 909, frag. a (fol. 61)r4 reads nāsti dharmeṇa",
    "/nagsu_tu:225": " ś[r]eṣ(ṭh)a[ta ─]. virāgopaśamaḥ: Mac. 5.1 and SHT 909, frag. a (fol.",
    "/nagsu_tu:226": " 61)r5 read virāgopaśamaṃ. saṃghataḥ: SHT 909, frag. a (fol. 61)r5 reads nāsti saṅghena śreṣṭhat..",
    "/nagsu_tu:227": " NagSū II.25 yaḥ kaścin māriṣa idaṃ nagaropamaṃ vyākaraṇaṃ uddekṣyati dhārayiṣyati grāhayiṣyati vācayiṣyati svādhyāyiṣyati paryavāpsyati",
    "/nagsu_tu:228": " manasikariṣyati sa ahinā na daṃkṣyati viṣaṃ kāye na tariṣyati ─ śastraṃ na kramiṣyati ─ nodakena kālaṃ kariṣyati agninā na dhakṣyati rājāno 'pi na prasahiṣyaṃti corā na muṣiṣyaṃti ─ rājakulamadhyagato 'pi",
    "/nagsu_tu:229": " svastinottariṣyati ─ gāḍhabandhanabaddho 'pi mucciṣyati āsannasamāgato 'pi",
    "/nagsu_tu:230": " ─ abhyavakāśagato bhaviṣyati : sarve ca kṛtyakākhordamantravetāḍa",
    "/nagsu_tu:231": " prativigamiṣyaṃti sarve ca bhūtagaṇā na viheṭhayiṣyaṃti anyatra pūrvakeṇa karmaṇā //",
    "/nagsu_tu:232": " sa ahinā: SHT 909, frag. a (fol. 61)v2 reads tasy(ā)h(inā). mucciṣyati:",
    "/nagsu_tu:233": " Mac. 6.1 reads (m)okṣya(ti). kṛtyakākhordamantravetāḍa: Mac. 6.2 reads",
    "/nagsu_tu:234": " [k].k[kh]or[d]a-; SHT 909, frag. a (fol. 61)v5 reads kakkho[r].; SHT",
    "/nagsu_tu:235": " 1675r3 reads [k]ākkhorda-.",
    "/nagsu_tu:236": " NagSū II.26 atha catvāro mahārājānaḥ yena bhagavāṃs tenāṃjaliṃ praṇamya bhagavantam idam avocat*",
    "/nagsu_tu:237": " aho subhāṣitā vidyā śākyasiṃhena dhīmatā ─",
    "/nagsu_tu:238": " dvādaśāṅgasamāyuktā sarvabhūtanivāraṇī sarve devā nāgā yakṣā pretā kuṃbhāṇḍā kāḍapūtanā yo ime atikramen maṃtrāṃ mahārājñā mukhanirgatām*",
    "/nagsu_tu:239": " saptadhāsya sphalen mūrdhā daśadhā hṛdayaṃ sphalet*",
    "/nagsu_tu:240": " (i)dam avocat*: Although the MS clearly reads avocat*, we would expect an",
    "/nagsu_tu:241": " aor.pl. here: avocan. kāḍapūtanā: Mac. 6.6 reads kādapūtanā; SHT 971v2",
    "/nagsu_tu:242": " reads kaṭapuṭaḥ. yo ime: unmetrical! Mac. 6.6 reads: me [dativus ethicus].",
    "/nagsu_tu:243": " mukhanirgatām*: SHT 1675v1 reads (mah)ārājamukhanirgat(ām). sphalet*: SHT",
    "/nagsu_tu:244": " 971v3 reads (saptadhā)sya phalen murddhna dāśata hṛtayaṃ ///; Mac. 7.1",
    "/nagsu_tu:245": " reads hṛdayaṃ phalet* and in SHT 1675v2 is preserved yaṃ [phale].",
    "/nagsu_tu:246": " NagSū II.27 idaṃ vaditvā catvāro mahārājāno bhagavatpādau śirasā vanditvā bhagavantaṃ tṛpradakṣiṇīkṛtvā tatraivāntarhita NagSū II.28 atha bhagavāṃs tasyā eva rātryā atyayāt purastād bhikṣusaṃghasya prajñapta evāsane nyaṣīdat* niṣadya bhagavāṃ bhikṣūn",
    "/nagsu_tu:247": " āmantrayati ─ yathādya bhikṣavo brahmā sanatkumāro 'tikrāntavarṇaḥ",
    "/nagsu_tu:248": " abhikrāntāyāṃ rātryāṃ yenāhaṃ tenopasaṃkrantaḥ upetya mama pādau śirasā vanditvā ekānte asthād ekāntasthitaḥ brahmā sanatkumāro mama purato gāthāṃ babhāṣe aho vidyā mahāvidyā pūrvavad yāvad NagSū II.29 idaṃ vaditvā brahmā sanatkumāro mama pādau śirasā vanditvā māṃ",
    "/nagsu_tu:249": " tṛḥ pradakṣiṇīṃ kṛtvā tatraivāntarhitaḥ NagSū II.30 atha catvāro mahārājāno 'tikrāntavarṇā abhikrāntāyāṃ rātryāṃ yenāhaṃ tenopasaṃkrānta upetya mama pādau śirasā vanditvā yathā svakāṃ",
    "/nagsu_tu:250": " niḥśṛtya ekānte tasthur ekāntasthita pūrvavad yāvad",
    "/nagsu_tu:251": " tenopasaṃkrānta: read -krāntā. (yathā svakā)ṃ: Mac 8.4 reads [s]va[k]asva",
    "/nagsu_tu:252": " .. .. [ś]i⟨ṃ⟩; cf. NagSū II.12: yathā svakasvakāṃ diśaṃ niśṛtya.",
    "/nagsu_tu:253": " ekāntasthita: read -sthitā.",
    "/nagsu_tu:254": " NagSū II.31 idaṃ vaditvā catvāro mahārājāno mama pādau śirasā vanditvā māṃ",
    "/nagsu_tu:255": " tṛḥ pradakṣiṇīkṛtvā tatraivāntarhitāḥ udgṛhṇata bhikṣavo nagaropamaṃ vyākaraṇaṃ dhārayata grāhayata vācayata paryavāpnuta manasikuruta tat kasmād dheto arthopasaṃhitaṃ nagaropamaṃ vyākaraṇaṃ dharmopasaṃhitaṃ ādibrahmacaryasyābhijñāyai saṃbodhaye nirvāṇāya saṃvartate ─",
    "/nagsu_tu:256": " vācayata: Mac. 9.1 reads svadhyāyata.",
    "/nagsu_tu:257": " NagSū II.32 atha ca punaḥ kulaputreṇa śraddhāpravrajitena śraddhayā agārād anagārikaṃ pravrajitvā nagaropamaṃ vyākaraṇaṃ sādhu ca suṣṭhu ca",
    "/nagsu_tu:258": " udgṛhṇitavyaṃ dhārayitavyaṃ grāhayitavyaṃ vācayitavyaṃ svādhyāyitavyaṃ paryavāptavyaṃ manasīkartavyaṃ idam avocat* //",
    "/nagsu_tu:259": " avocat*: The text in the Stein MS ends here but Mac. 9.6 gives the standard closing: bhagavāṃ aptamanās (for āptamanasas) te bhi(kṣavo",
    "/nagsu_tu:260": " bhagavato bhāṣitam abhyanandan).",
    "/nagsu_tu:261": " nagaropamaṃ sūtraṃ samāptaḥ rakṣaṃ bhavatu pṛṣtagautamāya : //",
    "/nagsu_tu:262": " pṛṣtagautamāya : //: Mac. 10.1 has a colophon in Tocharian B: nagaropam*",
    "/nagsu_tu:263": " āra po solme paik(ā)m(ai) [End of Nagaropama(sūtra). I have written",
    "/nagsu_tu:264": " everything completely]. The authors would like to thank Dr. K.T. Schmidt",
    "/nagsu_tu:265": " (Saarbrücken) for this restoration and translation."
}