{
    "XXvinv03_u:0": " Pravāraṇāvastu",
    "XXvinv03_u:1": " (Pravā-v 147)",
    "XXvinv03_u:2": " Pravā-v 1.1.1-3",
    "XXvinv03_u:3": " Sanskrit text lost",
    "XXvinv03_u:4": " Pravā-v 1.2.1-3",
    "XXvinv03_u:5": " Sanskrit text lost",
    "XXvinv03_u:6": " Pravā-v 1.3",
    "XXvinv03_u:7": " Sanskrit text lost",
    "XXvinv03_u:8": " Pravā-v 2.1-2",
    "XXvinv03_u:9": " Sanskrit text lost",
    "XXvinv03_u:10": " Pravā-v 2.3.1",
    "XXvinv03_u:11": " Sanskrit text lost",
    "XXvinv03_u:12": " Pravā-v 2.3.2.1.",
    "XXvinv03_u:13": " tataḥ paścāt pravārako bhikṣuḥ saṃmantavyaḥ. pañcabhir dharmaiḥ samanvāgataḥ pravārako bhikṣur asaṃmato na saṃmantavyaḥ. saṃmataś",
    "XXvinv03_u:14": " cāvakāśayitavyaḥ. katamaiḥ pañcabhiḥ. chandād gacchati dveṣān mohād bhayād gacchati pravāraṇāṃ cāpravāraṇāṃ na jānāti. ebhiḥ pañcabhir dharmaiḥ",
    "XXvinv03_u:15": " (Pravā-v 148) samanvāgataḥ pravārako bhikṣur asaṃmato na saṃmantavyaḥ.",
    "XXvinv03_u:16": " saṃmataś cāvakāśayitavyaḥ. pañcabhis tu dharmaiḥ samanvāgataḥ pravārako bhikṣur asaṃmataḥ saṃmantavyaḥ. saṃmataś ca nāvakāśayitavyaḥ. katamaiḥ",
    "XXvinv03_u:17": " pañcabhiḥ. na chandād gacchati na dveṣān na mohād na bhayād gacchati pravāraṇāṃ cāpravāraṇāṃ jānāti. ebhiḥ pañcabhir dharmaiḥ samanvāgataḥ pravārako bhikṣur asaṃmataḥ saṃmantavyaḥ. saṃmataś ca nāvakāśayitavyaḥ.",
    "XXvinv03_u:18": " Pravā-v 2.3.2.2.",
    "XXvinv03_u:19": " evaṃ ca punaḥ saṃmantavyaḥ. śayanāsanaprajñaptiṃ kṛtvā pūrvavad yāvad",
    "XXvinv03_u:20": " utsāhayitavyaḥ. utsahase tvam evaṃnāmā saṃghasya pravāraṇāṃ pravārayitum",
    "XXvinv03_u:21": " iti. saced utsahate tena vaktavyam utsahe.",
    "XXvinv03_u:22": " Pravā-v 2.3.2.3.1.",
    "XXvinv03_u:23": " tataḥ paścād ekena bhikṣuṇā jñaptiṃ kṛtvā karma kartavyam. śṛṇotu bhadantāḥ saṃghaḥ. ayam evaṃnāmā pravārako bhikṣur utsahate saṃghasya",
    "XXvinv03_u:24": " pravāraṇāṃ pravārayitum. sacet saṃghasya prāptakālaṃ kṣametānujānīyāt saṃgho yat saṃgha evaṃnāmānaṃ pravārakaṃ saṃmanyeta. evaṃnāmā pravārako bhikṣuḥ saṃghasya pravāraṇāṃ pravārayitum. eṣā jñaptiḥ.",
    "XXvinv03_u:25": " Pravā-v 2.3.2.3.2.",
    "XXvinv03_u:26": " evaṃ ca karma kartavyam. śṛṇotu bhadantāḥ saṃghaḥ. evaṃnāmā pravārako (Pravā-v 149) bhikṣur utsahate saṃghasya pravāraṇāṃ pravārayitum. tat saṃgha evaṃnāmānaṃ pravārakaṃ bhikṣuṃ saṃmanyeta. ayam evaṃnāmā pravārako",
    "XXvinv03_u:27": " bhikṣuḥ saṃghasya pravāraṇāṃ pravārayiṣyati. yeṣām āyuṣmatāṃ kṣamata",
    "XXvinv03_u:28": " evaṃnāmānaṃ pravārakaṃ bhikṣuṃ saṃmantuṃ yad evaṃnāmā pravārako bhikṣuḥ saṃghasya pravāraṇāṃ pravārayiṣyati te tūṣṇīm. na kṣamate bhāṣantām.",
    "XXvinv03_u:29": " Pravā-v 2.3.2.3.3.",
    "XXvinv03_u:30": " saṃmataḥ saṃghenaivaṃnāmā pravārako bhikṣuḥ. ayam evaṃnāmā pravārako",
    "XXvinv03_u:31": " bhikṣuḥ saṃghasya pravāraṇāṃ pravārayiṣyati. kṣāntam anujñātaṃ saṃghena.",
    "XXvinv03_u:32": " yasmāt tūṣṇīm evam etad dhārayāmi.",
    "XXvinv03_u:33": " Pravā-v 2.3.3.1.",
    "XXvinv03_u:34": " Sanskrit text lost",
    "XXvinv03_u:35": " Pravā-v 2.3.3.2.",
    "XXvinv03_u:36": " Sanskrit text lost",
    "XXvinv03_u:37": " Pravā-v 2.3.3.3.",
    "XXvinv03_u:38": " ... samanvāharāyuṣmann adya saṃghasya pravāraṇā pāñcadaśikā. mamāpy evaṃnāmno bhikṣoḥ pravāraṇā pāñcadaśikā. so 'ham evaṃnāmā bhikṣur bhadantā",
    "XXvinv03_u:39": " tribhiḥ sthānaiḥ pravārayāmi dṛṣṭena śrutena pariśaṅkayā. avavadantu mām āyuṣmaṃtaḥ. anuśāsantu mām āyuṣmantaḥ. anukaṃpakā anukaṃpakā anukaṃpām",
    "XXvinv03_u:40": " upādāya. jānaṃ paśyann āpattiṃ yathādharmaṃ yathāvinayaṃ pratikariṣye.",
    "XXvinv03_u:41": " evaṃ dvir apy evaṃ trir api. ... (extant text from SHT 4473r1).",
    "XXvinv03_u:42": " Pravā-v J 2.3.3.4.",
    "XXvinv03_u:43": " /// pravāravakena pravārayitavyaṃ /// (SHT 4473r2).",
    "XXvinv03_u:44": " (Pravā-v 150)",
    "XXvinv03_u:45": " Pravā-v J 2.3.3.5.",
    "XXvinv03_u:46": " /// pravārayitavyaḥ tataḥ paścād bhikṣuṇyaḥ pravārayanti /// (SHT 4473r3).",
    "XXvinv03_u:47": " Pravā-v J 2.3.3.6.",
    "XXvinv03_u:48": " /// ka sarvair vaktavyaṃ sādhu pravārayitaṃ /// (SHT 4473r4).",
    "XXvinv03_u:49": " Pravā-v J 2.3.4.",
    "XXvinv03_u:50": " /// sitvā |",
    "XXvinv03_u:51": " + tuṃ labhyaṃ bhadaṃta evaṃ /// (SHT 4473r5).",
    "XXvinv03_u:52": " Pravā-v J 3.1.",
    "XXvinv03_u:53": " āyuṣmān upāli buddhaṃ bhagavantaṃ pṛcchati. kati bhadaṃta pravāraṇākarmāni. catvāry upālin. adharmeṇa kurvanti vyagrāḥ. adharmeṇa",
    "XXvinv03_u:54": " samagrāḥ. dharmeṇa vyagrāḥ. dharmeṇa samagrāḥ. (extant text from SHT",
    "XXvinv03_u:55": " Pravā-v J 3.2.",
    "XXvinv03_u:56": " tatraikaṃ dhārmikaṃ pravāraṇākarma yad idaṃ dharmeṇa pravārayaṃti",
    "XXvinv03_u:57": " samagrāḥ. (extant text from SHT 4473v2).",
    "XXvinv03_u:58": " Pravā-v J 4.1.",
    "XXvinv03_u:59": " atha bhagavāṃs tad eva pravāraṇāyāṃ pañcadaśyāṃ purastād bhikṣusaṃghasya prajñapta evāsane niṣaṇṇaḥ. niṣadya bhagavān bhikṣūn āmantrayate sma.",
    "XXvinv03_u:60": " nirgacchanti bhikṣavo rātriḥ. kuruta bhikṣavaḥ pravāraṇām. athānyatamo bhikṣur utthāyāsanād ekāṃsam uttarāsaṅgaṃ kṛtvā yena bhagavāṃs tenāñjaliṃ",
    "XXvinv03_u:61": " praṇamya bhagavantam idam avocat. anyatamasmiṃ bhadaṃtāvāse bhikṣur",
    "XXvinv03_u:62": " ābādhiko duḥkhito bāḍhaglānaḥ. tasyāsmābhiḥ kathaṃ pratipattavyam.",
    "XXvinv03_u:63": " bhagavān āha. pravāraṇāsyānayitavyā. uktaṃ bhagavatā pravāraṇāsyānayitavyeti bhikṣavo na jānate katham ānayitavyeti. bhagavān",
    "XXvinv03_u:64": " āha. ekasyaikena dvayor ekena saṃbahulānāṃ yāvatāṃ vā śaknoti saṃghamadhye nāmāni parikīrtayitum. (extant text from SHT 4473v3-5).",
    "XXvinv03_u:65": " (Pravā-v 151)",
    "XXvinv03_u:66": " Pravā-v J 4.2.",
    "XXvinv03_u:67": " pravāraṇādāyakasyāhaṃ bhikṣava bhikṣor āsamudācārikān dharmān prajñapayiṣyāmi. pravāraṇādāyakena bhikṣuṇaikāṃsam uttarāsaṅgaṃ kṛtvā upānahāv avamucya yathāvṛddhikayā sāmīcīṃ kṛtvotkuṭukena niṣadyāñjaliṃ praṇamyedaṃ syād vacanīyam. samanvāharāyuṣmann adya saṃghasya pravāraṇā",
    "XXvinv03_u:68": " pāñcadaśikā. mamāpy evaṃnāmno bhikṣoḥ pravāraṇā pāñcadaśikā. so 'ham",
    "XXvinv03_u:69": " evaṃnāmā bhikṣuḥ pariśuddham antarāyikair dharmair ātmānaṃ vadāmi.",
    "XXvinv03_u:70": " pravāraṇāyāṃ me pāriśuddhim ārocayāmy. ārocitāṃ ca pravedayāmi. evaṃ dvir apy evaṃ trir",
    "XXvinv03_u:71": " Pravā-v J 4.3.",
    "XXvinv03_u:72": " pravāraṇādāyako bhikṣuḥ sacet kāyavijñaptyā pravāraṇāṃ dadāti dattā pravāraṇā vaktavyā. vāgvijñaptyā dadāti dattā pravāraṇā vaktavyā.",
    "XXvinv03_u:73": " kāyavijñaptyā ca vāgvijñaptyā ca dadāti dattā pravāraṇā vaktavyā. na kāyavijñaptyā na vāgvijñaptyā dadāti sarvasaṃghena vā tatra gantavyaṃ sa vā bhikṣuḥ saṃghamadhye 'vatārayitavyaḥ. na sarvasaṃghas tatra gacchati taṃ ca bhikṣuṃ saṃghe nāvatārayiṣyanti vyagrāḥ kurvanti sātisārā bhavanti.",
    "XXvinv03_u:74": " pravāraṇādāyako bhikṣur yathāprajñaptān āsamudācārikān dharmān na samādāya vartate sātisāro",
    "XXvinv03_u:75": " Pravā-v J 4.4.",
    "XXvinv03_u:76": " pravāraṇāgrāhakasyāhaṃ bhikṣava bhikṣor āsamudācārikān dharmān prajñapayiṣyāmi. pravāraṇāgrāhakena bhikṣuṇā pravāraṇāṃ gṛhītvā na dhāvitavyaṃ na dravitavyaṃ na laṅghayitavyaṃ na parikhā laṅghayitavyā na",
    "XXvinv03_u:77": " pariṣaṇḍā laṅghayitavyā noparivihāyasā sthātavyaṃ na bahiḥsīmāṃ gantavyaṃ naikena pādena dvau niśreṇapadakāv abhiruhitavyau naikena pādena dvau sopānakaḍevarāv abhiruhitavyau na svapitavyaṃ na samāpattavyam. svapiti samāpadyate dvābhyāṃ kāraṇābhyāṃ garhyo bhavati yac cālajjitvena yac ca",
    "XXvinv03_u:78": " vaitarikatvena.",
    "XXvinv03_u:79": " Pravā-v J 4.5.",
    "XXvinv03_u:80": " yadā saṃghasthaviraḥ kathayaty anāgamanāyāyuṣmantaś chandaṃ ca pāriśuddhiṃ",
    "XXvinv03_u:81": " cārocayata, ārocitāṃ ca pravedayateti, tenāntarikasya bhikṣoḥ purataḥ",
    "XXvinv03_u:82": " sthitvā vaktavyam. samanvāharāyuṣmann amuṣminn āvāse bhikṣur ābādhiko duḥkhito bāḍhaglānaḥ. adya saṃghasya pravāraṇā pāñcadaśikā. (69r = GMB",
    "XXvinv03_u:83": " 6.1054) tasyāpi bhikṣoḥ pravāraṇā pāñcadaśikā. so 'yam evaṃnāmā bhikṣus (Pravā-v 152) tribhiḥ sthānaiḥ pravārayati dṛṣṭena śrutena pariśaṅkayā.",
    "XXvinv03_u:84": " pravāraṇe 'sya chandaṃ ca pravāraṇāṃ cārocayāmi. ārocitāṃ ca pravedayāmi.",
    "XXvinv03_u:85": " pravāraṇāgrāhako bhikṣur āsamudācārikān dharmān na samādāya vartate sātisāro bhavati. (GBM 6.1054.1-2; MSV,Wi 43).",
    "XXvinv03_u:86": " Pravā-v J 4.6.",
    "XXvinv03_u:87": " āyuṣmān upālī buddhaṃ bhagavantaṃ pṛcchati. pravāraṇāgrāhakas tāvad bhadanta bhikṣuḥ pravāraṇāṃ gṛhītvā tatraivocchidya kālaṃ kuryāt. ānītā pravāraṇā vaktavyā anānītā. anānītopālin. punar apy ānayitavyā.",
    "XXvinv03_u:88": " pravāraṇāgrāhakas tāvad bhadanta bhikṣuḥ pravāraṇāṃ gṛhītvā saṃghamadhye prāptaḥ kālaṃ kuryāt. ānītā pravāraṇā vaktavyā anānītā. anānītopālin.",
    "XXvinv03_u:89": " punar apy ānayitavyā. (GBM 6.1054.2; MSV,Wi 43).",
    "XXvinv03_u:90": " Pravā-v J 4.7.",
    "XXvinv03_u:91": " āgārikatvaṃ pratijānāti. śramaṇoddeśakatvaṃ ṣaṇḍhakatvaṃ paṇḍakatvaṃ",
    "XXvinv03_u:92": " bhikṣuṇīdūṣakatvaṃ mātṛghātakatvaṃ pitṛghātakatvam arhadghātakatvaṃ saṃghabhedakatvaṃ tathāgatasyāntike duṣṭacittarudhirotpādakatvaṃ tīrthikatvaṃ tīrthikāvakrāntakatvaṃ steyāsaṃvāsikatvaṃ nānāsaṃvāsikatvam asaṃvāsikatvaṃ pratijānāti. ānītā pravāraṇā vaktavyā anānītā |",
    "XXvinv03_u:93": " anānītā upāliṃ |",
    "XXvinv03_u:94": " punar apy ānayitavyā. (GBM 6.1054.3-4; MSV,Wi 43).",
    "XXvinv03_u:95": " Pravā-v J 5.1.1.",
    "XXvinv03_u:96": " āyuṣmān upālī buddhaṃ bhagavantaṃ pṛcchati |",
    "XXvinv03_u:97": " yasmin bhadantāvāse eko bhikṣuḥ prativasati, tena tad eva pravāraṇāyāṃ pañcadaśyāṃ kathaṃ",
    "XXvinv03_u:98": " pratipattavyam. tenopālin bhikṣuṇā vihāraḥ sektavyaḥ saṃmārjitavyaḥ sukumārī gomayakārṣy anupradātavyā. siṃhāsanaṃ prajñapayitavyam*.",
    "XXvinv03_u:99": " āsanaprajñaptiḥ kartavyā. dharmaśravaṇaṃ dātavyam. (GBM 6.1054.5-6; MSV,Wi",
    "XXvinv03_u:100": " Pravā-v J 5.1.2.",
    "XXvinv03_u:101": " tataḥ paścād uccatarake deśe caturdiśaṃ prekṣitavyam.",
    "XXvinv03_u:102": " (Pravā-v 153)",
    "XXvinv03_u:103": " Pravā-v J 5.1.3.1.",
    "XXvinv03_u:104": " sacet pariśuddhāḥ samānadṛṣṭayo bhikṣava āgacchanti, ta idaṃ syur",
    "XXvinv03_u:105": " vaktavyās. tvaritatvaritaṃ tāvad āyuṣmanta āgacchatādya saṃghasya pravāraṇā pāñcadaśikā. mamāpy evaṃnāmno bhikṣoḥ pravāraṇā pāñcadaśikā. so",
    "XXvinv03_u:106": " 'ham evaṃnāmā bhikṣur adya bhadantānāṃ purataḥ pravārayāmi tribhiḥ sthānair dṛṣṭena śrutena pariśaṅkayā. evaṃ dvir apy evaṃ trir api. (GBM",
    "XXvinv03_u:107": " 6.1054.7; MSV,Wi 43).",
    "XXvinv03_u:108": " Pravā-v J 5.1.3.2.",
    "XXvinv03_u:109": " sacet saṃpadyata ity evaṃ kuśalam. no cet saṃpadyate, tena bhikṣuṇā svāsana āsadya cittam ity evam utpādayitavyaṃ vāg bhāṣitavyā. adya saṃghasya pravāraṇā pāṃcadaśikā. mamāpy evaṃnāmno bhikṣoḥ pravāraṇā",
    "XXvinv03_u:110": " pāṃcadaśikā. so 'ham evaṃnāmā bhikṣur adya tāvad pravāraṇām adhitiṣṭhāmi.",
    "XXvinv03_u:111": " pravārayiṣye dṛṣṭena śrutena pariśaṅkayā. evaṃ dvir apy evaṃ trir api |",
    "XXvinv03_u:112": " (GBM 6.1054.8-9; MSV,Wi 43).",
    "XXvinv03_u:113": " Pravā-v 5.2.",
    "XXvinv03_u:114": " yatra dvau bhikṣū prativasatas tatra eṣa evānupūrvī ānyonyam ārocayitavyam*. yatra trayo bhikṣavaḥ prativasanti, tatrāpy ānupūrvyānyonyam ārocayitavyam. yatra catvāro bhikṣavaḥ prativasanti, tair jñaptiṃ kṛtvā pravārayitavyam. no tu pravārako bhikṣuḥ saṃmantavyaḥ. (GBM",
    "XXvinv03_u:115": " 6.1054.9-10; MSV,Wi 43).",
    "XXvinv03_u:116": " Pravā-v 5.3.1.",
    "XXvinv03_u:117": " yatra paṃca bhikṣavaḥ prativasanti, tair jñaptiṃ kṛtvā pravārayitavyaṃ.",
    "XXvinv03_u:118": " pravārako bhikṣuḥ saṃmantavyaḥ. no tu glānasya pravāraṇā (69v = GBM",
    "XXvinv03_u:119": " 6.1053) grahītavyā. (GBM 6.1054.10; MSV,Wi 43).",
    "XXvinv03_u:120": " (Pravā-v 154",
    "XXvinv03_u:121": " Pravā-v 5.3.2.",
    "XXvinv03_u:122": " yatra ṣaḍ vottare vā bhikṣavaḥ prativasanti, tair jñaptiṃ kṛtvā",
    "XXvinv03_u:123": " pravārayitavyam. pravārako bhikṣuḥ saṃmantavyaḥ. glānasya pravāraṇā grahītavyā.",
    "XXvinv03_u:124": " Uddāna 3.",
    "XXvinv03_u:125": " antaroddānam* ||",
    "XXvinv03_u:126": " adhārmikaṃ sthāpanīyam ekavācā pravāraṇā |",
    "XXvinv03_u:127": " kasminn ekā hi kā vācā kriyā upagate hi ca || ||",
    "XXvinv03_u:128": " (GBM 6.1053.1; MSV,Wi 44).",
    "XXvinv03_u:129": " Pravā-v 6.1.",
    "XXvinv03_u:130": " ekaṃ dhārmikaṃ pravāraṇāsthāpanam ekam adhārmikam. trīṇī vā dhārmikāni",
    "XXvinv03_u:131": " pravāraṇāsthāpanāny ekam adhārmikam. pañca vā dhārmikāṇi",
    "XXvinv03_u:132": " pravāraṇāsthāpanāny ekam adhārmikam. (GBM 6.1053.1; MSV,Wi 44).",
    "XXvinv03_u:133": " Pravā-v 6.2.1.",
    "XXvinv03_u:134": " ekaṃ dhārmikaṃ pravāraṇāsthāpanam ekam adhārmikaṃ katamat*. (GBM 6.1053.2;",
    "XXvinv03_u:135": " MSV,Wi 44).",
    "XXvinv03_u:136": " Pravā-v 6.2.2.",
    "XXvinv03_u:137": " ekavācikāyāṃ pravāraṇāyām vāci bhāṣyamāṇāyāṃ aparyavasitāyāṃ pravāraṇāṃ sthāpayati dhārmikaṃ pravāraṇāsthāpanam. (GBM 6.1053.2; MSV,Wi 44).",
    "XXvinv03_u:138": " Pravā-v 6.2.3.",
    "XXvinv03_u:139": " vāci bhāṣitāyāṃ paryavasitāyāṃ pravāraṇāṃ sthāpayaty adhārmikaṃ",
    "XXvinv03_u:140": " pravāraṇāsthāpanam.",
    "XXvinv03_u:141": " Pravā-v 6.2.4.",
    "XXvinv03_u:142": " itīma ekaṃ dhārmikaṃ pravāraṇāsthāpanam ekam adhārmikaṃ |",
    "XXvinv03_u:143": " MSV,Wi 44).",
    "XXvinv03_u:144": " (Pravā-v 155)",
    "XXvinv03_u:145": " Pravā-v 6.3.1.)",
    "XXvinv03_u:146": " trīṇī vā dhārmikāni pravāraṇāsthāpanāni ekam adhārmikaṃ katamat*. (GBM",
    "XXvinv03_u:147": " 6.1053.3; MSV,Wi 44).",
    "XXvinv03_u:148": " Pravā-v 6.3.2.1.",
    "XXvinv03_u:149": " dvivācikāyāṃ pravāraṇāyāṃ prathamāyāṃ vāci bhāṣyamāṇāyām aparyavasitāyāyāṃ pravāraṇāṃ sthāpayati dhārmikaṃ pravāraṇāsthāpanam. (GBM 6.1053.3; MSV,Wi",
    "XXvinv03_u:150": " Pravā-v 6.3.2.2.",
    "XXvinv03_u:151": " prathamāyāṃ vāci bhāṣitāyāṃ paryavasitāyāṃ pravāraṇāṃ sthāpayaty dhārmikaṃ",
    "XXvinv03_u:152": " pravāraṇāsthāpanam.",
    "XXvinv03_u:153": " Pravā-v 6.3.2.3.",
    "XXvinv03_u:154": " dvitīyāyāṃ vāci bhāṣyamāṇāyāṃ aparyavasitāyāyāṃ pravāraṇāṃ sthāpayati dhārmikaṃ pravāraṇāsthāpanam. (GBM 6.1053.4; MSV,Wi 44).",
    "XXvinv03_u:155": " Pravā-v 6.3.3.",
    "XXvinv03_u:156": " dvitīyāyāṃ vāci bhāṣitāyāṃ paryavasitāyāṃ pravāraṇāṃ sthāpayaty adhārmikaṃ",
    "XXvinv03_u:157": " pravāraṇāsthāpanam.",
    "XXvinv03_u:158": " Pravā-v 6.3.4.",
    "XXvinv03_u:159": " itīmāni trīṇi dhārmikāṇi pravāraṇāsthāpanāny ekam adhārmikam.",
    "XXvinv03_u:160": " Pravā-v 6.4.1.",
    "XXvinv03_u:161": " pañca vā dhārmikāṇi pravāraṇāsthāpanāny ekam adhārmikaṃ katamat*. (GBM",
    "XXvinv03_u:162": " 6.1053.5; MSV,Wi 44).",
    "XXvinv03_u:163": " Pravā-v 6.4.2.1.",
    "XXvinv03_u:164": " trivācikāyāṃ pravāraṇāyāṃ prathamāyāṃ vāci bhāṣyamāṇāyām aparyavasitāyāṃ pravāraṇāṃ sthāpayati dhārmikaṃ pravāraṇāsthāpanam. (GBM 6.1053.5; MSV,Wi",
    "XXvinv03_u:165": " Pravā-v 6.4.2.2.",
    "XXvinv03_u:166": " prathamāyāṃ vāci bhāṣitāyāṃ paryavasitāyāṃ pravāraṇāṃ sthāpayati dhārmikaṃ",
    "XXvinv03_u:167": " pravāraṇāsthāpanam.",
    "XXvinv03_u:168": " (Pravā-v 156)",
    "XXvinv03_u:169": " Pravā-v 6.4.2.3.",
    "XXvinv03_u:170": " dvitīyāyāṃ vāci bhāṣyamāṇāyām aparyavasitāyāṃ pravāraṇāṃ sthāpayati dhārmikaṃ pravāraṇāsthāpanaṃ",
    "XXvinv03_u:171": " (GBM 6.1053.6; MSV,Wi 44).",
    "XXvinv03_u:172": " Pravā-v 6.4.2.4.",
    "XXvinv03_u:173": " dvitīyāyāṃ vāci bhāṣitāyāṃ paryavasitāyāṃ pravāraṇāṃ sthāpayati dhārmikaṃ",
    "XXvinv03_u:174": " pravāraṇāsthāpanam. (GBM 6.1053.6; MSV,Wi 44).",
    "XXvinv03_u:175": " Pravā-v 6.4.2.5.",
    "XXvinv03_u:176": " tṛtīyāyāṃ vāci bhāṣyamāṇāyām aparyavasitāyāṃ pravāraṇāṃ sthāpayati dhārmikaṃ pravāraṇāsthāpanam.",
    "XXvinv03_u:177": " Pravā-v 6.4.3.",
    "XXvinv03_u:178": " tṛtīyāyāṃ vāci bhāṣitāyāṃ paryavasitāyāṃ pravāraṇāṃ sthāpayaty adhārmikaṃ",
    "XXvinv03_u:179": " pravāraṇāsthāpanaṃ. (GBM 6.1053.7; MSV,Wi 44).",
    "XXvinv03_u:180": " Pravā-v 6.4.4.",
    "XXvinv03_u:181": " itīmāni pañca dhārmikāṇi pravāraṇāsthāpanāny ekam adhārmikam. (GBM",
    "XXvinv03_u:182": " 6.1053.7; MSV,Wi 44).",
    "XXvinv03_u:183": " Pravā-v 7.1.",
    "XXvinv03_u:184": " asty ekavācikā pravāraṇā, dvivācikā pravāraṇā, trivācikā pravāraṇā,",
    "XXvinv03_u:185": " gaṇapravāraṇā. kasminn arthe ekavācikā pravāraṇā.",
    "XXvinv03_u:186": " Uddāna 4.",
    "XXvinv03_u:187": " antaroddānam ||",
    "XXvinv03_u:188": " arśā ca varṣā ca rājā madhuraṃ dharmaṃ viniścayaṃ |",
    "XXvinv03_u:189": " saṃgho 'ntarāyapatitaḥ ayaṃ saṃgṛhīto gaṇaḥ || ||",
    "XXvinv03_u:190": " (GBM 6.1053.8; MSV,Wi 44).",
    "XXvinv03_u:191": " Pravā-v 7.2.1.1.1.",
    "XXvinv03_u:192": " yathāpi tat tad eva pravāraṇāyāṃ pañcadaśyāṃ sambahulā bhikṣavaḥ ...",
    "XXvinv03_u:193": " (Pravā-v 157)",
    "XXvinv03_u:194": " Pravā-v 7.2.1.1.2.",
    "XXvinv03_u:195": " tatra pravārakasya bhikṣor evaṃ bhavati. adya saṃghasya pravāraṇā",
    "XXvinv03_u:196": " pāṃcadaśikā |",
    "XXvinv03_u:197": " ime ca saṃbahulā bhikṣavaḥ ... (GBM 6.1053.9; MSV,Wi 44).",
    "XXvinv03_u:198": " Pravā-v 7.2.1.1.3.",
    "XXvinv03_u:199": " ahaṃ cet trivācikayā pravāraṇayā pravārayeyaṃ, ... yanv aham ekavācikayā",
    "XXvinv03_u:200": " pravāraṇayā pravārayeyam. sa ekavācikayā pravāraṇayā pravārayati |",
    "XXvinv03_u:201": " asminn arthe ekavācikā (70r) pravāraṇā. (GBM 6.1053.10; MSV,Wi 44).",
    "XXvinv03_u:202": " For Pravā-v 7.2.1.2.1-7.2.1.8.1 the Sanskrit text of the manuscript (fol.",
    "XXvinv03_u:203": " 70) is lost. The extant text is from a fragment of the Pravāraṇāvastu of the Mūlasarvāstivādin from the Turfan Collection (SHT VI 1578).",
    "XXvinv03_u:204": " Pravā-v 7.2.1.2.1.",
    "XXvinv03_u:205": " aparasminn artha ekavācikā pravāraṇā. yathāpi tat tad eva pravāraṇāyāṃ pañcadaśyāṃ saṃbahulāni bhavanti śayanāsanāny abhyavakāśe upanikṣiptāni.",
    "XXvinv03_u:206": " devaḥ pravarṣati ... (SHT VI 1578r1).",
    "XXvinv03_u:207": " Pravā-v 7.2.1.2.2.",
    "XXvinv03_u:208": " tatra pravārakasya bhikṣor evaṃ bhavati. adya saṃghasya pravāraṇā",
    "XXvinv03_u:209": " pāṃcadaśikā. sambahulāni ca bhavanti śayanāsanāny abhyavakāśe upanikṣiptāni. devaḥ pravarṣati ... (SHT VI 1578r2-3).",
    "XXvinv03_u:210": " Pravā-v 7.2.1.2.3.",
    "XXvinv03_u:211": " ahaṃ cet trivācikayā pravāraṇayā pravārayeyaṃ, śayanāsanāni na śaknomy",
    "XXvinv03_u:212": " anārdram(?) upasaṃhārayitum(?). yanv ahaṃ ekavācikayā pravāraṇayā",
    "XXvinv03_u:213": " pravārayeyam. sa ekavācikayā pravāraṇayā pravārayati. asminn artha ekavācikā pravāraṇā. (SHT VI 1578r3-4).",
    "XXvinv03_u:214": " (Pravā-v 158)",
    "XXvinv03_u:215": " Pravā-v 7.2.1.3.1.",
    "XXvinv03_u:216": " aparasminn artha ekavācikā pravāraṇā. yathāpi tat tad eva pravāraṇāyāṃ pañcadaśyāṃ rājā svakīyaiḥ sārdhaṃ devībhiḥ kumārair amātyair bhaṭabalāgrair nigamajānapadair ārāmam āgacchati. rājñā saṃghasya prabhūto",
    "XXvinv03_u:217": " vastralābhaḥ āmiṣalābhaḥ dattaḥ. devībhir api kumārair amātyair bhaṭabalāgrair nigamajānapadair prabhūto vastralābha āmiṣalābho dattaḥ.",
    "XXvinv03_u:218": " udghoṣakena ca bhikṣuṇā udghoṣaya ... (SHT VI 1578r4-v1).",
    "XXvinv03_u:219": " Pravā-v 7.2.1.3.2.",
    "XXvinv03_u:220": " tatra pravārakasya bhikṣor evaṃ bhavati. adya saṃghasya pravāraṇā",
    "XXvinv03_u:221": " pāṃcadaśikā. rājā ca svakīyaiḥ sārdhaṃ devībhiḥ kumāraiḥ amātyaiḥ bhaṭabalāgrair nigamajānapadair ārāmam āgacchati. rājñā saṃghasya prabhūto",
    "XXvinv03_u:222": " vastralābha āmiṣalābho dattaḥ. devībhir api kumārair amātyair bhaṭabalāgrair nigamajānapadaiḥ prabhūto vastralābha āmiṣalābho dattaḥ.",
    "XXvinv03_u:223": " udghoṣakena ca bhikṣunā udghoṣaya ... (SHT VI 1578v2-3).",
    "XXvinv03_u:224": " Pravā-v 7.2.1.3.3.",
    "XXvinv03_u:225": " ahaṃ cet trivācikayā pravāraṇayā pravārayeyaṃ, na śaknomi ...",
    "XXvinv03_u:226": " pravārayitum. yanv aham ekavācikayā pravāraṇayā pravārayeyam. sa ekavācikayā pravāraṇayā pravārayati. asminn arthe ekavācikā pravāraṇā.",
    "XXvinv03_u:227": " (SHT VI 1578v4-5).",
    "XXvinv03_u:228": " Pravā-v 7.2.1.8.1.",
    "XXvinv03_u:229": " aparasminn artha ekavācikā pravāraṇā. yathāpi tat tad eva pravāraṇāyāṃ pañcadaśyāṃ corā grāmaṃ nirghātayanti nagaraṃ vā nigamaṃ vā. ārāmadvāram āgatya gāṃ hatvā mahiṣīṃ chagalikāṃ vā rudhirāṅgakāni rudhiravilekhakāni",
    "XXvinv03_u:230": " kṛtvā bhikṣūṇāṃ dūtam anupreṣayanti. nirgacchantv āryāḥ. vayam atra vatsyāmaḥ.",
    "XXvinv03_u:231": " Pravā-v 7.2.1.8.2.",
    "XXvinv03_u:232": " tatra pravārakasya bhikṣor evaṃ bhavati. adya saṃghasya pravāraṇā",
    "XXvinv03_u:233": " pāñcadaśikā. corāś ca grāmaṃ nirghātayanti nagaraṃ vā nigamaṃ vā. (71r =",
    "XXvinv03_u:234": " GBM 6.724) (Pravā-v 159) ārāmadvāram āgatya gāṃ hatvā mahiṣīṃ chagalikāṃ",
    "XXvinv03_u:235": " vā rudhirāṃgakāni rudhiravilekhakāni kṛtvā bhikṣūṇāṃ dūtam anupreṣayanti.",
    "XXvinv03_u:236": " nirgacchantv āryāḥ. vayam atra vatsyāmaḥ. (GBM 6.724.1; MSV IV 119.1-3).",
    "XXvinv03_u:237": " Pravā-v 7.2.1.8.3.",
    "XXvinv03_u:238": " ahaṃ cet trivācikayā pravāraṇayā pravārayeyaṃ, syān me atonidānaṃ",
    "XXvinv03_u:239": " jīvitāntarāyaḥ śrāmaṇyāntarāyo brahmacaryāntarāyaḥ. yanv aham ekavācikayā",
    "XXvinv03_u:240": " pravāraṇayā pravārayeyaṃ. sa ekavācikayā pravāraṇayā pravārayati. asminn arthe ekavācikā pravāraṇā. Pravā-v 7.2.1.9.1.",
    "XXvinv03_u:241": " aparasminn arthe ekavācikā pravāraṇā. yathāpi tat tad eva paṃcadaśyāṃ pravāraṇāyāṃ anyatamena mahallena bālena mūḍhenāvyaktenākuśalena gocare vā gocaramārge vā kulastrī vā kulakumārī vā ākruṣṭā bhavaty ābhāṣṭā parāmṛṣṭā vā. manuṣyāḥ prakupitā ārāmadvāram āgatya yathā gṛhītakān udghoṣayanti.",
    "XXvinv03_u:242": " gṛḥṇaṃtu bhavaṃtaḥ śramaṇāṃ śākyaputrīyāṃ. hanaṃtu. badhnaṃtu.",
    "XXvinv03_u:243": " pravāsayaṃtu. rājñaḥ hastyārohā bhaviṣyanty aśvārohā iṣṭakārohā dhvajārohāḥ patākārohā vā. pṛthag rājakṛtyāni rājakaraṇīyāni kariṣyaṃti.",
    "XXvinv03_u:244": " Pravā-v 7.2.1.9.2.",
    "XXvinv03_u:245": " tatra pravārakasya bhikṣor evaṃ bhavati. adya saṃghasya pravāraṇā",
    "XXvinv03_u:246": " pāṃcadaśikā. anyatamena ca mahallakena mūḍhenāvyaktenākuśalena gocare vā",
    "XXvinv03_u:247": " gocaramārge vā kulastrī vā kulakumārī vā ākruṣṭā bhavaty ābhāṣṭā parāmṛṣṭā",
    "XXvinv03_u:248": " vā. manuṣyāḥ prakupitāḥ ārāmadvāram āgatya yathā gṛhītakān udghoṣayaṃti.",
    "XXvinv03_u:249": " gṛhṇaṃtu bhavantaḥ śramaṇāṃ śākyaputrīyāṃ. hanaṃtu. badhnaṃtu.",
    "XXvinv03_u:250": " pravāsayantu. rājñaḥ hastyārohā bhaviṣyanty (Pravā-v 160) aśvārohā iṣṭakārohā dhvajārohāḥ patākārohā vā. pṛthag rājakṛtyāni rājakaraṇīyāni",
    "XXvinv03_u:251": " kariṣyaṃti. (GBM 6.724.4-6; MSV IV 119.14-120.2).",
    "XXvinv03_u:252": " Pravā-v 7.2.1.9.3.",
    "XXvinv03_u:253": " ahaṃ cet trivācikayā pravāraṇayā pravārayeyaṃ, syān me atonidānaṃ",
    "XXvinv03_u:254": " jīvitāntarāyaḥ śrāmaṇyāntarāyo brahmacaryāntarāyaḥ. yanv aham ekavācikayā",
    "XXvinv03_u:255": " pravāraṇayā pravārayeyaṃ. sa ekavācikayā pravāraṇayā pravārayati |",
    "XXvinv03_u:256": " asminn arthe ekavācikā pravāraṇā. (GBM 6.724.6-7; MSV IV 120.2-6).",
    "XXvinv03_u:257": " Pravā-v 7.2.1.10.1.",
    "XXvinv03_u:258": " aparasminn artha ekavācikā pravāraṇā. yathāpi tad vihāraḥ amanuṣyādhyuṣite pradeśe pratiṣṭhāpito bhavati |",
    "XXvinv03_u:259": " anyatamena ca mahallena bālena mūḍhenāvyaktenākuśalenāpratirūpe pradeśa uccāraprasrāvaṃ kheṭaṃ śiṅghāṇakaṃ vāntaṃ viriktaṃ choritam aśucimrakṣitaṃ vā śayanāsanaṃ",
    "XXvinv03_u:260": " pravikṣiptaṃ. amanuṣyāḥ prakupitāḥ gocare 'pi tiṣṭhaṃti gocaramārge 'pi",
    "XXvinv03_u:261": " caṃkrame 'pi meḍhyām api dvārakoṣṭhake 'pi. bhikṣūn apy āviśaṃti, mañcān api saṃparivartayanti. Pravā-v 7.2.1.10.2.",
    "XXvinv03_u:262": " tatra pravārakasya bhikṣor evaṃ bhavati : adya saṃghasya pravāraṇā",
    "XXvinv03_u:263": " pāṃcadaśikā. ayaṃ ca vihāro 'manuṣyādhyuṣite pradeśe pratiṣṭhāpitaḥ.",
    "XXvinv03_u:264": " anyatamena ca mahallena bālena mūḍhenāvyaktenākuśalenāpratirūpe pradeśa",
    "XXvinv03_u:265": " (Pravā-v 161) uccāraprasrāvaṃ kheṭaṃ śiṅghāṇakaṃ vāntaṃ viriktaṃ choritam",
    "XXvinv03_u:266": " aśucimrakṣitaṃ vā śayanāsanaṃ pravikṣiptaṃ. amanuṣyāḥ prakupitā gocare 'pi",
    "XXvinv03_u:267": " tiṣṭhanti gocaramārge 'pi caṅkrame 'pi meḍhyām api dvārakoṣṭhake 'pi.",
    "XXvinv03_u:268": " bhikṣūn apy āviśanti, mañcān api saṃparivartayanti. (GBM 6.724.8-9; MSV IV 120.12-14).",
    "XXvinv03_u:269": " Pravā-v 7.2.1.10.3.",
    "XXvinv03_u:270": " ahaṃ cet trivācikayā pravāraṇayā pravārayeyaṃ, syān me atonidānaṃ",
    "XXvinv03_u:271": " jīvitāntarāyaḥ śrāmaṇyāntarāyo brahmacaryāntarāyaḥ. yanv aham ekavācikayā",
    "XXvinv03_u:272": " pravāraṇayā pravārayeyam. sa ekavācikayā pravāraṇayā pravārayati. asminn arthe ekavācikā pravāraṇā.",
    "XXvinv03_u:273": " Pravā-v 7.2.1.11.1.",
    "XXvinv03_u:274": " aparasminn artha ekavācikā pravāraṇā. yathāpi tad vihāro vyāḍādhyuṣite pradeśe pratiṣṭhāpito bhavati. anyatamena ca mahallena bālena mūḍhenāvyaktenākuśalenāpratirūpe pradeśa uccāraprasrāvaṃ kheṭaṃ śiṅghāṇakaṃ vāntaṃ viriktaṃ choritam aśucimrakṣitaṃ vā śayanāsanaṃ",
    "XXvinv03_u:275": " pravikṣiptam. vyāḍāḥ prakupitā gocare 'pi tiṣṭhanti gocaramārge 'pi",
    "XXvinv03_u:276": " caṅkrame 'pi meḍhyām api dvārakoṣṭhake 'pi. bhikṣūn apy āviśanti, mañcān api saṃparivartayanti.",
    "XXvinv03_u:277": " Pravā-v 7.2.1.11.2.",
    "XXvinv03_u:278": " tatra pravārakasya bhikṣor evaṃ bhavati. adya saṃghasya pravāraṇā",
    "XXvinv03_u:279": " pāṃcadaśikā. ayaṃ ca vihāro vyāḍādhyuṣite pradeśe pratiṣṭhāpitaḥ.",
    "XXvinv03_u:280": " anyatamena ca bālena mūḍhenāvyaktenākuśalena apratirūpe pradeśe uccāraprasrāvaṃ kheṭaṃ śiṅghāṇakaṃ vāntaṃ viriktaṃ choritam aśucimrakṣitaṃ vā śayanāsanaṃ pravikṣiptaṃ. vyāḍāḥ prakupitāḥ gocare 'pi tiṣṭhanti gocaramārge 'pi caṃkrame 'pi meḍhyām api dvārakoṣṭhake 'pi. bhikṣūn apy āviśaṃti, mañcān api saṃparivartayanti. (GBM 6.724.9-10; MSV IV 120.14-18).",
    "XXvinv03_u:281": " Pravā-v 7.2.1.11.3.",
    "XXvinv03_u:282": " ahaṃ cet trivācikayā pravāraṇayā pravārayeyaṃ, syān me atonidānaṃ",
    "XXvinv03_u:283": " jīvitāntarāyaḥ śrāmaṇyāntarāyo brahmacaryāntarāyaḥ. yanv aham (Pravā-v",
    "XXvinv03_u:284": " 162) ekavācikayā (71v = GBM 6.725) pravāraṇayā pravārayeyaṃ. sa ekavācikayā pravāraṇayā pravārayati",
    "XXvinv03_u:285": " asminn arthe ekavācikā pravāraṇā |",
    "XXvinv03_u:286": " Pravā-v 7.2.1.12.1.",
    "XXvinv03_u:287": " aparasminn arthe ekavācikā pravāraṇā. yathāpi tad vihāraḥ nāgādhyuṣite pradeśe pratiṣṭhāpito bhavati. anyatamena ca mahallena bālena mūḍhenāvyaktenākuśalena apratirūpe pradeśe uccāraprasrāvaṃ kheṭaṃ",
    "XXvinv03_u:288": " śiṅghāṇakaṃ vāntaṃ viriktaṃ choritaṃ aśucimrakṣitaṃ vā śayanāsanaṃ",
    "XXvinv03_u:289": " pravikṣiptaṃ. nāgāḥ prakupitāḥ gocare 'pi tiṣṭhaṃti gocaramārge 'pi",
    "XXvinv03_u:290": " caṃkrame 'pi meḍhyām api dvārakoṣṭhake 'pi. bhikṣūn apy āviśaṃti maṃcān api saṃparivartayanti. Pravā-v 7.2.1.12.2.",
    "XXvinv03_u:291": " tatra pravārakasya bhikṣor evaṃ bhavaty. adya saṃghasya pravāraṇā",
    "XXvinv03_u:292": " pāṃcadaśikā. ayaṃ ca vihāraḥ nāgādhyuṣite pradeśe pratiṣṭhāpitaḥ.",
    "XXvinv03_u:293": " anyatamena ca mahallena bālena mūḍhenāvyaktenākuśalena apratirūpe pradeśe uccāraprasrāvaṃ kheṭaṃ śiṅghāṇakaṃ vāntaṃ viriktaṃ choritam aśucimrakṣitaṃ vā śayanāsanaṃ pravikṣiptaṃ. nāgāḥ prakupitāḥ gocare 'pi tiṣṭhaṃti gocaramārge 'pi caṃkrame 'pi meḍhyām api dvārakoṣṭhake 'pi bhikṣūn apy āviśaṃti |",
    "XXvinv03_u:294": " maṃcān api saṃparivartayaṃti. (GBM 6.725.3-4; MSV IV 121.9-15).",
    "XXvinv03_u:295": " Pravā-v 7.2.1.12.3.",
    "XXvinv03_u:296": " ahaṃ cet trivācikayā pravāraṇayā pravārayeyaṃ, syān me atonidānaṃ",
    "XXvinv03_u:297": " jīvitāntarāyaḥ śrāmaṇyāntarāyo brahmacaryāntarāyaḥ. yanv aham ekavācikayā",
    "XXvinv03_u:298": " pravāraṇayā pravārayeyaṃ. sa ekavācikayā pravāraṇayā pravārayati |",
    "XXvinv03_u:299": " asminn arthe ekavācikā pravāraṇā. (GBM 6.725.4-5; MSV IV 121.15-19).",
    "XXvinv03_u:300": " Pravā-v 7.2.1.13.1.",
    "XXvinv03_u:301": " aparasminn arthe ekavācikā pravāraṇā. yathāpi tad vihāraḥ dāvamadhye pratiṣṭhāpito bhavati. agnir mukta ity agnir grāmanigamarājarāṣṭradhānīṃ dahaṃ paraiti. gocaram api dahati gocaramārgam api caṃkramam (Pravā-v 163)",
    "XXvinv03_u:302": " api meḍhīm api dvārakoṣṭhakam api. vihāram api dahati vihārasāmantakam",
    "XXvinv03_u:303": " api. (GBM 6.725.5-6; MSV IV 121.20-122.3).",
    "XXvinv03_u:304": " Pravā-v 7.2.1.13.2.",
    "XXvinv03_u:305": " tatra pravārakasya bhikṣor evaṃ bhavati |",
    "XXvinv03_u:306": " adya saṃghasya pravāraṇā pāṃcadaśikā : ayaṃ ca vihāro dāvamadhye pratiṣṭhāpitaḥ. agnir mukta",
    "XXvinv03_u:307": " agnir grāmanigamarājarāṣṭradhānīṃ dahaṃ paraiti. gocaram api dahati",
    "XXvinv03_u:308": " gocaramārgam api caṃkramam api meḍhīm api dvārakoṣṭhakam api. vihāram api dahati vihārasāmantakam api. (GBM 6.725.6-7; MSV IV 122.3-7).",
    "XXvinv03_u:309": " Pravā-v 7.2.1.13.3.",
    "XXvinv03_u:310": " ahaṃ cet trivācikayā pravāraṇayā pravārayeyaṃ, syān me atonidānaṃ",
    "XXvinv03_u:311": " jīvitāntarāyaḥ śrāmaṇyāntarāyaḥ brahmacaryāntarāyaḥ. yanv aham ekavācikayā",
    "XXvinv03_u:312": " pravāraṇayā pravārayeyaṃ. sa ekavācikayā pravāraṇayā pravārayati. asminn arthe ekavācikā pravāraṇā Pravā-v 7.2.1.14.1.",
    "XXvinv03_u:313": " aparasminn arthe ekavācikā pravāraṇā. yathāpi tad vihāraḥ anūpamadhye pratiṣṭhāpito bhavati",
    "XXvinv03_u:314": " upari parvatasaṃkṣepe sthūlabinduko devo varṣaṃ grāmanigamarājarāṣṭradhānīṃ vahaṃ paraiti. gocaram api vahati |",
    "XXvinv03_u:315": " gocaramārgam api caṃkramam api meḍhīm api dvārakoṣṭhakam api. vihāram api saṃsvedayati. Pravā-v 7.2.1.14.2.",
    "XXvinv03_u:316": " tatra pravārakasya bhikṣor evaṃ bhavaty. adya saṃghasya pravāraṇā",
    "XXvinv03_u:317": " pāṃcadaśikā. ayaṃ vihāro 'nūpamadhye pratiṣṭhāpitaḥ. upari parvatasaṃkṣepe sthūlabinduko devo varṣaṃ grāmanigamarājarāṣṭradhānīṃ vahan paraiti.",
    "XXvinv03_u:318": " gocaram api vahati gocaramārgam api caṃkramam api meḍhīm api dvārakoṣṭhakam api. (72r = GBM 6.726) vihāram api saṃsvedayati. (GBM",
    "XXvinv03_u:319": " (Pravā-v 164)",
    "XXvinv03_u:320": " Pravā-v 7.2.1.14.3.",
    "XXvinv03_u:321": " ahaṃ cet trivācikayā pravāraṇayā pravārayeyaṃ, syān me atonidānaṃ",
    "XXvinv03_u:322": " jīvitāntarāyaḥ śrāmaṇyāntarāyo brahmacaryāntarāyaḥ. yanv aham ekavācikayā",
    "XXvinv03_u:323": " pravāraṇayā pravārayeyaṃ. sa ekavācikayā pravāraṇayā pravārayati. asminn arthe ekavācikā pravāraṇā",
    "XXvinv03_u:324": " Pravā-v 7.2.2.",
    "XXvinv03_u:325": " kasminn arthe dvivācikā pravāraṇā. yatra tṛtīyāyāṃ vācy avakāśo na bhavati",
    "XXvinv03_u:326": " | tatra dvivācikayā pravāraṇayā pravārayati |",
    "XXvinv03_u:327": " asminn arthe dvivācikā pravāraṇā |",
    "XXvinv03_u:328": " Pravā-v 7.2.3.",
    "XXvinv03_u:329": " kasminn arthe trivācikā pravāraṇā. samāvasthāyāḥ. (GBM 6.726.2; MSV IV 123.5).",
    "XXvinv03_u:330": " Pravā-v 7.3.",
    "XXvinv03_u:331": " kasminn arthe gaṇapravāraṇā. yathāpi tad bhayaṃ bhavati |",
    "XXvinv03_u:332": " aṭavīṃ saṃkṣobhāś cakrasamārūḍhā janapadās tena te 'nvāhiṇḍanti. tatra bhikṣubhir cīvaravisikāsu cīvaraṃ ca kuṇḍīṃ baddhvā anyonyam avalokya prakramitavyaṃ.",
    "XXvinv03_u:333": " adyāyuṣmantaḥ saṃghasya pravāraṇā pāṃcadaśikā |",
    "XXvinv03_u:334": " yadā saṃghasāmagrīṃ lapsyāmaḥ tadā pravārayiṣyāmaḥ. asminn arthe gaṇapravāraṇā. (GBM",
    "XXvinv03_u:335": " (Pravā-v 165)",
    "XXvinv03_u:336": " Pravā-v 8.1.",
    "XXvinv03_u:337": " āyuṣmān upālī buddhaṃ bhagavantaṃ pṛcchati. yathāpi tad bhadaṃta bhikṣava idam evaṃrūpaṃ kṛyākāraṃ kṛtvā varṣāṃ upagacchaṃti |",
    "XXvinv03_u:338": " yasyāsmākam āyuṣmanto 'ntarvarṣe jñātir āgacched, dātavyā pravāraṇā : deyā bhadanta pravāraṇā",
    "XXvinv03_u:339": " deyā. deyā upāliṃ |",
    "XXvinv03_u:340": " Pravā-v 8.2.1-2.",
    "XXvinv03_u:341": " Sanskrit text has been omitted in the manuscript",
    "XXvinv03_u:342": " Pravā-v 9.1.1.",
    "XXvinv03_u:343": " saced vastuṃ sthāpayet* na pudgalaṃ, deyā pravāraṇā na deyā. nopāliṃ. sa idaṃ syād vacanīyaḥ. na vayam āyuṣmann ityarthaṃ sanniṣaṇṇāḥ sannipatitāḥ.",
    "XXvinv03_u:344": " kasmād āyuṣmaṃ vastuṃ sthāpayer na pudgalaṃ. api tv ātmaviśuddhyarthaṃ",
    "XXvinv03_u:345": " pravāraṇā uktā bhagavatā. saced ākāṃkṣasi, pravāraya. (GBM 6.726.4-5; MSV IV 123.13-17).",
    "XXvinv03_u:346": " Pravā-v 9.1.2.",
    "XXvinv03_u:347": " sacet pudgalaṃ sthāpayati na vastuṃ |",
    "XXvinv03_u:348": " deyā pravāraṇā na deyā |",
    "XXvinv03_u:349": " nopāliṃ |",
    "XXvinv03_u:350": " sa idaṃ syād vacanīyaḥ. na vayam āyuṣmann ityarthaṃ sanniṣaṇṇāḥ sannipatitāḥ. kasmād āyuṣmaṃ pudgalaṃ sthāpayer na vastum. api tv ātmaviśuddhyarthaṃ pravāraṇā uktā bhagavatā. saced ākāṃkṣasi, pravāraya :",
    "XXvinv03_u:351": " Pravā-v 9.1.3.",
    "XXvinv03_u:352": " saced vastuṃ sthāpayati pudgalaṃ ca, deyā pravāraṇā na deyā. nopāliṃ. sa idaṃ syād vacanīyaḥ Pravā-v 9.1.4.",
    "XXvinv03_u:353": " ... etān ākārān sthāpayitvā : || || (GBM 6.726.6; MSV IV 124.2-3).",
    "XXvinv03_u:354": " (Pravā-v 166)",
    "XXvinv03_u:355": " Uddāna 5.",
    "XXvinv03_u:356": " uddānam* ||",
    "XXvinv03_u:357": " bhikṣuṃ ca rājā gṛhṇāti smarec ca daśikābhiś ca |",
    "XXvinv03_u:358": " āpattyāḥ saptikāṃ kuryāc codanāṃ hi ca saptakāṃ || ||",
    "XXvinv03_u:359": " Pravā-v 9.2.",
    "XXvinv03_u:360": " yathāpi tat tad eva pravāraṇāyāṃ paṃcadaśyāṃ bhikṣū rājñā gṛhīto bhavati corair vā dhūrtair vā vadhakaiḥ pratyarthibhiḥ pratyamitraiḥ. tasya bhikṣubhir dūto 'nupreṣayitavyaḥ. muṃcainaṃ bhikṣuṃ. sabrahmacāry eṣo 'smākaṃ. sacen muṃcatīty evaṃ kuśalaṃ. no cen muṃcati, dvitīyo dūto 'nupreṣayitavyaḥ |",
    "XXvinv03_u:361": " muṃcainaṃ bhikṣum. asty asmākam anena sārdhaṃ kiṃcid eva karaṇīyaṃ. sacen muṃcatīty evaṃ kuśalaṃ. no cen muṃcati, bhikṣubhir maṇḍalakaṃ gatvā pravārayitavyaṃ. tataḥ paścād dvitīye divase tasya bhikṣor mokṣāyodyuñjitavyaṃ. saced udyuñjantīty evaṃ kuśalaṃ. no ced udyuṃjanti sātisārā bhavaṃti. (GBM 6.726.7-9; MSV IV 124.6-14).",
    "XXvinv03_u:362": " Pravā-v 9.3.1.",
    "XXvinv03_u:363": " yathāpi tat tad eva pravāraṇāyāṃ paṃcadaśyāṃ bhikṣur āpattiṃ smarati. tena bhikṣuṇā sāpattir bhikṣoḥ purastād yathādharmaṃ pratikartavyā : tataḥ paścāt pravārayitavyaṃ. evaṃ hi pravārayitavyaṃ. na tv evāhaṃ pravāraṇāyā antarāyaṃ vadāmi |",
    "XXvinv03_u:364": " pūrvavad yāvad yathā poṣadhavastuny evaṃ vistareṇa daśikā kartavyā |",
    "XXvinv03_u:365": " Pravā-v 9.3.2.1.",
    "XXvinv03_u:366": " yathāpi tat tad eva pravāraṇāyāṃ paṃcadaśyāṃ bhikṣur āpattiṃ pratijānāti.",
    "XXvinv03_u:367": " (Pravā-v 167)",
    "XXvinv03_u:368": " Pravā-v 9.3.2.2.",
    "XXvinv03_u:369": " sacet pārājikāṃ pratijānāti |",
    "XXvinv03_u:370": " nāśayitvā pravārayitavyaṃ. (GBM 6.726.10;",
    "XXvinv03_u:371": " Pravā-v 9.3.2.3.",
    "XXvinv03_u:372": " sacet saṃghāvaśeṣāṃ pratijānāti, adhiṣṭhāya pravārayitavyaṃ. (GBM",
    "XXvinv03_u:373": " Pravā-v 9.3.2.4.",
    "XXvinv03_u:374": " sacet pāyantikāṃ pratideśanīyāṃ (72v = GBM 6.727) duṣkṛtāṃ pratijānāti |",
    "XXvinv03_u:375": " deśayitvā pravārayitavyaṃ. (GBM 6.726.10-727.1; MSV IV 125.1-2).",
    "XXvinv03_u:376": " Pravā-v 9.3.3.1.",
    "XXvinv03_u:377": " yathāpi tat tad eva pravāraṇāyāṃ pañcadaśyāṃ vastv aviditaṃ bhavati. kecin",
    "XXvinv03_u:378": " niravaśeṣasaṃjñinaḥ, kecit sāvaśeṣasaṃjñinaḥ. tatra ye niravaśeṣasaṃjñinas",
    "XXvinv03_u:379": " tair nāśayitvā pravārayitavyaṃ. ye sāvaśeṣasaṃjñinas tair adhiṣṭhāya pravārayitavyaṃ |",
    "XXvinv03_u:380": " Pravā-v 9.3.3.2.",
    "XXvinv03_u:381": " yathāpi tat tad eva pravāraṇāyāṃ paṃcadaśyām āpattir aviniścitā bhavati |",
    "XXvinv03_u:382": " kecid deśanākaraṇīyam ity āhuḥ |",
    "XXvinv03_u:383": " kecit saṃvaraṇīyam ity āhuḥ |",
    "XXvinv03_u:384": " tatra ye deśanākaraṇīyam ity āhuḥ tair deśayitvā pravārayitavyam. ye saṃvaraṇīyam ity āhuḥ tais saṃvaraṇaṃ kṛtvā pravārayitavyaṃ |",
    "XXvinv03_u:385": " Pravā-v 10.1.1.1.",
    "XXvinv03_u:386": " yathāpi tat tad eva pravāraṇāyāṃ paṃcadaśyāṃ bhikṣur bhikṣuṃ codayati.",
    "XXvinv03_u:387": " sacec codakaḥ na kāyena saṃvṛto bhavati na vācā |",
    "XXvinv03_u:388": " evaṃrūpaṃ codakaṃ āmardayitvā pramardayitvā pravārayitavyaṃ |",
    "XXvinv03_u:389": " Pravā-v 10.1.1.2.",
    "XXvinv03_u:390": " sacec codakaḥ kāyena saṃvṛto bhavati na vācā : evaṃrūpam api codakam",
    "XXvinv03_u:391": " āmardayitvā pramardayitvā pravārayitavyaṃ |",
    "XXvinv03_u:392": " (Pravā-v 168)",
    "XXvinv03_u:393": " Pravā-v 10.1.1.3.",
    "XXvinv03_u:394": " sacec codakaḥ vācā saṃvṛto bhavati na kāyena, evaṃrūpam api codakam",
    "XXvinv03_u:395": " āmardayitvā pramardayitvā pravārayitavyaṃ. (GBM 6.727.4; MSV IV 125.14-15).",
    "XXvinv03_u:396": " Pravā-v 10.1.2.1.",
    "XXvinv03_u:397": " sacec codakaḥ kāyena saṃvṛto bhavati vācā ca, na sūtradharo na vinayadharo na mātṛkādhara, evaṃrūpaṃ codakam ājñapayitvā saṃjñapayitvā pravārayitavyaṃ |",
    "XXvinv03_u:398": " Pravā-v 10.1.2.2.",
    "XXvinv03_u:399": " sacec codakaḥ kāyena saṃvṛto bhavati vācā ca, sūtradharo vinayadharo mātṛkādharaḥ, na sūtravyakto na vinayavyaktaḥ na mātṛkāvyakto, evaṃrūpam api codakam ājñāpayitvā saṃjñāpayitvā pravārayitavyam. Pravā-v 10.1.2.3.",
    "XXvinv03_u:400": " sacec codakaḥ kāyena saṃvṛto bhavati vācā ca, sūtradharo vinayadharo mātṛkādharo, sūtravyakto vinayavyakto mātṛkāvyakto, na sūtrakovido na",
    "XXvinv03_u:401": " vinayakovido na mātṛkākovidaḥ, evaṃrūpam api codakam ājñapayitvā saṃjñapayitvā pravārayitavyaṃ",
    "XXvinv03_u:402": " Pravā-v 10.1.2.4.",
    "XXvinv03_u:403": " sacec codakaḥ kāyena saṃvṛto bhavati vācā ca, sūtradharo vinayadharo mātṛkādharaḥ, sūtravyakto vinayavyakto mātṛkāvyaktaḥ |",
    "XXvinv03_u:404": " sūtrakovido vinayakovido mātṛkākovidaḥ, na sūtrakuśalo na vinayakuśalaḥ na mātṛkākuśalaḥ, evaṃrūpam api codakam ājñapayitvā saṃjñapayitvā pravārayitavyaṃ |",
    "XXvinv03_u:405": " Pravā-v 10.1.3.",
    "XXvinv03_u:406": " sacec codakaḥ kāyena saṃvṛto bhavati vācā ca, sūtradharo vinayadharo mātṛkādharaḥ, sūtravyakto vinayavyakto mātṛkāvyaktaḥ, sūtrakovido vinayakovido mātṛkākovidaḥ, sūtrakuśalo vinayakuśalo mātṛkākuśalaḥ, kiṃ tu saṃcintya saṃghamadhye adharmaṃ dharmato dīpayati dharmaṃ cādharmataḥ,",
    "XXvinv03_u:407": " avinayaṃ vinayato dīpayati vinayaṃ cāvinayataḥ, evaṃrūpam api codakam",
    "XXvinv03_u:408": " ājñapayitvā saṃjñapayitvā pravārayitavyaṃ |",
    "XXvinv03_u:409": " (Pravā-v 169)",
    "XXvinv03_u:410": " Pravā-v 10.1.4.",
    "XXvinv03_u:411": " sacec codakaḥ kāyena saṃvṛto bhavati yāvat* sacen na saṃcintya",
    "XXvinv03_u:412": " saṃghamadhye adharmaṃ dharmato dīpayati dharmaṃ cādharmataḥ, avinayaṃ vinayato dīpayati vinayaṃ cāvinayataḥ, evaṃrūpam api codakam ājñapayitvā saṃjñapayitvā pravārayitavyaṃ. (GBM 6.727.8-9; Pravā-v 10.2.1.1.",
    "XXvinv03_u:413": " sacec codakaḥ kāyena saṃvṛto bhavati vācā ca, sūtradharo vinayadharo mātṛkādharaḥ, sūtravyaktaḥ vinayavyaktaḥ mātṛkāvyaktaḥ |",
    "XXvinv03_u:414": " sūtrakovidaḥ vinayakovidaḥ mātṛkākovidaḥ |",
    "XXvinv03_u:415": " (73r = GBM 6.728) sūtrakuśalo vinayakuśalo mātṛkākuśalaḥ, na saṃcintya saṃghamadhye adharmaṃ dharmato dīpayati",
    "XXvinv03_u:416": " dharmaṃ cādharmataḥ, avinayaṃ vinayato dīpayati vinayaṃ cāvinayataḥ. sa idaṃ syād vacanīyaḥ. Pravā-v 10.2.1.2.",
    "XXvinv03_u:417": " vadāyuṣmaṃ. codakena vadasi pārājikayā saṃghāvaśeṣayā pāyantikayā pratideśanīyayā duṣkṛtayā, rātrikṛtena divasakṛtena pathakṛtenotpathakṛtena, gacchatas tiṣṭhato niṣaṇṇasya nipannasya. Pravā-v 10.2.2.1.",
    "XXvinv03_u:418": " sacet pārājikayā, na saṃghāvaśeṣayā na pāyantikayā na pratideśanīyayā na",
    "XXvinv03_u:419": " duṣkṛtayā, sacet saṃghāvaśeṣayā, na pārājikayā na pāyantikayā na pratideśanīyayā na duṣkṛtayā, sacet pāyantikayā, na pārājikayā na",
    "XXvinv03_u:420": " saṃghāvaśeṣayā na pratideśanīyayā na duṣkṛtayā. sacet pratideśanīyayā, na pārājikayā na saṃghāvaśeṣayā na pāyantikayā na duṣkṛtayā. saced duṣkṛtayā,",
    "XXvinv03_u:421": " na pārājikayā na saṃghāvaśeṣayā na pāyantikayā na pratideśanīyayā. (GBM",
    "XXvinv03_u:422": " (Pravā-v 170)",
    "XXvinv03_u:423": " Pravā-v 10.2.2.2.1.",
    "XXvinv03_u:424": " sacet prathamayā pārājikayā, na dvitīyayā na tṛtīyayā na caturthikayā,",
    "XXvinv03_u:425": " saced dvitīyayā na prathamayā na tṛtīyayā na caturthikayā, sacet tṛtīyayā na prathamayā na dvitīyayā na caturthikayā, sacec caturthikayā na",
    "XXvinv03_u:426": " prathamayā na dvitīyayā na tṛtīyayā. (GBM 6.728.4; MSV IV 127.10-14).",
    "XXvinv03_u:427": " Pravā-v 10.2.2.2.2.",
    "XXvinv03_u:428": " sacet prathamayā saṃghāvaśeṣayā na dvitīyayā na yāvat trayodaśamikayā :",
    "XXvinv03_u:429": " saced yāvat trayodaśamikayā na prathamayā na dvitīyayā na tṛtīyayā yāvan na dvādaśamikayā. Pravā-v 10.2.2.2.3.",
    "XXvinv03_u:430": " sacet prathamayā pāyantikayā, na dvitīyayā yāvan na navatimayā, sacen navatimayā na prathamayā na dvitīyayā yāvan naikonanavatimayā |",
    "XXvinv03_u:431": " Pravā-v 10.2.2.2.4.",
    "XXvinv03_u:432": " sacet prathamayā pratideśanīyayā na dvitīyayā na tṛtīyayā na caturthikayā",
    "XXvinv03_u:433": " | saced dvitīyayā na prathamayā na tṛtīyayā na caturthikayā, sacet tṛtīyayā na prathamayā na dvitīyayā na caturthikayā : sacec caturthikayā na prathamayā na dvitīyayā na tṛtīyayā Pravā-v 10.2.2.2.5.",
    "XXvinv03_u:434": " sacet prathamayā duṣkṛtayā na dvitīyayā na tṛtīyayā na yāvad antimayā |",
    "XXvinv03_u:435": " saced antimayā na prathamayā na dvitīyayā yāvan nopāntimayā. (GBM",
    "XXvinv03_u:436": " Pravā-v 10.2.2.3.",
    "XXvinv03_u:437": " saced rātṛkṛtena na divasakṛtena, saced divasakṛtena na rātrikṛtena, saced utpathakṛtena na pathakṛtena, sacet pathakṛtena notpathakṛtena, saced",
    "XXvinv03_u:438": " (Pravā-v 171) gacchataḥ na tiṣṭhataḥ na niṣaṇṇasya na nipannasya, sacet tiṣṭhataḥ na gacchataḥ na niṣaṇṇasya na nipannasya, sacen niṣaṇṇasya na",
    "XXvinv03_u:439": " gacchato na tiṣṭhato na nipannasya, sacen nipannasya na gacchataḥ na tiṣṭhataḥ na niṣaṇṇasya. Pravā-v 10.2.3.1.",
    "XXvinv03_u:440": " sacec codakaḥ evaṃ sādhu ca suṣṭhu ca samanuyujyamānaḥ samanuśāsyamānaḥ samanugāhyamānaḥ sthānāsthānaṃ saṃkrāmati, acodakaḥ syāt*. acoditas syāt*.",
    "XXvinv03_u:441": " sacec codakaḥ sthānāsthānaṃ na saṃkrāmati, codakaḥ syāt* || (GBM",
    "XXvinv03_u:442": " Pravā-v 10.2.3.2.",
    "XXvinv03_u:443": " sacec codakaḥ sthānāsthānaṃ na saṃkrāmati codita idaṃ syād vacanīyaṃ.",
    "XXvinv03_u:444": " vadāyuṣmaṃ. ke te tasmiṃ samaye kāyasaṃskārā vāksaṃskārā manaḥsaṃskārā.",
    "XXvinv03_u:445": " Pravā-v 10.3.1.",
    "XXvinv03_u:446": " sacet pārājikāṃ pratijānāti, nāśayitvā pravārayitavyaṃ. (GBM 6.728.10; MSV IV 128.15-16).",
    "XXvinv03_u:447": " Pravā-v 10.3.2.",
    "XXvinv03_u:448": " sacet saṃghāvaśeṣāṃ pratijānāti, adhiṣṭhāya pravārayitavyaṃ. (GBM",
    "XXvinv03_u:449": " sacet pāyantikāṃ pratideśanīyāṃ duṣkṛtāṃ pratijānāti, deśayitvā pravārayitavyaṃ : || || (GBM Uddāna 6.",
    "XXvinv03_u:450": " uddānam* ||",
    "XXvinv03_u:451": " mahāpeyālo gṛhṇāti (73v = GBM 6.729)) sthāpanaṃ hi ca paṃcikāṃ |",
    "XXvinv03_u:452": " gamikena trayaṃ kuryāt pariśuddhānāṃ pravāraṇā || ||",
    "XXvinv03_u:453": " (Pravā-v 172)",
    "XXvinv03_u:454": " Pravā-v 11.1.",
    "XXvinv03_u:455": " yathāpi tat tad eva pravāraṇāyāṃ pañcadaśyāṃ naivāsikā bhikṣavaḥ sanniṣaṇṇā bhavanti sannipatitāḥ paṃca vā uttare vā. teṣām evaṃ bhavati.",
    "XXvinv03_u:456": " santi bhikṣavo ye 'nāgatakā iti. ye 'nāgatakāḥ kalpaty asmākaṃ tair vinā jñaptiṃ kṛtvā pravārayituṃ, te kalpārthinaḥ kalpaniṣkārā jñaptiṃ kṛtvā pravārayanti. (GBM 6.729.1-2; MSV IV 128.21-129.3).",
    "XXvinv03_u:457": " Pravā-v 11.2.",
    "XXvinv03_u:458": " tataḥ paścān naivāsikā bhikṣavaḥ sanniṣaṇṇāḥ sannipatitā āgacchaṃty",
    "XXvinv03_u:459": " alpatarakās. taiḥ punar api jñaptiṃ kṛtvā pravārayitavyaṃ. pūrvikā bhikṣavaḥ sātisārāḥ kalpasāmantakāḥ. Pravā-v 11.3.",
    "XXvinv03_u:460": " pūrvavad yāvad yathā poṣadhavastuny evaṃ yathoktā uddānagāthā vācyaṃ. ekas tu viśeṣaḥ. tatra naivāsikā bhikṣavaḥ sanniṣaṇṇāḥ sannipatitāḥ catvāro vā uttare vā, ihāpi vācyaṃ paṃca vā uttare veti : || || (GBM 6.729.3; MSV IV 129.5-8).",
    "XXvinv03_u:461": " Uddāna 7.",
    "XXvinv03_u:462": " uddānaṃ ||",
    "XXvinv03_u:463": " varṣopagatakā bhikṣūñ jñātvā kalahakārakāṃ |",
    "XXvinv03_u:464": " sākhilyakena pratyudgamya niyataṃ cāturmāsikī |",
    "XXvinv03_u:465": " glānakaś ca vastu ca vargo bhavati yaḥ samudditaḥ || ||",
    "XXvinv03_u:466": " Pravā-v 12.1.1.",
    "XXvinv03_u:467": " āyuṣmān upālī buddhaṃ bhagavantaṃ pṛcchati |",
    "XXvinv03_u:468": " yathāpi tad bhadaṃta varṣopagatā bhikṣavaḥ śṛṇvanti. bhikṣavaḥ āgacchanti kalahakārakā",
    "XXvinv03_u:469": " bhaṇḍanakārakā vigrahakārakā vivādakārakā ādhikaraṇikāḥ. te 'smākaṃ",
    "XXvinv03_u:470": " codayiṣyaṃti smārayiṣyaṃti alajjitāyo vaitarikatvena. tais teṣāṃ kathaṃ",
    "XXvinv03_u:471": " pratipattavyaṃ. tair upāliṃ bhikṣubhir dve trīṇi vā poṣadhakarmāṇy atikramya pravārayitavyaṃ. (Pravā-v 173)",
    "XXvinv03_u:472": " Pravā-v 12.1.2.",
    "XXvinv03_u:473": " sacet saṃpadyate 'ty evaṃ kuśalaṃ. no cet saṃpadyate, tair bhikṣubhir dvau",
    "XXvinv03_u:474": " trayo vā āpadarthikā maṇḍalakāḥ saṃmantavyāḥ. (GBM 6.729.5-6; MSV IV 129.17-19).",
    "XXvinv03_u:475": " Pravā-v 12.2.1.",
    "XXvinv03_u:476": " sacet saṃpadyate 'ty evaṃ kuśalaṃ. no cet saṃpadyate, vāksākhilyakena pratyudgamya pātracīvaraṃ pratigrahītavyaṃ. pātracīvareṇāmohayitvā pramohayitvā pravārayitavyaṃ. (GBM 6.729.6; MSV IV Pravā-v 12.2.2.) Text in Tibetan only; Sanskrit text omitted",
    "XXvinv03_u:477": " Pravā-v 12.2.3.",
    "XXvinv03_u:478": " sacet saṃpadyate 'ty evaṃ kuśalaṃ. no cet saṃpadyate, dharmaśravaṇaṃ",
    "XXvinv03_u:479": " dātavyam*. dharmaśravaṇenāmohayitvā pramohayitvā pravārayitavyaṃ. (GBM",
    "XXvinv03_u:480": " Pravā-v 12.3.",
    "XXvinv03_u:481": " sacet saṃpadyate 'ty evaṃ kuśalaṃ. no cet saṃpadyate, tair upāliṃ bhikṣubhir maṇḍalakaṃ kṛtvā poṣadhaḥ kartavyaḥ. (GBM 6.729.7; MSV IV 130.3-5).",
    "XXvinv03_u:482": " Pravā-v 12.4.",
    "XXvinv03_u:483": " sacet ta evaṃ vadeyuḥ. adyāyuṣmantas saṃghasya pravāraṇā pāṃcadaśikā.",
    "XXvinv03_u:484": " kasmād yūyaṃ poṣadhaṃ kurutheti. ta idaṃ syur vacanīyāḥ. āgantukā yūyam āyuṣmanto. naivāsikā bhikṣavo 'nenārthena. teṣām evaṃ bhavati |",
    "XXvinv03_u:485": " niyatam āyuṣmatāṃ cāturmāsikī pravāraṇā bhaviṣyatīti |",
    "XXvinv03_u:486": " tataḥ paścāt tair gatavegair gatapratyarthibhiḥ punar api pravārayitavyaṃ : || (GBM",
    "XXvinv03_u:487": " Pravā-v 13.1.",
    "XXvinv03_u:488": " yathāpi tat tad eva pravāraṇāyāṃ paṃcadaśyāṃ glānaḥ aglānasya pravāraṇāṃ",
    "XXvinv03_u:489": " sthāpayati. glāna idaṃ syād vacanīyaḥ. āgamaya tvam āyuṣmaṃ. glānas tvam aprayogakṣamaḥ. Pravā-v 13.2.",
    "XXvinv03_u:490": " yathāpi tat tad eva pravāraṇāyāṃ pañcadaśyāṃ aglānaḥ glānasya pravāraṇāṃ",
    "XXvinv03_u:491": " (Pravā-v 174) sthāpayati. aglāna idaṃ syād vacanīyaḥ. āgamaya tvam āyuṣmaṃ. glāno 'sāv aprayogakṣamaḥ. (GBM 6.729.9-10; MSV IV 130.13-15).",
    "XXvinv03_u:492": " Pravā-v 13.3.",
    "XXvinv03_u:493": " yathāpi tat tad eva pravāraṇāyāṃ pañcadaśyāṃ glānaḥ glānasya dūtena pravāraṇāṃ sthāpayati. dūta idaṃ syād vacanīyaḥ. āgamaya tvam āyuṣmaṃ.",
    "XXvinv03_u:494": " glāno 'sāv aprayogakṣamaḥ. (GBM 6.729.10; MSV IV 130.16-18).",
    "XXvinv03_u:495": " Pravā-v 13.4.",
    "XXvinv03_u:496": " yathāpi tat tad eva pravāraṇāyāṃ (74r) pañcadaśyām aglāno glānasya",
    "XXvinv03_u:497": " pravāraṇāṃ dūtena sthāpayati. dūta idaṃ syād vacanīyaḥ. āgamaya tvam āyuṣman. glāno 'sāv aprayogakṣamaḥ. (GBM 6.729.10; MSV IV 130.18).",
    "XXvinv03_u:498": " folio 74 is lost, therefore the Sanskrit text of Pravā-v 14.1 to 14.2.4 is not extant."
}