{
  "K10sf68_sc:hart0_1": "Bodhasūtra",
  "K10sf68_sc:hart1_0": "“pṛccha Bodha d eva yad yad evākāṁkṣasi.”",
  "K10sf68_sc:hart2_0": "“katibhir bhadaṁtāṁgaiḥ samanvāgata āryaśrāvakaḥ kṣipram evāsmiṁ dharmavinaye āsravakṣayam anuprāpnoti?”",
  "K10sf68_sc:hart3_0": "“tena hi Bodha tvām eva pra + + yathā te kṣamate ’thainam vyākuru! kiṁ manyase Bodha",
  "K10sf68_sc:hart3_1": "kuśalas tvaṁ pitrye śilpasthānakarmasthāne tadyathāhastigrīvāyām aśvapṛṣṭhe rathe",
  "K10sf68_sc:hart3_2": "sarau dhanuṣy apayāne niryāṇe aṁkuśagrahepāśagrahe toramaragrahe lipigaṇananyasanasaṁkhyāmudrāyāṁ?”",
  "K10sf68_sc:hart4_0": "“tathyam ahaṁ bhadanta kuśalaḥ pitrye śilpasthānakarmasthāne tadyathāhasti-grīvāyām",
  "K10sf68_sc:hart4_1": "aśvapṛṣṭhe rathe sarau dhanuṣy apayāne niryāṇe aṁkuśagrahetomaragrahe lipigaṇananyasanasaṁkhyāmudrāyām.”",
  "K10sf68_sc:hart5_0": "“atha puruṣa āgacchet tasyaivaṁ syāt: kuśalo bata Bodho rājakumāraḥ pitryeśilpasthānakarmasthāne",
  "K10sf68_sc:hart5_1": "tadyathāhastigrīvāyām aśvapṛṣṭhe rathe saraudhanuṣy apayāne niryāṇe aṁkuśagrahe pāśagrahe",
  "K10sf68_sc:hart5_2": "tomaragrahe lipigaṇananyasanasaṁkhyāmudrāyāṁ. yanv aham asyāntikād anyatamānyatamaśilpasthānakarmasthānam anvāgamayeyam iti",
  "K10sf68_sc:hart6_0": "sa ca syād aśrāddhaḥ; kiṁ manyase Bodha: yat tac chrāddhena prāptavyaṁprāpnuyāt saḥ?”",
  "K10sf68_sc:hart6_1": "“no bhadaṁta.”",
  "K10sf68_sc:hart7_0": "“sa ca syāc chaṭhaḥ; kiṁ manyase Bodha: yat tadṛ śaṭhīna prāptavyanprāpnuyāt sa?”",
  "K10sf68_sc:hart7_1": "“no bhadanta.”",
  "K10sf68_sc:hart8_0": "“sa ca syād bahvābādhaḥ; kiṁ manyase Bodha: yat tad alpābādhena prāptavyaṁ prāpnuyāt saḥ?”",
  "K10sf68_sc:hart8_1": "“no bhadanta.”",
  "K10sf68_sc:hart9_0": "“sa ca syād anārabdhavīryaḥ; kiṁ manyase Bodha: yat tad ārabdhavīryeṇaprāptavyaṁ prāpnuyāt sa?”",
  "K10sf68_sc:hart9_1": "“no bhadanta.”",
  "K10sf68_sc:hart10_0": "“sa ca syād duṣprajñaḥ; kiṁ manyase Bodha: yat tat prājñena prāptavyaṁprāpnuyāt sa?”",
  "K10sf68_sc:hart10_1_0": "“no bhadanta; ekaikena tāvad bhadanta ito ’ṅgena samanvāgatena tena puruṣeṇa na sukaraṁ",
  "K10sf68_sc:hart10_1_1": "mamāntikād anyatamānyatamaṁ śilpasthāna-karmasthānam anvāgamayituṁ; kaḥ punar vādaḥ sarvaiḥ.”",
  "K10sf68_sc:hart11_0": "“dvitīyo .āpuruṣa āgacchet tasyaivaṁ syāt: kuśalo bata Bodho rāja-kumāraḥ pitrye",
  "K10sf68_sc:hart11_1": "śilpasthānakarmmasthāne tadyathāhastigrīvāyāṁ aśva-pṛṣṭhe rathe sarau dhanuṣy apayāne",
  "K10sf68_sc:hart11_2": "niryāṇe aṁkuśagrahe pāśagrahe tomaragrahelipigaṇananyasanaṁsaṁkhyāmudrāyāṁ. yanv",
  "K10sf68_sc:hart11_3": "aham asyāntikād anyata-mānyatamac chilpasthānakarmmasthānam anvāgamayeyam iti.",
  "K10sf68_sc:hart12_0": "sa ca syāc chrāddhaḥ; kiṁ manyase Bodha yat tac chrāddhena prāptavyaṁprāpnuyāt sa?”",
  "K10sf68_sc:hart12_1": "“evaṁ bhadanta.”",
  "K10sf68_sc:hart13_0": "“sa ca syād aśaṭhaḥ; kiṁ manyase Bodha:  yat tad aśaṭhena prāptavyaṁprāpnuyāt sa?”",
  "K10sf68_sc:hart13_1": "“evaṁ bhadanta.”",
  "K10sf68_sc:hart14_0": "“sa ca syād alpābādhaḥ; kim manyase Bodha: yat tad alpābādhena prāptavyaṁprāpnuyāt saḥ?”",
  "K10sf68_sc:hart14_1": "“evaṁ bhadanta.”",
  "K10sf68_sc:hart15_0": "“sa ca syād ārabdhavīryaḥ; kiṁ manyase  Bodha: yat tad ārabdhavīryeṇaprāptavyaṁ prāpnuyāt sa?” “evaṁ bhadanta.”",
  "K10sf68_sc:hart16_0": "“sa ca syāt prājñaḥ; kiṁ manyase Bodha: yat tat prājñena prāptavyaṁ prāpnuyātsa?”",
  "K10sf68_sc:hart16_1_0": "“evaṁ bhadanta; ekaikena tāvad bhadanta ito ’ṅgena samanvāgatena tenapuruṣeṇa sukaraṁ",
  "K10sf68_sc:hart16_1_1": "mamāntikād anyatamānyatamac chilpasthānakarmasthānasamanvāgamayituṁ; kaḥ punar vādaḥ sarvair.”",
  "K10sf68_sc:hart17_0": "“evam eva Bodha paṁcabhiḥ prādhānikāṁgais samanvāgata āryaśrāvakaḥkṣipram evāsmiṁ dharmavinaye āsravakṣayam anuprāpnoti; katamaiḥ paṁcabhir?",
  "K10sf68_sc:hart18.1_0": "iha Bodha āryaśrāvakasya tathāgatasyāntike śraddhābhiniviṣṭābhavatimū lajātāpratiṣṭhitāasaṁhāryāśramaṇena",
  "K10sf68_sc:hart18.1_1": "vā brāhmaṇena vā devena vā māreṇa vā brahmaṇā vā kenacid vā punar loke sahadharmatam;",
  "K10sf68_sc:hart18.1_2": "anena prathamenaprādhānikenāṁgena samanvāgato bhavaty āryaśrāvakaḥ.",
  "K10sf68_sc:hart18.2_0": "punar aparaṁ + Bodha āryaśrāvako ’śaṭhībhavaty amāyāvīṛjukoṛjukajātīyaḥ sa yathābhū",
  "K10sf68_sc:hart18.2_1": "tam ātmānam āviṣkaroti śāstur antike vijñānāṁ casabrahmacārīṇām anena dvitīyena prādhānikenāṁgena",
  "K10sf68_sc:hart18.2_2": "samanvāgatobhavaty āryaśrāvakaḥ.",
  "K10sf68_sc:hart18.3_0": "punar aparaṁ āryaśrāvaka alpābādho bhavaty arogajātīyaḥ samayāpācanyāgrahaṇyāsamanvāgato",
  "K10sf68_sc:hart18.3_1": "nātyuṣṇayā nātiśītayāavyābādhayāṛtusukhāyāyayāpy aśitapītakhaditāsvāditāni samyaksukhena",
  "K10sf68_sc:hart18.3_2": "paripākaṁ gacchanti; anenatṛtīyena prādhānikāṁgena samanvāgato bhavaty ābhavaty āryaśrāvakaḥ.",
  "K10sf68_sc:hart18.4_0": "punar aparaṁ Bodha āryaśrāvakaḥ ārabdhavīryo viharati sthāmavāṁ vīryavānutsāhīdṛḍhaparākramo",
  "K10sf68_sc:hart18.4_1": "’nikṣiptadhuraḥ kuśaleṣu dharmeṣu: kāmaṁ tvak snāyvasthi cāvatiṣṭhatāṁ, pariśuṣyatu",
  "K10sf68_sc:hart18.4_2": "śarīrān māṁsaśoṇitam. atha ca punar yattad ārabdhavīryeṇa prāptavyaṁ sthāmavatā vīryavatā",
  "K10sf68_sc:hart18.4_3": "utsāhinā dṛḍhaparākrameṇānikṣiptadhureṇa kuśaleṣu dharmeṣu tad vata nāprāpyāntarādvīryasya",
  "K10sf68_sc:hart18.4_4": "sraṁsanaṁ bhaviṣyaty; anena caturthena prādhānikenāṁgena samana-vāgato bhavaty āryaśrāvakaḥ.",
  "K10sf68_sc:hart18.5_0": "punar aparaṁ Bodhāryaśrāvakaḥ prajñāvān viharati lokasyodayāstaṁgaminyāprajñayāsamanvāgataḥ",
  "K10sf68_sc:hart18.5_1": "āryayānairyāṇikayānairvedhikayāniryātitatkaraḥ sya hetoḥ samyagduḥkhakṣayāya duḥkhasyāntakriyāyai;",
  "K10sf68_sc:hart18.5_2": "anena paṁcamena prādhānikenāṁgena samanvāgato bhavaty āryaśrāvakaḥ.",
  "K10sf68_sc:hart19_0": "ebhir Bodha paṁcabhiḥ prādhānikāṁgais samanvāgataḥ āryaśrāvakaḥ kṣipramevāsmiṁ dharmavinaye āsravakṣayam anuprāpnoti.”",
  "K10sf68_sc:hart20_0": "atha Bodho rājakumāraḥ pū rvaṁ kāyam abhyunnamayya dakṣiṇaṁ bāhumabhiprasāryāttamanāttamanāudānam",
  "K10sf68_sc:hart20_1": "udānayati: “aho buddha aho dharma ahosaṁgha aho dharmasya svākhyātatā, yatredānīṁ",
  "K10sf68_sc:hart20_2": "paṁcabhiḥ prādhāni-kāṁgenagaiḥ samanvāgata āryaśrāvakaḥ kṣipram evāsmiṁ dharmavinayeāsravakṣayam anuprāpnotīti!”"
}