{
    "XXdbsu1-4u:0": " DbSū(1) 0. evaṃ mayā śrutaṃ /",
    "XXdbsu1-4u:1": " ekasmiṃ samaye bhagavāṃ śrāvastyāṃ viharati sma jetavane anāthapiṇḍadasyārāme /",
    "XXdbsu1-4u:2": " tatra bhagavāṃ bhikṣūn āmantrayate sma /",
    "XXdbsu1-4u:3": " daśemāni bhikṣavas tathāgatasya balāni yaiḥ samanvāgatas tathāgato 'rhaṃ",
    "XXdbsu1-4u:4": " samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyaksiṃhanādaṃ nadati /",
    "XXdbsu1-4u:5": " katamāni daśa /",
    "XXdbsu1-4u:6": " DbSū(1) 1. iha tathāgataḥ sthānañ ca sthānato yathābhūtaṃ prajānāty asthānañ cāsthānato yat tathāgataḥ sthānañ ca sthānato yathābhūtaṃ",
    "XXdbsu1-4u:7": " prajānāty asthānañ cāsthānataḥ /",
    "XXdbsu1-4u:8": " idaṃ prathamaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ",
    "XXdbsu1-4u:9": " samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyaksiṃhanādaṃ nadati /",
    "XXdbsu1-4u:10": " DbSū(1) 2. punar aparaṃ tathāgato 'tītānāgatapratyutpannāni",
    "XXdbsu1-4u:11": " karmadharmasamādānāni sthānato hetuto vastuto vipākataś ca yathābhūtaṃ prajānāti yat tathāgato 'tītānāgatapratyutpannāni karmadharmasamādānāni sthānato hetuto vipākataś ca yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:12": " idaṃ dvitīyaṃ tathāgatabalaṃ yena balena pūrvavat* /",
    "XXdbsu1-4u:13": " DbSū(1) 3. punar aparaṃ tathāgato dhyānavimokṣasamādhisamāpattīnāṃ saṃkleśavyavadānavyavasthānaviśuddhiṃ yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:14": " idaṃ tṛtīyaṃ tathāgatabalaṃ yena balena pūrvavat* /",
    "XXdbsu1-4u:15": " DbSū(1) 4. punar aparaṃ tathāgataḥ parasatvānām indriyaparāparatāṃ yathābhūtaṃ prajānāti yat tathāgataḥ parasatvānām indriyaparāparatāṃ yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:16": " idaṃ caturthaṃ tathāgatabalaṃ yena balena pūrvavad yāvat* pariṣadi samyaksiṃhanādaṃ nadati",
    "XXdbsu1-4u:17": " DbSū(1) 5. punar aparaṃ tathāgataḥ parasatvānāṃ parapudgalānāṃ nānādhimuktitāṃ yathābhūtaṃ",
    "XXdbsu1-4u:18": " yat tathāgataḥ parasatvānāṃ parapudgalānāṃ nānādhimuktitāṃ yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:19": " idaṃ pañcamaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ",
    "XXdbsu1-4u:20": " samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyaksiṃhanādaṃ nadati /",
    "XXdbsu1-4u:21": " DbSū(1) 6. punar aparaṃ tathāgato nānādhātukaṃ lokam anekadhātukam iti yathābhūtaṃ prajānāti",
    "XXdbsu1-4u:22": " {iti fehlt S 481 Z. 11 bzw. 13}",
    "XXdbsu1-4u:23": " yat tathāgato nānādhātukaṃ lokam anekadhātukam iti yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:24": " {iti fehlt S 481 Z. 11 bzw. 13}",
    "XXdbsu1-4u:25": " idaṃ ṣaṣṭhaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ",
    "XXdbsu1-4u:26": " samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyaksiṃhanādaṃ nadati /",
    "XXdbsu1-4u:27": " DbSū(1) 7. punar aparaṃ tathāgataḥ sarvatragāminīṃ pratipadaṃ yathābhūtaṃ",
    "XXdbsu1-4u:28": " prajānāti yat tathāgataḥ sarvatragāminīṃ pratipadaṃ yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:29": " idaṃ saptamaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ",
    "XXdbsu1-4u:30": " samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyaksiṃhanādaṃ nadati /",
    "XXdbsu1-4u:31": " DbSū(1) 8. punar aparaṃ tathāgato 'nekavidhaṃ pūrvenivāsaṃ samanusmarati tadyathaikām api jātiṃ dve tisraś catasraḥ paṃca ṣaṭ saptāṣṭau navo daśa viṃśat triṃśac catvāriṃśat pañcāśaj jātiśataṃ jātisahasraṃ",
    "XXdbsu1-4u:32": " jātiśatasahasram anekāny api jātiśatāny anekāny api jātisahasrāṇy anekāny api jātiśatasahasrāṇi saṃvartakalpam api vivartakalpam api saṃvartavivartakalpam apy anekān api saṃvartakalpān anekān api vivartakalpān anekān api saṃvartavivartakalpān samanusmaraty amī nāma te bhavantaḥ satvā yatrāham āsam evaṃnāmaivaṃjātya evaṃgotra evamāhara evaṃsukhaduḥkhapratisaṃvedy evaṃdīrghāyur evaṃcirasthitika evamāyuḥparyantaḥ so 'haṃ tasmāc cyuto 'mutropapannas tasmāc cyuto 'mutropapannas tasmād api cyuta ihopapannaḥ /",
    "XXdbsu1-4u:33": " iti sākāraṃ sanidānaṃ soddeśam anekavidhaṃ pūrvenivāsaṃ samanusmarati /",
    "XXdbsu1-4u:34": " yat tathāgato 'nekavidhaṃ pūrvenivāsaṃ samanusmarati tadyathaikām api jātiṃ dve tisraś catasraḥ paṃca ṣaṭ saptāṣṭau navo daśa viṃśat triṃśac",
    "XXdbsu1-4u:35": " catvāriṃśat pañcāśaj jātiśataṃ jātisahasraṃ jātiśatasahasram anekāny api jātiśatāny api jātisahasrāṇy anekāny api jātiśatasahasrāṇi saṃvartakalpam api vivartakalpam api saṃvartavivartakalpam apy anekān api saṃvartakalpān anekān api vivartakalpān anekān api saṃvartavivartakalpān samanusmaraty amī nāma te bhavantaḥ satvā yatrāham āsam evaṃnāmaivaṃjātya evaṃgotra evamāhara evaṃsukhaduḥkhapratisaṃvedy evaṃdīrghāyur evaṃcirasthitika evamāyuḥparyantaḥ so 'haṃ tasmāc cyuto 'mutropapannas tasmād api cyuta",
    "XXdbsu1-4u:36": " ihopapannaḥ /",
    "XXdbsu1-4u:37": " iti sākāraṃ sanidānaṃ soddeśam anekavidhaṃ pūrvenivāsaṃ samanusmarati /",
    "XXdbsu1-4u:38": " idam aṣṭamaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ",
    "XXdbsu1-4u:39": " samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyaksiṃhanādaṃ nadati /",
    "XXdbsu1-4u:40": " DbSū(1) 9. punar aparaṃ tathāgato divyena cakṣuṣā viśuddhenātikrāntamānuṣeṇa satvāṃ paśyati cyavamānān apy upapadyamānān api suvarṇān api durvarṇān api hīnān api praṇītān api sugatim api gacchato",
    "XXdbsu1-4u:41": " durgatim api yathākarmopagāṃ satvāṃ yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:42": " itīme bhavantaḥ satvāḥ kāyaduścaritena samanvāgatā vāṅmanoduścaritena samanvāgatā āryāṇām apavādakā mithyādṛṣṭayo mithyādṛṣṭikarmadharmasamādānahetos taddhetos tatpratyayaṃ kāyasya bhedāt paraṃ maraṇād apāyadurgativinipātaṃ narakeṣūpapadyante /",
    "XXdbsu1-4u:43": " ime vā punar bhavantaḥ satvāḥ kāyasucaritena samanvāgatā vāṅmanaḥsucaritena samanvāgatā āryāṇām anapavādakāḥ samyagdṛṣṭayaḥ samyagdṛṣṭikarmadharmasamādānahetos taddhetos tatpratyayaṃ kāyasya bhedāt sugatau svargaloke deveṣūpapadyante /",
    "XXdbsu1-4u:44": " yat tathāgato divyena cakṣuṣā viśuddhenātikrāntamānuṣeṇa satvāṃ paśyati cyavamānān apy upapadyamānān api suvarṇān api durvarṇān api hīnān api praṇītān api sugatim api gacchato durgatim api yathākarmopagāṃ satvāṃ yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:45": " itīme bhavantaḥ satvāḥ kāyaduścaritena samanvāgatā vāṅmanoduścaritena samanvāgatā āryāṇām apavādakā mithyādṛṣṭayo mithyādṛṣṭikarmadharmasamādānahetos taddhetos tatpratyayaṃ kāyasya bhedāt paraṃ maraṇād apāyadurgativinipātaṃ narakeṣūpapadyante /",
    "XXdbsu1-4u:46": " ime vā punar bhavantaḥ satvāḥ kāyasucaritena samanvāgatā vāṅmanaḥsucaritena samanvāgatā āryāṇām anapavādakāḥ samyagdṛṣṭayaḥ samyagdṛṣṭikarmadharmasamādānahetos taddhetos tatpratyayaṃ kāyasya bhedāt sugatau svargaloke deveṣūpapadyante /",
    "XXdbsu1-4u:47": " idaṃ navamaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ",
    "XXdbsu1-4u:48": " samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyaksiṃhanādaṃ nadati 9 /",
    "XXdbsu1-4u:49": " DbSū(1) 10. punar aparaṃ tathāgata āsravāṇāṃ kṣayād anāsravāṃ cetovimuktiṃ prajñāvimuktiṃ dṛṣṭa eva dharme svayam abhijñāya sākṣīkṛtvopasaṃpadya pravedayati kṣīṇā me jātir uṣitaṃ brahmacaryaṃ kṛtaṃ karaṇīyaṃ nāparam",
    "XXdbsu1-4u:50": " asmād bhāvaṃ prajānāmi yat tathāgata āsravāṇāṃ kṣayād anāsravāṃ cetovimuktiṃ prajñāvimuktiṃ dṛṣṭa eva dharme svayam abhijñāya sākṣīkṛtvopasaṃpadya pravedayati kṣīṇā me jātir uṣitaṃ brahmacaryaṃ kṛtaṃ karaṇīyaṃ nāparam asmād bhāvaṃ prajānāmi /",
    "XXdbsu1-4u:51": " idaṃ daśamaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ",
    "XXdbsu1-4u:52": " samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyaksiṃhanādaṃ nadati 10 /",
    "XXdbsu1-4u:53": " idam avocad bhagavān āptamanasas te bhikṣavo bhagavato bhāṣitam abhyanandam* //",
    "XXdbsu1-4u:54": " daśabalasūtraṃ samāptam* //",
    "XXdbsu1-4u:55": " Daśabalasūtra: DbSū(2) = Chinese Samyuktāgama sūtra 348 (T 99, II",
    "XXdbsu1-4u:57": " Mitteilungen des Instituts für Orientforschung 6 (1958), pp. 388_392,",
    "XXdbsu1-4u:58": " [Nachdruck: Ernst Waldschmidt. Von Ceylon bis Turfan, Schriften zur Geschichte, Literatur, Religion und Kunst des indischen Kulturraumes",
    "XXdbsu1-4u:59": " (Festgabe zum 70. Geburtstag),",
    "XXdbsu1-4u:60": " Göttingen 1967, pp. 353-357, 360-361].",
    "XXdbsu1-4u:61": " Input by Klaus Wille (Göttingen)",
    "XXdbsu1-4u:62": " ITALICS for restored text",
    "XXdbsu1-4u:63": " DbSū(2) 1 śrāvastyāṃ nidānam /",
    "XXdbsu1-4u:64": " DbSū(2) 2 daśabalasamanvāgatas tathāgato 'rhāṃ samyaksaṃbuddhaś caturvaiśāradyaprāpta udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyaksiṃhanādaṃ nadati DbSū(2) 3 yad utāsmiṃ satīdaṃ bhavaty asyotpādād idam utpadyate /",
    "XXdbsu1-4u:65": " yad utāvidyāpratyayāḥ saṃskārāḥ yāvat samudayo nirodhaś ca bhavati /",
    "XXdbsu1-4u:66": " DbSū(2) 4 svākhyāto me bhikṣavo dharma uttāno vivṛta chinnaplotiko yāvad devamanuṣyebhyaḥ samyaksuprakāśitaḥ /",
    "XXdbsu1-4u:67": " DbSū(2) 5 evaṃ svākhyāte me dharme uttāne vivṛte chinnaplotike yāvad devamanuṣyebhyaḥ samyaksuprakāśite alam eva śraddhāpravrajitena kulaputreṇa yogāya /",
    "XXdbsu1-4u:68": " alam apramādāya /",
    "XXdbsu1-4u:69": " alaṃ śāstuś śāsane yogam āpattuṃ /",
    "XXdbsu1-4u:70": " kāmaṃ tvak snāyu ca asthi cāvatiṣṭhatu pariśuṣyatu śarīrāṃ māṃsaśoṇitam* /",
    "XXdbsu1-4u:71": " DbSū(2) 6 atha ca punar yat tad ārabdhavīryeṇa prāptavyaṃ sthāmavatā vīryavatā utsāhinā dhṛḍhaparākrameṇa anikṣiptadhureṇa kuśaleṣu dharmeṣu",
    "XXdbsu1-4u:72": " tad bata nānuprāpyāntarā vīryasya sraṃsanaṃ bhaviṣyati /",
    "XXdbsu1-4u:73": " DbSū(2) 7 tat kasya hetoḥ /",
    "XXdbsu1-4u:74": " duḥkhaṃ kusīto viharati vyavakīrṇaḥ pāpakair akuśalair dharmaiḥ sāṃkleśyaiḥ paunarbhavikaiḥ sajvarair duḥkhavipākair āyatyāṃ jātijarāmaraṇīyair mahataś cāpy arthasya pārihāṇir bhavati DbSū(2) 8 ārabdhavīryas tu sukhaṃ viharaty avyavakīrṇaḥ pāpakair akuśalair dharmaiḥ sāṃkleśyaiḥ ponarbhavikaiḥ sajvarair duḥkhavipākair āyatyāṃ jātijarāmaraṇīyair mahataś cāpy arthasya pāripūrir bhavati /",
    "XXdbsu1-4u:75": " DbSū(2) 9 maṇḍapeyam idaṃ pravacanaṃ /",
    "XXdbsu1-4u:76": " yad uta śāstā ca saṃmukhībhūto dharmaś ca deśyate aupaśamikaḥ pārinirvāṇikaḥ saṃbodhagāmī sugatapraveditaḥ /",
    "XXdbsu1-4u:77": " DbSū(2) 10 tasmāt tarhi bhikṣava ātmārthaṃ ca samanupaśyadbhiḥ parārthaṃ cobhayārthaṃ ca itaḥ pratisaṃśikṣitavyam /",
    "XXdbsu1-4u:78": " DbSū(2) 11 kaccin na pravrajyā amoghā bhaviṣyati saphalā sukhodayā sukhavipākā yeṣāṃ ca paribhokṣyāmahe cīvarapiṇḍapātaśayanāsanaglānapratyayabhaiṣajyapariṣkārāṃ teṣāṃ te kārāḥ kṛtāḥ kaccid atyarthaṃ mahāphalā bhaviṣyaṃti mahānuśaṃsā mahādyutayo mahāvaistārā ity evaṃ vo bhikṣavaḥ śikṣitavyaṃ DbSū(2) 12 daśabalasūtraṃ /",
    "XXdbsu1-4u:79": " samāptaḥ //",
    "XXdbsu1-4u:80": " Daśabalasūtra: DbSū(3) = Chinese Samyuktāgama sūtra 684 (T 99, II",
    "XXdbsu1-4u:81": " Based on the edition by Jin-il Chung. \"Ein drittes und ein viertes",
    "XXdbsu1-4u:82": " Daśabala-Sūtra\",",
    "XXdbsu1-4u:83": " Sanko Bunka Kenkyūjo Nenpo (Annual of the Sanko Research Institute for the Studies of Buddhism), 40 (2009), pp. 1-32 [4-16].",
    "XXdbsu1-4u:84": " Input by Jin-il Chung (Göttingen)",
    "XXdbsu1-4u:85": " ITALICS for restored text",
    "XXdbsu1-4u:86": " DbSū(3) 1 śrāvastyāṃ nidānam*",
    "XXdbsu1-4u:87": " DbSū(3) 2a rūpasya bhikṣavo nirvide virāgān nirodhād anupādāya vimokṣāt tathāgato 'rhāṃ samyaksaṃbuddha ity ucyate /",
    "XXdbsu1-4u:88": " DbSū(3) 2b evaṃ vedanāyāḥ saṃjñāyāḥ saṃskārāṇāṃ vijñānasya vācyam*",
    "XXdbsu1-4u:89": " DbSū(3) 3a bhikṣur api rūpasya nirvide virāgāṃ nirodhād anupādāya vimokṣād arhāṃ prajñāvimukta ity ucyate",
    "XXdbsu1-4u:90": " DbSū(3) 3b evaṃ vedanāyāḥ saṃjñāyāḥ saṃskārāṇāṃ vijñānasya vācyam*",
    "XXdbsu1-4u:91": " DbSū(3) 4 iha bhikṣavaḥ ko viśeṣaḥ ko 'bhiprāyaḥ kiṃ nānākaraṇaṃ tathāgatasyārhataḥ samyaksaṃbuddhasya arhatā ca prajñāvimuktena bhikṣuṇā :",
    "XXdbsu1-4u:92": " DbSū(3) 5 bhagavanmūlakā bhadanta dharmā bhagavaṃnetryā bhagavatpratisaraṇāḥ sādhu bhagavān etam evārthaṃ bhikṣubhyo bhāṣeta bhagavataḥ śrutvā bhikṣavo dhārayiṣyanti",
    "XXdbsu1-4u:93": " DbSū(3) 6 tena hi bhikṣavaḥ śṛṇuta sādhu ca suṣṭhu ca manasikuruta",
    "XXdbsu1-4u:94": " bhāṣiṣye",
    "XXdbsu1-4u:95": " DbSū(3) 7 tathāgato bhikṣavaḥ arhaṃ samyaksaṃbuddhaḥ pūrvam ananuśruteṣu",
    "XXdbsu1-4u:96": " dharmeṣu svayaṃ dharmān abhijñāya dharmāṃ parijñāya dṛṣṭadharmābhijñaḥ paramabodhim anuprāpta āyatyām bodhāya śrāvakānān dharman deśayati /",
    "XXdbsu1-4u:97": " DbSū(3) 8 yad uta catvāri samyakprahāṇāni catvāra ṛddhipādā paṃcendriyāṇi paṃca balāni sapta bodhyaṅgāny āryāṣṭāṅgo mārgaḥ",
    "XXdbsu1-4u:98": " DbSū(3) 9 iti hi bhikṣavas tathāgato 'rhāṃ samyaksaṃbuddhaḥ anadhigatasya mārgasyādhigantā aprajñaptasya brahmacaryasya prajñaptā mārgajñas tathāgato mārgavin mārgadaiśikaḥ mārgākhyātā mārgapariṇāyakaḥ DbSū(3) 10 tataḥ paścāt samanvāgatāḥ śrāvakā mārgānugāś śāstuḥ śāsanakarā yathānuśiṣṭāḥ samyak pratipadyamānā ārādhakā bhavanty ārādhayanti nyāyaṃ dharmaṃ kuśalam*",
    "XXdbsu1-4u:99": " DbSū(3) 11 ayaṃ bhikṣavo viśeṣaḥ ayam abhiprāyaḥ idaṃ nānākaraṇaṃ tathāgatasyārhataḥ samyaksaṃbuddhasya arhatā ca prajñāvimuktena bhikṣuṇā",
    "XXdbsu1-4u:100": " DbSū(3) 12 pañcemāni śaikṣabalāni daśa tathāgatabalāni /",
    "XXdbsu1-4u:101": " DbSū(3) 13 paṃca śaikṣabalāni katamāni pañca śraddhābalaṃ śaikṣabalam*",
    "XXdbsu1-4u:102": " vīryabalaṃ hrībalam avatrāpyabalaṃ prajñābalaṃ śaikṣabalam*",
    "XXdbsu1-4u:103": " DbSū(3) 14 daśa tathāgatabalāni katamāni daśa",
    "XXdbsu1-4u:104": " DbSū(3) 15.1a iha tathāgataḥ sthānañ ca sthānato yathābhūtaṃ prajānāti asthānañ cāsthānataḥ",
    "XXdbsu1-4u:105": " DbSū(3) 15.1b yat tathāgataḥ sthānaṃ ca sthānato yathābhūtaṃ prajānāti asthānañ cāsthānataḥ idaṃ prathamaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ samyaksaṃbuddhaḥ udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyak siṃhanādaṃ nadati DbSū(3) 15.2a punar aparaṃ tathāgato 'tītānāgatapratyutpannāni",
    "XXdbsu1-4u:106": " karmadharmasamādānāni sthānato hetuto vastuto vipākataś ca yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:107": " DbSū(3) 15.2b yat tathāgato 'tītānāgatapratyutpannāni",
    "XXdbsu1-4u:108": " karmadharmasamādānāni sthānato hetuto vastuto vipākataś ca yathābhūtaṃ prajānāti idaṃ dvitīyaṃ tathāgatabalaṃ yena balena pūrvavat*",
    "XXdbsu1-4u:109": " DbSū(3) 15.3a punar aparaṃ tathāgato dhyānavimokṣasamādhisamāpattīnāṃ saṃkleśavyavadānavyavasthānaviśuddhin yathābhūtaṃ prajānāti",
    "XXdbsu1-4u:110": " DbSū(3) 15.3b yat tathāgato yāvad idaṃ tṛtīyaṃ tathāgatabalaṃ yena balena pūrvavat*",
    "XXdbsu1-4u:111": " DbSū(3) 15.4a punar aparaṃ tathāgataḥ parasatvānām indriyaparāvaratāṃ yathābhūtaṃ prajānāti",
    "XXdbsu1-4u:112": " DbSū(3) 15.4b yat tathāgataḥ parasatvānāṃ yāvad idaṃ caturthaṃ",
    "XXdbsu1-4u:113": " tathāgatabalaṃ yena balena pūrvavat*",
    "XXdbsu1-4u:114": " DbSū(3) 15.5a punar aparaṃ tathāgataḥ parasatvānāṃ nānādhimuktitāṃ yathābhūtaṃ prajānāti DbSū(3) 15.5b yat tathāgataḥ parasatvānāṃ nānādhimuktitāṃ yathābhūtaṃ prajānāti idaṃ pañcamaṃ tathāgatabalaṃ pūrvavat*",
    "XXdbsu1-4u:115": " DbSū(3) 15.6a punar aparaṃ tathāgato nānādhātukaṃ lokam anekadhātukaṃ",
    "XXdbsu1-4u:116": " yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:117": " DbSū(3) 15.6b yat tathāgato nānādhātukaṃ lokam anekadhātukaṃ yathābhūtaṃ",
    "XXdbsu1-4u:118": " prajānāti idaṃ ṣaṣṭhaṃ tathāgatabalaṃ pūrvavat*",
    "XXdbsu1-4u:119": " DbSū(3) 15.7a punar aparaṃ tathāgataḥ sarvatragāminīṃ pratipadaṃ yathābhūtaṃ prajānāti DbSū(3) 15.7b yat tathāgataḥ sarvatragāminīṃ pratipadaṃ yathābhūtaṃ prajānāti idaṃ saptamaṃ tathāgatabalaṃ pūrvavat*",
    "XXdbsu1-4u:120": " DbSū(3) 15.8a punar aparaṃ tathāgata anekavidhaṃ pūrvenivāsaṃ samanusmarati tadyathā ekām api jātiṃ dve tisraś catasraḥ paṃca ṣaṭ saptāṣṭau nava daśa viṃśat triṃśac catvāriṃśat pañcāśaj jātiśataṃ",
    "XXdbsu1-4u:121": " jātisahasraṃ jātiśatasahasram anekāny api jātiśatasahasrāṇi saṃvartakalpāṃ vivartakalpāṃ anekān api saṃvartavivartakalpāṃ samanusmarati amī nāma te satvā abhūvaṃ yatrāham āsam evaṃnāma evaṃjātya evaṃgotra evamāhāraḥ evaṃsukhaduḥkhapratisaṃvedī evaṃdīrghāyur evaṃcirasthitika",
    "XXdbsu1-4u:122": " evamāyuḥparyantaḥ so 'haṃ tasmāc cyutaḥ amutropapannas tasmād api cyutaḥ",
    "XXdbsu1-4u:123": " amutropapannaḥ tasmād api cyutaḥ ihopapanna iti sākāraṃ sanidānaṃ soddeśam anekavidhaṃ pūrvenivāsaṃ",
    "XXdbsu1-4u:124": " DbSū(3) 15.8b yat tathāgataḥ anekavidhaṃ pūrvenivāsaṃ samanusmarati tadyathā ekām api jātiṃ dve tisraḥ pūrvavad idam aṣṭamaṃ tathāgatabalaṃ yena balena pūrvavat*",
    "XXdbsu1-4u:125": " DbSū(3) 15.9a punar aparaṃ tathāgato divyena cakṣuṣā viśuddhenātikrāntamānuṣeṇa satvāṃ paśyati cyavamānān apy upapadyamānān api suvarṇān api durvarṇān api hīnān api praṇītān api sugatim api gacchato",
    "XXdbsu1-4u:126": " durgatim api yathākarmopagāṃ satvāṃ yathābhūtaṃ prajānāti itīme bhavantaḥ satvāḥ kāyaduścaritena samanvāgatā vāṅmanoduścaritena samanvāgatā āryāṇām apavādakā mithyādṛṣṭayo mithyādṛṣṭikarmadharmasamādānahetos taddhetos tatpratyayaṃ kāyasya bhedāt paraṃ maraṇād apāyadurgativinipātaṃ narakeṣūpapadyaṃte ime vā punar bhavantaḥ satvāḥ kāyasucaritena samanvāgatā vāṅmanaḥsucaritena samanvāgatā āryāṇām anapavādakāḥ samyagdṛṣṭayaḥ samyagdṛṣṭikarmadharmasamādānahetos taddhetos tatpratyayaṃ kāyasya bhedāt sugatau svargaloke deveṣūpapadyante /",
    "XXdbsu1-4u:127": " DbSū(3) 15.9b yat tathāgato divyena cakṣuṣā viśuddhenātikrāntamānuṣeṇa satvāṃ paśyati pūrvavat* idaṃ navamaṃ tathāgatabalaṃ yena balena pūrvavat*",
    "XXdbsu1-4u:128": " DbSū(3) 15.10a punar aparaṃ tathāgataḥ āsravāṇāṃ kṣayād anāsravāṃ",
    "XXdbsu1-4u:129": " cetovimuktiṃ prajñāvimuktiṃ dṛṣṭa eva dharme svayam abhijñāya sākṣīkṛtvopasaṃpadya pravedayati kṣīṇā me jātir uṣitaṃ brahmacaryaṃ kṛtaṃ karaṇīyaṃ nāparam asmād bhavaṃ prajānāmi /",
    "XXdbsu1-4u:130": " DbSū(3) 15.10b yat tathāgata āsravāṇāṃ kṣayāt pūrvavat* idaṃ daśamaṃ tathāgatabalaṃ yena balena pūrvavat*",
    "XXdbsu1-4u:131": " DbSū(3) 16 (Skt. no parallel)",
    "XXdbsu1-4u:132": " DbSū(3) 17 idam avocad bhagavān āptamanasas te bhikṣavo bhagavadbhāṣitam",
    "XXdbsu1-4u:133": " abhyanandam* ||",
    "XXdbsu1-4u:134": " DbSū(3) 18 daśabalasūtraṃ samāptaḥ || ||",
    "XXdbsu1-4u:135": " Dasabalasutra: DbSū(4) = Chinese Samyuktāgama sūtra 703 (T 99, II",
    "XXdbsu1-4u:136": " Based on the edition by Jin-il Chung: \"Ein drittes und ein viertes",
    "XXdbsu1-4u:137": " Daśabala-Sūtra\",",
    "XXdbsu1-4u:138": " Sanko Bunka Kenkyūjo Nenpo (Annual of the Sanko Research Institute for the Studies of Buddhism), 40 (2009), pp. 1-32 [17-29].",
    "XXdbsu1-4u:139": " Input by Jin-il Chung (Göttingen)",
    "XXdbsu1-4u:140": " ITALICS for restored text",
    "XXdbsu1-4u:141": " DbSū(4) 1 (Skt. not extant; cf. Sūtra 684, §1)",
    "XXdbsu1-4u:142": " DbSū(4) 2a (Skt. not extant)",
    "XXdbsu1-4u:143": " DbSū(4) 2b (Skt. not extant)",
    "XXdbsu1-4u:144": " DbSū(4) 2c (Skt. not extant)",
    "XXdbsu1-4u:145": " DbSū(4) 3 (Skt. not extant; cf. Sūtra 684, § 12)",
    "XXdbsu1-4u:146": " DbSū(4) 4 (Skt. not extant; cf. Sūtra 684, § 13)",
    "XXdbsu1-4u:147": " DbSū(4) 5.1 (Skt. not extant; cf. Sūtra 684, § 15.1a)",
    "XXdbsu1-4u:148": " DbSū(4) 5.2-7 (Skt. not extant; cf. Sūtra 684, § 15.2-7)",
    "XXdbsu1-4u:149": " DbSū(4) 5.8a (Skt. not extant; cf. Sūtra 684, § 15.8a)",
    "XXdbsu1-4u:150": " DbSū(4) 5.8b evaṃcirasthitika evamāyuḥparyantaḥ so 'haṃ tasmāc cyutaḥ amutropapannaḥ tasmāc cyutaḥ amutropapannaḥ tasmā cyutaḥ ihopapannaḥ iti sākāraṃ sanidānaṃ soddeśam anekavidhaṃ pūrvenivāsaṃ samanusmarati /",
    "XXdbsu1-4u:151": " idam aṣṭamaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ",
    "XXdbsu1-4u:152": " samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyak siṃhanādaṃ nadati /",
    "XXdbsu1-4u:153": " DbSū(4) 5.9a punar aparaṃ tathāgato divyena cakṣuṣā viśuddhenātikrāntamānuṣeṇa satvāṃ paśyati cyavamānān apy upapadyamānān api suvarṇān api durvarṇān api hīnān api praṇītān api sugatim api gacchato",
    "XXdbsu1-4u:154": " durgatim api yathākarmopagāṃ satvāṃ yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:155": " itīme bhavaṃtaḥ satvāḥ kāyaduścaritena samanvāgatā vāṅmanoduścaritena samanvāgatā āryāṇām apavādakā mithyādṛṣṭayo mithyādṛṣṭikarmadharmasamādānahetos taddhetos tatpratyayaṃ kāyasya bhedāt paraṃ maraṇād apāyadurgativinipātaṃ narakeṣūpapadyaṃte /",
    "XXdbsu1-4u:156": " ime vā punar bhavaṃtaḥ satvāḥ kāyasucaritena samanvāgatā vāṅmanaḥsucaritena samanvāgatāḥ āryāṇām anapavādakāḥ samyagdṛṣṭayaḥ samyagdṛṣṭikarmadharmasamādānahetos taddhetos tatpratyayaṃ kāyasya bhedāt sugatau svargaloke deveṣūpapadyaṃte /",
    "XXdbsu1-4u:157": " DbSū(4) 5.9b yat tathāgato divyena cakṣuṣā viśuddhenātikrāntamānuṣeṇa satvāṃ paśyati cyavamānān apy upapadyamānān api suvarṇān api durvarṇān api hīnān api praṇītān api sugatim api gacchato durgatim api yathākarmopagāṃ satvāṃ yathābhūtaṃ prajānāti /",
    "XXdbsu1-4u:158": " itīme bhavaṃtaḥ satvāḥ kāyaduścaritena samanvāgatā vāṅmanoduścaritena samanvāgatā āryāṇām apavādakā mithyādṛṣṭayo mithyādṛṣṭikarmadharmasamādānahetos taddhetos tatpratyayaṃ kāyasya bhedāt paraṃ maraṇād apāyadurgativinipātaṃ narakeṣūpapadyaṃte /",
    "XXdbsu1-4u:159": " ime vā punar bhavaṃtaḥ satvāḥ kāyasucaritena samanvāgatā vāṅmanaḥsucaritena samanvāgatā āryāṇām anapavādakāḥsamyagdṛṣṭayaḥ samyagdṛṣṭikarmadharmasamādānahetos taddhetos tatpratyayaṃkāyasa bhedāt sugatau svargaloke deveṣūpapadyaṃte /",
    "XXdbsu1-4u:160": " idaṃ navamaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ",
    "XXdbsu1-4u:161": " samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyak siṃhanādaṃ nadati /",
    "XXdbsu1-4u:162": " DbSū(4) 5.10a punar aparaṃ tathāgataḥ āsravāṇāṃ kṣayād anāsravāṃ",
    "XXdbsu1-4u:163": " cetovimuktiṃ prajñāvimuktiṃ dṛṣṭa eva dharme svayam abhijñāya sākṣīkṛtvopasaṃpadya pravedayati kṣīṇā me jātir uṣitaṃ brahmacaryaṃ kṛtaṃ karaṇīyaṃ nāparam asmād bhavaṃ prajānāmi /",
    "XXdbsu1-4u:164": " DbSū(4) 5.10b yat tathāgataḥ āsravāṇāṃ kṣayād anāsravāṃ cetovimuktiṃ",
    "XXdbsu1-4u:165": " prajñāvimuktiṃ dṛṣṭa eva dharme svayam abhijñāya sākṣīkṛtvopasaṃpadya pravedayati kṣīṇā me jātir uṣitaṃ brahmacaryaṃ kṛtaṃ karaṇīyaṃ nāparam asmād bhavaṃ prajānāmi /",
    "XXdbsu1-4u:166": " idaṃ daśamaṃ tathāgatabalaṃ yena balena samanvāgatas tathāgato 'rhaṃ samyaksaṃbuddha udāram ārṣabhaṃ sthānaṃ pratijānāti brāhmaṃ cakraṃ vartayati pariṣadi samyak siṃhanādaṃ nadati /",
    "XXdbsu1-4u:167": " DbSū(4) 6.1 taṃ cainaṃ tathāgataṃ sthānāsthānajñānabale praśnaṃ pṛccheyuḥ",
    "XXdbsu1-4u:168": " yathā tat tathāgatena sthānāsthānajñānabalaṃ jñātaṃ dṛṣṭaṃ viditaṃ vijñātaṃ samyag evābhisaṃbuddhaṃ tathā tat tathāgataḥ praśnaṃ pṛṣṭo",
    "XXdbsu1-4u:169": " vyākuryāt*",
    "XXdbsu1-4u:170": " DbSū(4) 6.2 taṃ cainaṃ tathāgataṃ karmasvakajñānabale praśnaṃ pṛccheyuḥ",
    "XXdbsu1-4u:171": " yathā tat tathāgatena karmasvakajñānabalaṃ jñātaṃ dṛṣṭaṃ viditaṃ vijñātaṃ samyag evābhisaṃbuddhaṃ tathā tat tathāgataḥ praśnaṃ pṛṣṭo vyākuryāt*",
    "XXdbsu1-4u:172": " DbSū(4) 6.3 taṃ cainaṃ tathāgataṃ dhyānavimokṣasamādhisamāpattijñānabale praśnaṃ pṛccheyuḥ yathā tat tathāgatena",
    "XXdbsu1-4u:173": " dhyānavimokṣasamādhisamāpattijñānabalaṃ jñātaṃ dṛṣṭaṃ viditaṃ vijñātaṃ samyag evābhisaṃbuddhaṃ tathā tat tathāgataḥ praśnaṃ pṛṣṭo vyākuryāt*",
    "XXdbsu1-4u:174": " DbSū(4) 6.4 taṃ cainaṃ tathāgataṃ parasatvānām indriyaparāvaratāṃ jñānabale praśnaṃ pṛccheyuḥ yathā tat tathāgatena parasatvānām indriyaparāvaratāṃ jñānabalaṃ jñātaṃ dṛṣṭaṃ viditaṃ vijñātaṃ samyag evābhisaṃbuddhaṃ tathā tat tathāgataḥ praśnaṃ pṛṣṭo vyākuryāt*",
    "XXdbsu1-4u:175": " DbSū(4) 6.5 taṃ cainaṃ tathāgataṃ parasatvānāṃ nānādhimuktijñānabale praśnaṃ pṛccheyuḥ yathā tat tathāgatena parasatvānāṃ",
    "XXdbsu1-4u:176": " nānādhimuktijñānabalaṃ jñātaṃ dṛṣṭaṃ viditaṃ vijñātaṃ samyag evābhisaṃbuddhaṃ tathā tat tathāgataḥ praśnaṃ pṛṣṭo vyākuryāt*",
    "XXdbsu1-4u:177": " DbSū(4) 6.6 taṃ cainaṃ tathāgataṃ nānādhātujñānabale praśnaṃ pṛccheyuḥ",
    "XXdbsu1-4u:178": " yathā tat tathāgatena nānādhātujñānabalaṃ jñātaṃ dṛṣṭaṃ viditaṃ vijñātaṃ samyag evābhisaṃbuddhaṃ tathā tat tathāgataḥ praśnaṃ pṛṣṭo vyākuryāt*",
    "XXdbsu1-4u:179": " DbSū(4) 6.7 taṃ cainaṃ tathāgataṃ sarvatragāminīpratipajjñānabale praśnaṃ pṛccheyuḥ yathā tat tathāgatena sarvatragāminīpratipajjñānabalaṃ jñātaṃ",
    "XXdbsu1-4u:180": " dṛṣṭaṃ viditaṃ vijñātaṃ samyag evābhisaṃbuddhaṃ tathā tat tathāgataḥ praśnaṃ pṛṣṭo vyākuryāt*",
    "XXdbsu1-4u:181": " DbSū(4) 6.8 taṃ cainaṃ tathāgataṃ pūrvenivāsānusmṛtijñānabale praśnaṃ pṛccheyuḥ yathā tat tathāgatena pūrvenivāsānusmṛtijñānabalaṃ jñātaṃ dṛṣṭaṃ viditaṃ vijñātaṃ samyag evābhisaṃbuddhaṃ tathā tat tathāgataḥ praśnaṃ",
    "XXdbsu1-4u:182": " pṛṣṭo vyākuryāt*",
    "XXdbsu1-4u:183": " DbSū(4) 6.9 taṃ cainaṃ tathāgataṃ cyutyupapādajñānabale praśnaṃ pṛccheyuḥ",
    "XXdbsu1-4u:184": " yathā tat tathāgatena cyutyupapādajñānabalaṃ jñātaṃ dṛṣṭaṃ viditaṃ vijñātaṃ samyag evābhisaṃbuddhaṃ tathā tat tathāgataḥ praśnaṃ pṛṣṭo",
    "XXdbsu1-4u:185": " vyākuryāt*",
    "XXdbsu1-4u:186": " DbSū(4) 6.10 taṃ cainaṃ tathāgataṃ āsravakṣayajñānabale praśnaṃ pṛccheyuḥ",
    "XXdbsu1-4u:187": " yathā tat tathāgatenāsravakṣayajñānabalaṃ jñātaṃ dṛṣṭaṃ viditaṃ vijñātaṃ samyag evābhisaṃbuddhaṃ tathā tat tathāgataḥ praśnaṃ pṛṣṭo vyākuryāt*",
    "XXdbsu1-4u:188": " DbSū(4) 7.1 sthānāsthānajñānabalam iti bhikṣavaḥ samāhitasya vadāmi nāsamāhitasya /",
    "XXdbsu1-4u:189": " DbSū(4) 7.2 karmasvakajñānabalam iti bhikṣavaḥ samāhitasya vadāmi nāsamāhitasya /",
    "XXdbsu1-4u:190": " DbSū(4) 7.3 dhyānavimokṣasamādhisamāpattijñānabalam iti bhikṣavaḥ",
    "XXdbsu1-4u:191": " samāhitasya vadāmi nāsamāhitasya /",
    "XXdbsu1-4u:192": " DbSū(4) 7.4 parasatvānām indriyaparāvaratāṃ jñānabalam iti bhikṣavaḥ samāhitasya vadāmi nāsamāhitasya /",
    "XXdbsu1-4u:193": " DbSū(4) 7.5 parasatvānāṃ nānādhimuktitāṃ jñānabalam iti bhikṣavaḥ samāhitasya vadāmi nāsamāhitasya",
    "XXdbsu1-4u:194": " DbSū(4) 7.6 nānādhātujñānabalam iti bhikṣavaḥ samāhitasya vadāmi nāsamāhitasya /",
    "XXdbsu1-4u:195": " DbSū(4) 7.7 sarvatragāminīpratipajjñānabalam iti bhikṣavaḥ samāhitasya vadāmi nāsamāhitasya",
    "XXdbsu1-4u:196": " DbSū(4) 7.8 pūrvenivāsānusmṛtijñānabalam iti bhikṣavaḥ samāhitasya vadāmi nāsamāhitasya",
    "XXdbsu1-4u:197": " DbSū(4) 7.9 (Skt. not extant)",
    "XXdbsu1-4u:198": " DbSū(4) 7.10 (Skt. not extant)",
    "XXdbsu1-4u:199": " DbSū(4) 8 (Skt. not extant)",
    "XXdbsu1-4u:200": " DbSū(4) 9 (Skt. not extant; cf. Sūtra 684, § 17)"
}